{
  "prior_works": [
    {
      "title": "Human Decisions and Machine Predictions",
      "authors": "Jon Kleinberg; Himabindu Lakkaraju; Jure Leskovec; Jens Ludwig; Sendhil Mullainathan",
      "year": 2018,
      "role": "Conceptual foundation for using prediction as a policy lever",
      "relationship_sentence": "Established the prediction-policy paradigm showing how risk scores can reallocate scarce public resources relative to human or capacity-based baselines, directly motivating this paper’s comparison of predictive triage versus expanding bureaucratic capacity."
    },
    {
      "title": "Who Should Be Treated? Empirical Welfare Maximization Methods for Treatment Choice",
      "authors": "Toru Kitagawa; Aleksey Tetenov",
      "year": 2018,
      "role": "Methodological foundation for welfare-based policy evaluation under constraints",
      "relationship_sentence": "Provides formal tools to evaluate and select policies that maximize welfare under budget/capacity constraints, underpinning the paper’s analytical framing of how prediction affects the welfare of the worst-off."
    },
    {
      "title": "Policy Learning with Observational Data",
      "authors": "Susan Athey; Stefan Wager",
      "year": 2021,
      "role": "Estimation and evaluation toolkit for data-driven policy design",
      "relationship_sentence": "Supplies econometric machinery to learn and evaluate targeting policies from observational data, enabling the paper’s practical, data-driven assessment of predictive systems in the German unemployment case study."
    },
    {
      "title": "Fairness Behind a Veil of Ignorance: A Welfare Analysis for Automated Decision Making",
      "authors": "Hoda Heidari; Krishna P. Gummadi; Andreas Krause",
      "year": 2018,
      "role": "Normative framework linking fairness to social welfare with emphasis on the worst-off",
      "relationship_sentence": "Connects ML objectives to egalitarian social welfare criteria (e.g., Rawlsian), directly informing the paper’s equity-driven objective of surfacing and prioritizing the worst-off rather than maximizing aggregate outcomes."
    },
    {
      "title": "Fairness Without Demographics in Repeated Loss Minimization",
      "authors": "Tatsunori Hashimoto; Megha Srivastava; Hongseok Namkoong; Percy Liang",
      "year": 2018,
      "role": "Optimization perspective on protecting the worst-off",
      "relationship_sentence": "Introduces distributionally robust methods that control worst-case (worst-off) losses, motivating the paper’s modeling focus on tail risk and equity rather than average predictive performance."
    },
    {
      "title": "Dissecting Racial Bias in an Algorithm Used to Manage the Health of Populations",
      "authors": "Ziad Obermeyer; Brian Powers; Christine Vogeli; Sendhil Mullainathan",
      "year": 2019,
      "role": "Empirical precedent on welfare harms from mismeasured prediction targets",
      "relationship_sentence": "Shows how target choice can misidentify the truly worst-off in resource allocation, reinforcing this paper’s insistence on welfare-grounded outcomes when judging the value of prediction."
    },
    {
      "title": "Performative Prediction",
      "authors": "Juan C. Perdomo; Celestine Mendler-Dünner; Moritz Hardt",
      "year": 2020,
      "role": "Dynamic perspective on predictions used in decision-making",
      "relationship_sentence": "Highlights that deploying predictions changes outcomes and populations, informing this paper’s policy-aware modeling of prediction’s welfare impact in administrative settings like unemployment services."
    }
  ],
  "synthesis_narrative": "This paper sits at the intersection of prediction for public policy, welfare-centric fairness, and policy evaluation under constraints. The prediction-policy paradigm articulated by Kleinberg et al. anchors the central question: when and how does prediction improve public decision-making relative to baseline bureaucratic capacity? Translating this question into welfare terms, Kitagawa and Tetenov’s empirical welfare maximization provides the blueprint for comparing policies under budget or capacity limits, while Athey and Wager supply robust tools to learn and evaluate targeting rules from observational data—critical for the paper’s real-world unemployment application.\n\nOn the equity objective—identifying and prioritizing the worst-off—the paper draws normative grounding from Heidari et al., who connect automated decisions to social-welfare criteria emphasizing protection of the least advantaged. Hashimoto et al. complement this by framing optimization around worst-case performance, aligning with the paper’s focus on tail risks rather than averages. Obermeyer et al. caution that naive predictive targets can fail to surface those most in need, motivating the authors’ careful, welfare-based target selection and evaluation.\n\nFinally, Perdomo et al.’s performative prediction perspective informs the policy-aware modeling: predictions shape behaviors and outcomes in administrative systems, affecting the very distribution of need. Together, these works directly enable the paper’s core contribution: analytical and empirical frameworks that quantify the welfare value of prediction, and benchmark it against expanding bureaucratic capacity, to help policymakers design systems that truly surface and serve the worst-off.",
  "analysis_timestamp": "2026-01-07T00:21:32.387382"
}