{
  "prior_works": [
    {
      "title": "Local Privacy and Statistical Minimax Rates",
      "authors": "John C. Duchi et al.",
      "year": 2013,
      "role": "Foundation",
      "relationship_sentence": "Provides the formal local differential privacy (LDP) definition and minimax perspective that UPGNET adopts when designing and analyzing its node-feature perturbation pipeline."
    },
    {
      "title": "Extremal Mechanisms for Local Differential Privacy",
      "authors": "Kamalika Kairouz et al.",
      "year": 2014,
      "role": "Foundation",
      "relationship_sentence": "Characterizes optimal LDP mechanisms and their trade-offs, directly informing UPGNET’s choice and generalization of feature-perturbation protocols within its three-stage pipeline."
    },
    {
      "title": "RAPPOR: Randomized Aggregatable Privacy-Preserving Ordinal Response",
      "authors": "Úlfar Erlingsson et al.",
      "year": 2014,
      "role": "Foundation",
      "relationship_sentence": "Introduces the encode–perturb–aggregate paradigm for high-dimensional, sparse categorical features under LDP, which UPGNET generalizes from single-vector reporting to graph node features propagated through GNN message passing."
    },
    {
      "title": "Hadamard Response: Estimating Distributions Efficiently Under Local Privacy",
      "authors": "Jayadev Acharya et al.",
      "year": 2019,
      "role": "Baseline",
      "relationship_sentence": "Serves as a state-of-the-art high-dimensional LDP protocol whose utility degrades with feature dimension; UPGNET extends this line by making the perturbation and aggregation graph- and depth-aware, explicitly addressing feature-dimension effects."
    },
    {
      "title": "Inductive Representation Learning on Large Graphs",
      "authors": "William L. Hamilton et al.",
      "year": 2017,
      "role": "Extension",
      "relationship_sentence": "Introduces neighborhood sampling to control neighborhood explosion; UPGNET leverages and adapts this idea to bound LDP noise accumulation across hops, identifying neighborhood size as a key factor for deep private GNN utility."
    },
    {
      "title": "DropEdge: Towards Deep Graph Convolutional Networks on Node Classification",
      "authors": "Yu Rong et al.",
      "year": 2020,
      "role": "Inspiration",
      "relationship_sentence": "Demonstrates that reducing edges/neighborhood size alleviates depth-induced degradation in GNNs, inspiring UPGNET’s neighborhood-size control to mitigate privacy noise amplification when going deeper under LDP."
    },
    {
      "title": "Deeper Insights into Graph Convolutional Networks for Semi-Supervised Learning",
      "authors": "Qimai Li et al.",
      "year": 2018,
      "role": "Gap Identification",
      "relationship_sentence": "Analyzes oversmoothing and depth limitations in GNNs; UPGNET targets the amplified version of this challenge under LDP noise, motivating its analysis of depth, neighborhood size, and feature-dimension impacts."
    }
  ],
  "synthesis_narrative": "UPGNET’s core innovation—an LDP-aware, three-stage pipeline for node features that enables deeper graph neural networks with improved utility—emerges at the intersection of local privacy mechanisms and graph message passing. Foundational LDP works by Duchi et al. and Kairouz–Oh–Viswanath established the local privacy formalism, optimality insights, and trade-offs that govern any feature perturbation strategy. RAPPOR operationalized these principles into an encode–perturb–aggregate paradigm for high-dimensional categorical data; UPGNET explicitly generalizes this paradigm from single-vector collection to the graph setting, where perturbed node features subsequently propagate through neighborhoods. Hadamard Response provides an efficient high-dimensional LDP baseline but suffers utility loss that grows with feature dimension; UPGNET squarely addresses this limitation by analyzing and redesigning the perturbation/aggregation flow in the presence of graph propagation. On the graph-learning side, GraphSAGE’s neighborhood sampling revealed that controlling neighborhood expansion is essential for scalable GNNs, a principle that DropEdge later sharpened to enable deeper models by reducing edges. UPGNET extends these ideas to the privacy regime: it identifies neighborhood size as a second, privacy-critical factor because each additional hop compounds LDP noise. Finally, insights from Li et al. on oversmoothing and depth limits motivate UPGNET’s goal of “going deeper” under LDP, where noise amplification exacerbates classic depth issues. Together, these works directly shape UPGNET’s dimension- and neighborhood-aware design for locally private, deeper GNNs.",
  "analysis_timestamp": "2026-01-06T23:07:19.609531"
}