{
  "prior_works": [
    {
      "title": "Conformalized Quantile Regression",
      "authors": "Yaniv Romano et al.",
      "year": 2019,
      "role": "Extension",
      "relationship_sentence": "Provides the conformal calibration of lower quantiles that this paper adapts to survival times, replacing standard scores with censoring-aware, weighted scores after imputation."
    },
    {
      "title": "Distribution-Free Predictive Inference for Regression",
      "authors": "Jing Lei et al.",
      "year": 2018,
      "role": "Foundation",
      "relationship_sentence": "Introduces split conformal prediction as a general, distribution-free calibration framework that the proposed survival method builds on to obtain finite-sample calibrated lower bounds."
    },
    {
      "title": "Conformal Prediction under Covariate Shift",
      "authors": "Ryan J. Tibshirani et al.",
      "year": 2019,
      "role": "Extension",
      "relationship_sentence": "Establishes importance-weighted conformal calibration, a key ingredient the paper leverages to correct for censoring-induced selection via weights tied to the censoring mechanism."
    },
    {
      "title": "Doubly robust estimation in missing data and causal inference",
      "authors": "Hyunseung Bang et al.",
      "year": 2005,
      "role": "Inspiration",
      "relationship_sentence": "Introduces the doubly robust paradigm that directly motivates this paper’s asymptotic double robustness—validity when either the censoring model or the survival outcome model is correct."
    },
    {
      "title": "Correcting for noncompliance and dependent censoring in an AIDS clinical trial with inverse probability of censoring weighted (IPCW) log-rank tests",
      "authors": "James M. Robins et al.",
      "year": 2000,
      "role": "Foundation",
      "relationship_sentence": "Establishes IPCW for right-censored data, underpinning the paper’s use of censoring-model-based weighting inside conformal calibration to address informative dropout."
    },
    {
      "title": "Linear regression with censored data",
      "authors": "James Buckley et al.",
      "year": 1979,
      "role": "Related Problem",
      "relationship_sentence": "Introduces imputation-based handling of censoring in regression, inspiring the paper’s strategy of imputing latent censoring times before conformal calibration."
    },
    {
      "title": "Nonparametric Estimation from Incomplete Observations",
      "authors": "Edward L. Kaplan et al.",
      "year": 1958,
      "role": "Foundation",
      "relationship_sentence": "Defines the canonical right-censoring framework and survival function estimation that the paper’s problem formulation and evaluation hinge upon."
    }
  ],
  "synthesis_narrative": "The paper’s core idea—distribution-free lower prediction bounds for survival times under general right censoring with an asymptotic doubly robust guarantee—stands on two pillars: conformal calibration and semiparametric missing-data theory. Split conformal inference (Lei et al., 2018) and conformalized quantile regression (Romano et al., 2019) supply the calibration machinery for lower bounds, which the authors adapt to survival outcomes. Crucially, they integrate importance-weighted conformal calibration (Tibshirani et al., 2019) so that the nonconformity scores are reweighted to offset selection induced by censoring, paralleling the inverse-probability-of-censoring-weighting logic established by Robins and collaborators (Robins et al., 2000). The methodological innovation is to first impute latent censoring times with a flexible ML model—an idea in the spirit of imputation strategies for censored regression dating back to Buckley–James (1979)—and then conformally calibrate a survival model on the imputed data using censoring-aware weights. The asymptotic double robustness property directly echoes the Bang–Robins (2005) paradigm: validity holds if either the censoring model (used for imputation/weights) or the survival model is well specified. Finally, the right-censoring formulation and empirical evaluation are grounded in the classical Kaplan–Meier framework (Kaplan–Meier, 1958). Together, these works directly enable the paper’s leap from prior conformal survival procedures limited to type-I censoring to a robust, general right-censoring solution with principled guarantees.",
  "analysis_timestamp": "2026-01-06T23:07:19.624482"
}