{
  "prior_works": [
    {
      "title": "Iterative Combinatorial Auctions",
      "authors": "David C. Parkes",
      "year": 2006,
      "role": "Foundational ICA framework (activity rules, price updates, bid/demand formats)",
      "relationship_sentence": "Established the practical ICA paradigm and formalized demand-query-based bidding and price adjustment—providing the operational scaffold that the new MLHCA augments with learning from both demand and value signals."
    },
    {
      "title": "Ascending Auctions with Package Bidding",
      "authors": "Lawrence M. Ausubel, Paul R. Milgrom",
      "year": 2002,
      "role": "Introduced ascending price package auctions and demand-revelation logic",
      "relationship_sentence": "Supplied the conceptual basis for using demand responses at posted prices to infer preferences, which the paper leverages by integrating these demand signals with value queries in a single ML learning pipeline."
    },
    {
      "title": "The Combinatorial Clock Auction",
      "authors": "Lawrence M. Ausubel, Peter Cramton, Paul R. Milgrom",
      "year": 2017,
      "role": "Practical ICA format widely used in spectrum auctions relying on demand queries",
      "relationship_sentence": "Motivated aligning ML-based elicitation with practice by showing the centrality of demand queries in real-world ICAs; the new auction explicitly incorporates such demand feedback alongside value queries."
    },
    {
      "title": "The Communication Requirements of Efficient Allocations and Supporting Prices",
      "authors": "Noam Nisan, Ilya Segal",
      "year": 2006,
      "role": "Theory linking values, demand queries, and price-supported equilibria",
      "relationship_sentence": "Provided the formal backbone for combining information from value and demand queries, underpinning the paper’s claims of provably extracting the full information content from both signal types."
    },
    {
      "title": "The Package Assignment Model",
      "authors": "Sushil Bikhchandani, Andrew M. Ostroy",
      "year": 2002,
      "role": "Walrasian prices and demand-based characterization of efficient allocations",
      "relationship_sentence": "Established how prices and demand reveal structure about efficient allocations, informing the paper’s price- and demand-aware learning objectives and update rules."
    },
    {
      "title": "Machine Learning–Powered Iterative Combinatorial Auctions (MLCA)",
      "authors": "Frank Brero, Benjamin Lubin, Christian A. C. Lahaie, Sven Seuken",
      "year": 2018,
      "role": "First ML-based ICA using value-query elicitation and predictive models",
      "relationship_sentence": "Served as the immediate SOTA baseline that elicits via value queries only; the new work generalizes this ML framework to also ingest demand queries and shows large efficiency gains."
    },
    {
      "title": "Mechanisms for Complement-Free Bidders via Demand Queries",
      "authors": "Shahar Dobzinski, Noam Nisan",
      "year": 2010,
      "role": "Algorithmic demonstration of the power of demand queries for welfare maximization",
      "relationship_sentence": "Highlighted the informational strength of demand queries, directly motivating their inclusion as first-class signals in the paper’s learning algorithm alongside value queries."
    }
  ],
  "synthesis_narrative": "The paper’s core innovation—an ML-powered ICA that jointly exploits value and demand queries—rests on two pillars: the practical centrality of demand-query ICAs and the theoretical link between prices, demand, and values. Foundational ICA work by Parkes and the ascending-package/CCA designs of Ausubel, Milgrom, and Cramton established demand queries and price adjustment as the operative interface in real markets, motivating an ML design that must learn from demand, not just values. On the theory side, Nisan–Segal and Bikhchandani–Ostroy formalized how price-supported equilibria and demand responses encode bidders’ preferences, offering the blueprint for provably extracting information from demand alongside values. \n\nThe immediate antecedent is the MLCA line (Brero–Lahaie–Lubin–Seuken), which demonstrated that predictive models and active elicitation can markedly accelerate value-query ICAs—but remained value-only. Complementing this, algorithmic results like Dobzinski–Nisan underscored the power of demand queries for welfare approximation, reinforcing that a value-only ML approach leaves substantial information untapped. \n\nSynthesizing these strands, the present work designs learning targets and update rules that fuse value observations with demand-at-prices, proving that both signals can be fully exploited within one estimator and then embedding this into a hybrid auction (MLHCA). The result is an ICA that aligns with practice (demand queries), augments it with value-query learning when useful, and empirically achieves large efficiency gains over prior MLCA-style baselines.",
  "analysis_timestamp": "2026-01-07T00:04:09.163201"
}