{
  "prior_works": [
    {
      "title": "Stochastic Model-Based Minimization of Weakly Convex Functions",
      "authors": "Damek Davis, Dmitriy Drusvyatskiy",
      "year": 2019,
      "role": "Moreau-envelope foundation and stochastic proximal analysis",
      "relationship_sentence": "This work established the Moreau-envelope viewpoint and inexact/prox-guided stochastic analysis for weakly convex objectives, which the paper extends to constrained settings by estimating the envelope gradient via a single stochastic primal–dual (linearized AL) step."
    },
    {
      "title": "Stochastic First- and Zeroth-Order Methods for Nonconvex Stochastic Programming",
      "authors": "Saeed Ghadimi, Guanghui Lan",
      "year": 2013,
      "role": "Rate benchmark for stochastic nonconvex optimization",
      "relationship_sentence": "Provides baseline O(ε^-4) sample complexity for finding stationary points in stochastic nonconvex optimization, a benchmark the paper matches while introducing linear inequality constraints and primal–dual smoothing."
    },
    {
      "title": "SPIDER: Near-Optimal Nonconvex Optimization via Stochastic Path-Integrated Differential Estimator",
      "authors": "Cong Fang, Chris Junchi Li, Zhouchen Lin",
      "year": 2018,
      "role": "Near-optimal sample complexity methods",
      "relationship_sentence": "Delivers O(ε^-3) sample complexity for nonconvex problems and informs the paper’s second algorithm achieving O(ε^-3) by coupling variance-reduced-style gradient estimation with a Moreau-envelope/primal–dual framework under constraints."
    },
    {
      "title": "Augmented Lagrangians and Applications of the Proximal Point Algorithm in Convex Programming",
      "authors": "R. Tyrrell Rockafellar",
      "year": 1976,
      "role": "Augmented Lagrangian and proximal point foundations",
      "relationship_sentence": "Provides the conceptual and algorithmic underpinnings of augmented Lagrangian and proximal methodologies that the paper linearizes into a single-step stochastic primal–dual move to approximate the Moreau-envelope gradient for constrained problems."
    },
    {
      "title": "On Approximate Solutions of Systems of Linear Inequalities",
      "authors": "A. J. Hoffman",
      "year": 1952,
      "role": "Global error bounds for linear inequalities (Hoffman bound)",
      "relationship_sentence": "The Hoffman bound supplies a global error bound linking feasibility residuals to distance from the feasible set, which the paper leverages to control constraint violation in its stochastic inequality-constrained analysis."
    },
    {
      "title": "Error Bound Properties of a System of Convex Inequalities",
      "authors": "Zhi-Quan Luo, Paul Tseng",
      "year": 1992,
      "role": "Error bound theory for constrained optimization",
      "relationship_sentence": "Develops global error bound machinery for convex inequality systems, informing the paper’s use of recent error-bound results to relate primal–dual residuals to stationarity under linear inequality constraints."
    },
    {
      "title": "Convergence of Alternating Direction Method of Multipliers for Nonconvex Problems",
      "authors": "Mingyi Hong, Zhi-Quan Luo, Junfeng Yang",
      "year": 2016,
      "role": "Nonconvex primal–dual/ALM methodology",
      "relationship_sentence": "Analyzes primal–dual and augmented Lagrangian methods in nonconvex settings, motivating the paper’s use of a linearized augmented Lagrangian primal–dual step as a building block inside the Moreau-envelope inexact gradient scheme."
    }
  ],
  "synthesis_narrative": "The paper’s core contribution—single-loop stochastic smoothed primal–dual algorithms for nonconvex problems with linear inequality constraints—rests on three pillars unified into one framework. First, Davis and Drusvyatskiy’s Moreau-envelope perspective for weakly convex objectives enables treating nonconvexity via inexact gradient descent on a smooth envelope; the present work adapts this idea to constrained problems by estimating the envelope gradient with just one linearized augmented Lagrangian (primal–dual) step. This primal–dual step is grounded in classic ALM and proximal point principles (Rockafellar) and modern nonconvex primal–dual theory (Hong–Luo–Razaviyayn), ensuring that a single stochastic update meaningfully approximates the proximal/envelope map while handling Lagrange multipliers for inequalities.\nSecond, the analysis of inequality constraints hinges on global error bounds: the Hoffman bound provides a quantitative link between residuals and distance to feasibility for linear systems, while Luo–Tseng–style error bound theory informs how residuals translate into stationarity guarantees. By combining these bounds with Moreau-envelope arguments, the paper derives convergence to approximate KKT points without projections.\nThird, the sample complexity targets are calibrated against nonconvex stochastic benchmarks: Ghadimi–Lan’s O(ε^-4) rate and the near-optimal O(ε^-3) rates from SPIDER. By integrating variance-reduction-style gradient estimation ideas into the envelope/primal–dual estimator, the paper attains O(ε^-4) and O(ε^-3) sample complexities in their respective algorithmic regimes. Together, these strands yield a projection-free, single-loop stochastic primal–dual method with optimal rates for inequality-constrained nonconvex optimization.",
  "analysis_timestamp": "2026-01-07T00:21:32.367501"
}