{
  "prior_works": [
    {
      "title": "Hiding Images in Plain Sight: Deep Steganography",
      "authors": "Shumeet Baluja",
      "year": 2017,
      "role": "Baseline",
      "relationship_sentence": "Established the end-to-end image-in-image hiding formulation and encoder/decoder training paradigm that the proposed network directly builds on and extends to the multi-recipient setting with authentication."
    },
    {
      "title": "HiDDeN: Hiding Data With Deep Networks",
      "authors": "Jiren Zhu et al.",
      "year": 2018,
      "role": "Related Problem",
      "relationship_sentence": "Provided the neural hiding/revealing pipeline with differentiable noise and adversarial training; the proposed method adopts this learning setup while targeting isolated reception and explicit authentication."
    },
    {
      "title": "Glow: Generative Flow with Invertible 1x1 Convolutions",
      "authors": "Diederik P. Kingma and Prafulla Dhariwal",
      "year": 2018,
      "role": "Foundation",
      "relationship_sentence": "Introduced practical invertible flow architectures that enable bijective mappings; the paper’s invertible steganography backbone and two-stage distribution adaptation are directly enabled by Glow-style invertible transformations."
    },
    {
      "title": "Separable Reversible Data Hiding in Encrypted Image",
      "authors": "Xinpeng Zhang",
      "year": 2011,
      "role": "Inspiration",
      "relationship_sentence": "Pioneered the idea of separability with different keys for distinct receivers/tasks; this directly inspires the paper’s separate authentication via multiple lock–key pairs that isolate who can verify versus who can reveal."
    },
    {
      "title": "An Invisible Watermarking Technique for Image Authentication",
      "authors": "Minerva M. Yeung and F. Mintzer",
      "year": 1997,
      "role": "Foundation",
      "relationship_sentence": "Formulated image authentication via fragile watermarking; the capacity overhead and interference of authentication payloads highlighted by this line of work motivate the paper’s efficiency-driven separation of authentication from hidden content."
    },
    {
      "title": "Learning to Protect Communications with Adversarial Neural Cryptography",
      "authors": "Martin Abadi and David G. Andersen",
      "year": 2016,
      "role": "Inspiration",
      "relationship_sentence": "Demonstrated key-conditioned neural encryption/decryption; the proposed lock–key generation and key-conditioned revealing mechanism borrow this learned-cryptosystem perspective to realize authenticated, isolated extraction."
    }
  ],
  "synthesis_narrative": "The paper’s core idea—efficient, separate authentication for multi-recipient image steganography using an invertible network—emerges from two converging threads. First, deep image hiding was established by Baluja’s end-to-end image-in-image framework and later generalized to robust, neural encoder–decoder training by HiDDeN. These works defined the learning setup (cover–container–secret triad, differentiable distortions, and end-to-end optimization) that the present method adopts as its baseline training paradigm. Second, invertible flows, as instantiated by Glow, made it practical to enforce bijective mappings with tractable Jacobians in image models. This invertibility is crucial for distributing and recovering large-capacity hidden information without loss, enabling the paper’s two-stage distribution adaptation between secrets and keys.\nParallel progress in information hiding and authentication supplied the separability concept the authors exploit. Yeung and Mintzer framed the image authentication problem using fragile watermarking, but their approach and descendants impose payload overhead that competes with content capacity—precisely the inefficiency this paper targets. Zhang’s separable reversible data hiding in encrypted images introduced the principle of task/key separation: different keys unlock different functions. This directly informs the proposed separate authentication mechanism via multiple lock–key pairs so that recipients can be isolated in what they can verify or reveal. Finally, Abadi and Andersen’s adversarial neural cryptography motivates learning key-conditioned hide/reveal pathways. Together, these works shape a system that maintains large-capacity, multi-recipient hiding while decoupling authentication from payload to avoid capacity loss and cross-recipient leakage.",
  "analysis_timestamp": "2026-01-06T23:07:19.588602"
}