{
  "prior_works": [
    {
      "title": "Generative Social Choice",
      "authors": "Niclas Boehmer et al.",
      "year": 2024,
      "role": "Baseline",
      "relationship_sentence": "Introduced the original generative social choice framework that queries LLMs to synthesize representative slates; the 2025 paper explicitly extends it with guarantees for approximately optimal queries and a global length (budget) constraint."
    },
    {
      "title": "Justified Representation in Approval-Based Committee Voting",
      "authors": "Haris Aziz et al.",
      "year": 2017,
      "role": "Foundation",
      "relationship_sentence": "Formalized proportional fairness (JR/PJR) in approval-based committee elections, which underpins the paper’s objective of proportionally representing the spectrum of opinions in the generated slate."
    },
    {
      "title": "A note on maximizing a submodular set function subject to a knapsack constraint",
      "authors": "Maxim Sviridenko",
      "year": 2004,
      "role": "Extension",
      "relationship_sentence": "Provides the core algorithmic template and approximation guarantees for monotone submodular maximization under a knapsack (budget) constraint, directly enabling the paper’s length-budgeted slate selection guarantees."
    },
    {
      "title": "Maximization of Approximately Submodular Functions",
      "authors": "Thibaut Horel et al.",
      "year": 2016,
      "role": "Extension",
      "relationship_sentence": "Analyzes greedy optimization when function evaluations are approximate/noisy, which the paper adapts to justify theoretical guarantees when LLM-driven queries yield only approximately optimal statements."
    },
    {
      "title": "Multi-Document Summarization via Budgeted Maximization of Submodular Functions",
      "authors": "Hui Lin et al.",
      "year": 2010,
      "role": "Related Problem",
      "relationship_sentence": "Pioneered selecting a representative set of text units under a length budget via submodular maximization, informing the paper’s shift from cardinality-limited committees to length-budgeted slates of statements."
    },
    {
      "title": "Democratic Inputs to AI",
      "authors": "Ariel D. Procaccia",
      "year": 2023,
      "role": "Inspiration",
      "relationship_sentence": "Articulated a research agenda for using social choice to aggregate human preferences for AI systems, directly motivating the generative social choice paradigm that this paper advances."
    }
  ],
  "synthesis_narrative": "The core innovation of Generative Social Choice: The Next Generation is to endow the generative social choice framework with rigorous guarantees under two real-world frictions: only approximately optimal query results from large language models and a global budget on slate length. This builds directly on the original Generative Social Choice baseline, which married approval-based multiwinner objectives with LLM querying to synthesize representative slates from unstructured opinions. The proportional fairness target itself is grounded in approval-based committee voting theory, most notably the justified representation guarantees formalized by Aziz et al., which the generative setting seeks to emulate for statements rather than fixed candidates. The paper’s new budgeted formulation leans on classical submodular maximization under knapsack constraints, with Sviridenko’s results providing the algorithmic and approximation backbone for length-limited slate construction. Because LLM-driven queries inevitably produce approximate or noisy evaluations, the analysis of greedy optimization with inaccurate function values by Horel and Singer supplies the key robustness tools the paper adapts to prove performance despite approximate queries. Finally, Lin and Bilmes’s budgeted submodular approach to text summarization offers a closely related paradigm—selecting representative text under a length budget—that informs how to operationalize proportional representation when the items are variable-length statements rather than fixed-size candidates. Together with the broader motivation of democratic inputs to AI, these works form the direct intellectual lineage of the paper’s theoretical and algorithmic advances.",
  "analysis_timestamp": "2026-01-06T23:07:19.561747"
}