{
  "prior_works": [
    {
      "title": "NeuralLP: Differentiable Learning of Logic Rules for Knowledge Base Reasoning",
      "authors": "Fan Yang, Zhilin Yang, William W. Cohen",
      "year": 2017,
      "role": "Pioneering differentiable logic-based multi-hop reasoning on knowledge bases",
      "relationship_sentence": "Established that multi-hop logical reasoning over KGs can be learned end-to-end, motivating later CQA setups that this paper scrutinizes for lacking truly multi-hop difficulty."
    },
    {
      "title": "Embedding Logical Queries on Knowledge Graphs (GQE)",
      "authors": "William L. Hamilton et al.",
      "year": 2018,
      "role": "Introduced embedding-based answering of existential positive first-order (EPFO) queries and a template-driven evaluation protocol",
      "relationship_sentence": "Defined the CQA task and standard query shapes (e.g., chains, intersections) that subsequent benchmarks adopted—precisely the family of queries the present paper analyzes for reducibility."
    },
    {
      "title": "Query2Box: Reasoning over Knowledge Graphs in Vector Space Using Box Embeddings",
      "authors": "Hongyu Ren, Rex Ying, Jure Leskovec",
      "year": 2020,
      "role": "Advanced CQA with box embeddings and popularized synthetic query generation on FB15k-237/NELL995-style splits",
      "relationship_sentence": "Helped standardize current CQA benchmarks and query-generation recipes that the paper shows can collapse to single-link predictions in the vast majority of cases."
    },
    {
      "title": "Beta Embeddings for Multi-Hop Logical Reasoning in Knowledge Graphs (BetaE)",
      "authors": "Hongyu Ren, Jure Leskovec",
      "year": 2020,
      "role": "State-of-the-art probabilistic embedding framework for EPFO queries with widely adopted evaluation",
      "relationship_sentence": "Represents the dominant modeling and evaluation paradigm whose reported gains the paper re-evaluates under non-reducible, truly multi-hop benchmarks."
    },
    {
      "title": "Complex Query Decomposition for Knowledge Graphs (CQD)",
      "authors": "Tigran Arakelyan et al.",
      "year": 2021,
      "role": "Showed that complex logical queries can be decomposed into neural link prediction subproblems combined by t-norm semantics",
      "relationship_sentence": "Directly foreshadows the paper’s central finding by operationalizing the reduction of complex queries to link prediction, which works well precisely because current benchmarks are highly reducible."
    },
    {
      "title": "GNN-QE: Learning to Answer Complex Queries on Knowledge Graphs with Graph Neural Networks",
      "authors": "Chao Zhang et al.",
      "year": 2021,
      "role": "Strong GNN-based CQA model leveraging message passing over KG structure on standard query templates",
      "relationship_sentence": "Serves as a representative SOTA method whose performance the paper shows drops when evaluated on non-reducible multi-hop benchmarks."
    },
    {
      "title": "ConE: Cone Embeddings for Multi-hop Reasoning over Knowledge Graphs",
      "authors": "Yuyu Zhang et al.",
      "year": 2021,
      "role": "Geometric approach for set-like reasoning on EPFO queries within the prevailing benchmark protocol",
      "relationship_sentence": "Another influential CQA model built around the same query templates and splits; its behavior under the proposed harder benchmarks illustrates the field’s overestimation of progress."
    }
  ],
  "synthesis_narrative": "The core contribution of the paper is a careful audit of complex query answering (CQA) benchmarks, showing that most queries are reducible to simpler link prediction problems and that state-of-the-art methods falter on non-reducible, truly multi-hop queries. This rests on, and reinterprets, the trajectory set by prior work. Early differentiable logic approaches such as NeuralLP demonstrated that multi-hop, rule-based reasoning over KGs is learnable, motivating the field to formalize logical query answering. GQE crystallized this into embedding-based answering of EPFO queries and introduced the canonical template-driven evaluation protocol with chain and intersection shapes. Query2Box and BetaE then advanced modeling capacity and popularized standardized query generation on FB15k-237/NELL995-style data, entrenching benchmarks that the present paper analyzes. In parallel, CQD provided a crucial insight: many complex queries can be decomposed into link prediction subproblems combined via t-norms, implicitly relying on benchmark reducibility. Subsequent strong baselines such as GNN-QE and ConE pushed performance within this same setup, reinforcing a consensus around the difficulty of CQA. The present paper synthesizes these strands by quantifying how often such queries collapse to single-edge predictions, constructing new benchmarks that enforce multi-hop reasoning, and demonstrating sharp performance drops across these influential models—thereby reframing what progress in CQA should look like.",
  "analysis_timestamp": "2026-01-07T00:21:32.389937"
}