{
  "prior_works": [
    {
      "title": "ClipOGD (first method achieving Õ(√T) Neyman regret for adaptive ATE design)",
      "authors": [
        "Dai et al."
      ],
      "year": 2023,
      "role": "immediate methodological precursor",
      "relationship_sentence": "This work introduced the ClipOGD algorithm and the first sublinear (Õ(√T)) Neyman regret guarantee for unbiased ATE estimation under adaptive designs, providing the baseline method and analysis framework that the present paper strengthens to anytime Õ(log T) and extends to contextual multigroup guarantees."
    },
    {
      "title": "On the Application of Probability Theory to Agricultural Experiments. Essay on Principles. Section 9",
      "authors": [
        "Jerzy Neyman"
      ],
      "year": 1923,
      "role": "theoretical foundation (design-based causal inference)",
      "relationship_sentence": "Neyman’s design-based potential outcomes framework underpins unbiased ATE estimation and variance analysis for randomized experiments, the foundational inferential model in which Neyman regret is defined and analyzed in this paper."
    },
    {
      "title": "On the two different aspects of the representative method: the method of stratified sampling and the method of purposive selection",
      "authors": [
        "Jerzy Neyman"
      ],
      "year": 1934,
      "role": "optimal nonadaptive baseline (Neyman allocation)",
      "relationship_sentence": "Neyman allocation characterizes the variance-minimizing nonadaptive assignment (including within strata), which serves as the hindsight-optimal benchmark against which Neyman regret is measured and to which the new adaptive designs asymptotically compare."
    },
    {
      "title": "A Generalization of Sampling Without Replacement",
      "authors": [
        "D. G. Horvitz",
        "D. J. Thompson"
      ],
      "year": 1952,
      "role": "unbiasedness under unequal/adaptive assignment",
      "relationship_sentence": "The Horvitz–Thompson estimator guarantees unbiased ATE estimation under unequal and adaptively changing treatment probabilities, enabling the paper’s adaptive designs to remain unbiased while optimizing regret against variance benchmarks."
    },
    {
      "title": "Logarithmic Regret Algorithms for Online Convex Optimization",
      "authors": [
        "Elad Hazan",
        "Amit Agarwal",
        "Satyen Kale"
      ],
      "year": 2007,
      "role": "regret analysis tool (strong convexity → O(log T))",
      "relationship_sentence": "This paper establishes that online optimization over strongly convex objectives admits O(log T) regret, a key analytic ingredient leveraged to modify ClipOGD and prove anytime Õ(log T) Neyman regret under boundedness/strong-convexity-like conditions on variance objectives."
    },
    {
      "title": "Preventing Fairness Gerrymandering: Auditing and Learning for Subgroup Fairness",
      "authors": [
        "Michael Kearns",
        "Seth Neel",
        "Aaron Roth",
        "Zhiwei S. Wu"
      ],
      "year": 2018,
      "role": "conceptual template for multigroup guarantees",
      "relationship_sentence": "This work introduces guarantees that hold simultaneously over many (possibly overlapping) subgroups, inspiring the paper’s contextual “multigroup” Neyman regret notion and the associated comparison against each group’s best nonadaptive design."
    },
    {
      "title": "The Econometrics of Randomized Experiments",
      "authors": [
        "Susan Athey",
        "Guido W. Imbens"
      ],
      "year": 2017,
      "role": "design-efficiency background (blocking/stratification and variance)",
      "relationship_sentence": "This survey systematizes efficiency considerations in randomized experiments (including blocking and variance-minimizing allocations), informing the paper’s definition of the hindsight-optimal nonadaptive design and its contextual/stratified extensions."
    }
  ],
  "synthesis_narrative": "The paper advances adaptive experimental design by tightening Neyman regret guarantees from prior Õ(√T) to anytime Õ(log T) and by introducing contextual multigroup guarantees. Its most immediate foundation is Dai et al. (2023), which proposed ClipOGD and established the first sublinear Neyman regret for unbiased ATE estimation; the present work explicitly modifies that algorithm/analysis to achieve stronger, anytime logarithmic guarantees. These guarantees hinge on viewing the ATE variance as an online objective whose curvature can be exploited: Hazan–Agarwal–Kale (2007) showed that strongly convex online losses admit O(log T) regret, providing the key analytic paradigm applied here under natural boundedness assumptions to the variance-based design objective.\nDesign-based causal inference and efficiency considerations supply the problem’s statistical backbone. Neyman (1923) formalized unbiased design-based ATE estimation and variance calculations, while Neyman (1934) characterized variance-minimizing allocations (Neyman allocation), which define the hindsight-optimal nonadaptive benchmark underlying Neyman regret. To ensure unbiasedness under adaptive, unequal assignment probabilities, the paper relies on the Horvitz–Thompson (1952) estimator. For contextual extensions, classic principles on blocking/stratification and efficiency, as synthesized by Athey–Imbens (2017), clarify what the groupwise nonadaptive optima are.\nFinally, the paper’s multigroup Neyman regret draws on ideas from subgroup-fairness learning (Kearns–Neel–Roth–Wu, 2018), ensuring performance guarantees that hold simultaneously across many possibly overlapping groups. Together, these works directly shape both the algorithmic design and the proof techniques enabling the paper’s stronger, anytime and multigroup Neyman regret results.",
  "analysis_timestamp": "2026-01-07T00:21:32.372622"
}