{
  "prior_works": [
    {
      "title": "Are Transformers Effective for Time Series Forecasting?",
      "authors": "Ailing Zeng et al.",
      "year": 2023,
      "role": "Baseline",
      "relationship_sentence": "TimeBase directly builds on the DLinear minimal-baseline insight from this paper—simple, parameter-light models can outperform heavy LTSF architectures—then extends beyond pure linearity via learned basis components and segment-level prediction to recover expressivity without cost."
    },
    {
      "title": "A Time Series is Worth 64 Words: Long-term Forecasting with Transformers",
      "authors": "Nie et al.",
      "year": 2023,
      "role": "Extension",
      "relationship_sentence": "PatchTST’s patch/segment tokenization of temporal windows motivates TimeBase’s shift from point-level to segment-level forecasting; TimeBase extends this idea by making segments the explicit forecasting target to gain efficiency and stability."
    },
    {
      "title": "N-BEATS: Neural basis expansion analysis for interpretable time series forecasting",
      "authors": "Boris Oreshkin et al.",
      "year": 2019,
      "role": "Inspiration",
      "relationship_sentence": "TimeBase’s core idea of extracting a small set of basis temporal components is directly inspired by N-BEATS’ learned basis expansion, but applies it to multivariate long-horizon LTSF with compact, shared bases for efficiency."
    },
    {
      "title": "N-HiTS: Neural Hierarchical Interpolation for Time Series Forecasting",
      "authors": "Christian Challu et al.",
      "year": 2022,
      "role": "Related Problem",
      "relationship_sentence": "N-HiTS forecasts blocks via hierarchical interpolation, informing TimeBase’s segment-level forecasting formulation while TimeBase achieves similar blockwise benefits with a much lighter, minimalist architecture."
    },
    {
      "title": "Temporal Regularized Matrix Factorization for High-dimensional Time Series Prediction",
      "authors": "Hsiang-Fu Yu et al.",
      "year": 2016,
      "role": "Foundation",
      "relationship_sentence": "TRMF formalized exploiting low-rank structure in multivariate time series; TimeBase adopts this low-rank premise to justify learning compact temporal bases that capture shared patterns across long horizons."
    },
    {
      "title": "Autoformer: Decomposition Transformers with Auto-Correlation for Long-Term Series Forecasting",
      "authors": "Haixu Wu et al.",
      "year": 2021,
      "role": "Gap Identification",
      "relationship_sentence": "Autoformer’s decomposition-plus-transformer approach highlights the value of isolating core temporal components but remains computationally heavy; TimeBase targets the same goal with a minimalist basis extractor that addresses Autoformer’s inefficiency."
    },
    {
      "title": "Informer: Beyond Efficient Transformer for Long Sequence Time-Series Forecasting",
      "authors": "Haoyi Zhou et al.",
      "year": 2021,
      "role": "Foundation",
      "relationship_sentence": "Informer crystallized the modern LTSF setting and efficiency challenge for long sequences; TimeBase follows this problem formulation while replacing attention-heavy modeling with a basis- and segment-level minimalist design."
    }
  ],
  "synthesis_narrative": "TimeBase’s core innovation—ultra-lightweight long-term forecasting via (1) compact temporal basis extraction and (2) segment-level prediction—emerges at the intersection of three intellectual threads. First, the low-rank premise for multivariate time series established by TRMF directly motivates learning a small set of shared temporal bases, rather than modeling every point independently. N-BEATS operationalized this premise for forecasting by showing that learned basis expansions can capture trend and seasonality; TimeBase adapts this idea to the LTSF regime, extracting minimal bases that generalize across long horizons.\nSecond, modern LTSF works defined the task setting and highlighted both the promise and the cost of deep architectures. Informer and Autoformer established long-horizon benchmarks and the utility of decomposition, but their attention-heavy designs exposed inefficiency that TimeBase explicitly targets by replacing attention with compact bases. Zeng et al. (DLinear) then revealed that minimalist designs can outperform complex models in LTSF, yet pure linearity underfits complex patterns—precisely the gap TimeBase fills by combining minimalism with expressive basis components.\nThird, segment-level modeling matured in PatchTST and N-HiTS: patch tokenization and blockwise interpolation demonstrated the value of operating on segments. TimeBase extends this line by making segments the forecasting target itself, yielding stable, efficient predictions while optimally utilizing parameters through shared bases.",
  "analysis_timestamp": "2026-01-06T23:07:19.626070"
}