{
  "prior_works": [
    {
      "title": "The Algorithm Selection Problem",
      "authors": "John R. Rice",
      "year": 1976,
      "role": "Foundation",
      "relationship_sentence": "Established the formal problem of mapping problem characteristics to algorithm performance, which this paper reinterprets through a causal DAG that models mechanism rather than mere association."
    },
    {
      "title": "Algorithm selection for combinatorial search problems: A survey",
      "authors": "Lars Kotthoff",
      "year": 2014,
      "role": "Gap Identification",
      "relationship_sentence": "Surveyed per-instance algorithm selection and highlighted its reliance on correlation-based meta-features and limited interpretability—gaps this work addresses with a causal mechanism model to improve robustness and explainability."
    },
    {
      "title": "SATzilla: Portfolio-Based Algorithm Selection for SAT",
      "authors": "Lin Xu et al.",
      "year": 2008,
      "role": "Baseline",
      "relationship_sentence": "A canonical per-instance selector that predicts algorithm performance from instance features; the proposed approach replaces this correlation-based prediction with a causal DAG over problem and algorithm features to mitigate spurious correlations."
    },
    {
      "title": "AutoFolio: An Automatically Configured Algorithm Selector",
      "authors": "Marius Lindauer et al.",
      "year": 2016,
      "role": "Baseline",
      "relationship_sentence": "Represents the state of the art in automatically configured algorithm selection pipelines that still depend on observed correlations, providing the primary baseline the causal DAG paradigm is designed to surpass under distribution shift."
    },
    {
      "title": "Causality: Models, Reasoning, and Inference (2nd ed.)",
      "authors": "Judea Pearl",
      "year": 2009,
      "role": "Foundation",
      "relationship_sentence": "Provides the structural causal model and DAG framework the paper adopts to model algorithm-feature mechanisms and reason about robustness to changes in marginal distributions."
    },
    {
      "title": "Causal Inference Using Invariant Prediction: Identification and Confidence Intervals",
      "authors": "Jonas Peters et al.",
      "year": 2016,
      "role": "Inspiration",
      "relationship_sentence": "Introduces the principle that causal mechanisms yield invariant conditional distributions across environments, directly motivating the paper’s strategy to model algorithm-feature distributions conditioned on problem features for shift-robust selection."
    },
    {
      "title": "Invariant Risk Minimization",
      "authors": "Martin Arjovsky et al.",
      "year": 2019,
      "role": "Inspiration",
      "relationship_sentence": "Formalizes learning predictors that remain stable across environments by avoiding spurious correlations, inspiring this work’s pursuit of invariant, mechanism-based predictors for algorithm selection via a causal DAG."
    }
  ],
  "synthesis_narrative": "The paper’s core contribution—casting algorithm selection as learning a causal mechanism via a directed acyclic graph (DAG) over problem and algorithm features—traces directly to two intertwined lineages. The first is the algorithm selection tradition inaugurated by Rice (1976), which formalized mapping instance characteristics to algorithm performance. This tradition matured through portfolio-based, correlation-driven systems such as SATzilla (Xu et al., 2008) and AutoFolio (Lindauer et al., 2016), which remain strong baselines but learn associations between meta-features and performance. Kotthoff’s (2014) survey crystallized the limitations of this paradigm: heavy reliance on observed correlations, limited explainability, and brittleness under distribution shift. The second lineage is causal inference. Pearl’s (2009) structural causal models provided the DAG formalism to represent mechanisms and reason about interventions and distribution changes. Building on this, Peters et al. (2016) showed that causal relations imply invariances across environments, while Arjovsky et al. (2019) operationalized invariance for robust prediction by discouraging reliance on spurious correlations. The present work fuses these threads: it replaces performance-from-features regression with a causal DAG that characterizes the distribution of algorithm features conditioned on problem features, leveraging invariance to enhance robustness under marginal distribution shifts and to support explainable, fine-grained selection via reconstruction of optimal algorithm features. Thus, the paper directly extends Rice’s problem formulation and addresses Kotthoff’s identified gaps using the invariance principles and modeling tools from modern causal inference.",
  "analysis_timestamp": "2026-01-06T23:07:19.583890"
}