{
  "prior_works": [
    {
      "title": "Toolformer: Language Models Can Teach Themselves to Use Tools",
      "authors": "Timo Schick et al.",
      "year": 2023,
      "role": "Inspiration",
      "relationship_sentence": "MapEval’s API-based tasks are explicitly designed to test the autonomous tool-use ability popularized by Toolformer, transferring that idea to the geospatial domain and map APIs."
    },
    {
      "title": "ReAct: Synergizing Reasoning and Acting in Language Models",
      "authors": "Shunyu Yao et al.",
      "year": 2023,
      "role": "Inspiration",
      "relationship_sentence": "By requiring models to interleave long-context reasoning with concrete map/API actions, MapEval operationalizes the ReAct paradigm in a geospatial setting to expose failures of reasoning-while-acting on real maps."
    },
    {
      "title": "Gorilla: Large Language Models Are Strong Tool Learners",
      "authors": "Shishir G. Patil et al.",
      "year": 2023,
      "role": "Related Problem",
      "relationship_sentence": "Gorilla’s focus on choosing correct APIs and parameters directly motivates MapEval’s evaluation of whether models can select and parameterize real map endpoints (e.g., routing, places) under complex constraints."
    },
    {
      "title": "Learning to Parse Database Queries Using Inductive Logic Programming (GeoQuery)",
      "authors": "John M. Zelle et al.",
      "year": 1996,
      "role": "Foundation",
      "relationship_sentence": "GeoQuery introduced the core problem of geographic question answering over structured data, which MapEval modernizes by shifting to LLMs operating over real-world maps, APIs, and visual contexts."
    },
    {
      "title": "Vision-and-Language Navigation: Interpreting visually-grounded navigation instructions in real environments (R2R)",
      "authors": "Peter Anderson et al.",
      "year": 2018,
      "role": "Related Problem",
      "relationship_sentence": "R2R formalized navigation and spatial reasoning with natural language, a problem formulation MapEval re-targets from embodied navigation to map-centric planning and multi-step route reasoning."
    },
    {
      "title": "Touchdown: Natural Language Navigation and Spatial Reasoning in Visual Street Environments",
      "authors": "Howard Chen et al.",
      "year": 2019,
      "role": "Gap Identification",
      "relationship_sentence": "Touchdown exposed challenges in street-level spatial reasoning but lacked map API interaction and long-context, multi-city coverage; MapEval fills this gap with map-based APIs and broader geographic scope."
    }
  ],
  "synthesis_narrative": "MapEval’s core innovation is a comprehensive, map-centric evaluation that unifies textual, API-based, and visual reasoning for geospatial tasks. This builds on two intellectual lines. First, GeoQuery established the foundational problem of geographic question answering over structured data, while subsequent navigation work—particularly R2R and Touchdown—framed natural language spatial reasoning and route following in real environments. However, those benchmarks either constrain the interaction to static visual scenes or closed databases, leaving out real map tools and modern LLM capabilities. Second, recent advances in tool-augmented LLMs—Toolformer, ReAct, and Gorilla—demonstrated that models can interleave reasoning with tool use and select appropriate APIs with correct arguments. MapEval directly transposes these ideas to the geospatial domain by designing tasks that demand long-context planning, correct API selection and parameterization (e.g., routing, places, distances), and visual map interpretation across diverse cities worldwide. In doing so, it explicitly addresses the gaps in prior spatial benchmarks (limited scope, no real API interaction) and in generic tool-use evaluations (domain-agnostic, lacking geospatial complexity and map visual context). The result is an evaluation suite that reveals persistent weaknesses in state-of-the-art foundation models when faced with real-world map reasoning, highlighting the need for methods that jointly master reasoning, tool use, and visual understanding in geographic contexts.",
  "analysis_timestamp": "2026-01-06T23:07:19.576912"
}