{
  "prior_works": [
    {
      "title": "A Tight Linear Time 1/2-Approximation for Unconstrained Submodular Maximization",
      "authors": "Niv Buchbinder et al.",
      "year": 2015,
      "role": "Baseline",
      "relationship_sentence": "The paper sharpens the analysis of the double-greedy algorithm specifically for objectives of the form v(S) − ∑c_i (a non-positive submodular objective), using this algorithm as the core optimization primitive that their mechanism wraps."
    },
    {
      "title": "Truthful Mechanisms for One-Parameter Agents",
      "authors": "Aaron Archer et al.",
      "year": 2001,
      "role": "Foundation",
      "relationship_sentence": "The mechanism frameworks rely directly on the Archer–Tardos characterization (monotone allocation + threshold payments) to turn submodular optimization procedures over sellers’ single-parameter costs into DSIC and IR procurement auctions."
    },
    {
      "title": "Budget Feasible Mechanisms",
      "authors": "Yaron Singer",
      "year": 2010,
      "role": "Foundation",
      "relationship_sentence": "Singer introduced the procurement-with-submodular-valuation model and pioneered approximation-preserving reductions from submodular maximization to truthful mechanisms under a payment budget, a paradigm this work adapts to a profit objective (value minus cost) with a non-deficit (NAS) guarantee."
    },
    {
      "title": "On the Approximability of Budget Feasible Mechanisms",
      "authors": "Ning Chen et al.",
      "year": 2011,
      "role": "Gap Identification",
      "relationship_sentence": "This work provided constant-factor truthful procurement mechanisms for submodular valuations under a hard budget but left open mechanisms that directly optimize v(S) − ∑c_i while guaranteeing no deficit; the present paper addresses exactly this gap."
    },
    {
      "title": "Algorithms for Approximate Minimization of the Difference Between Submodular Functions",
      "authors": "Rishabh Iyer et al.",
      "year": 2012,
      "role": "Related Problem",
      "relationship_sentence": "By formalizing optimization of difference-of-submodular (DS) objectives—which include v(S) − ∑c_i—this work motivates the objective class studied here; the new paper specializes and strengthens guarantees via an improved analysis tailored to the non-positive regime relevant for procurement profit."
    },
    {
      "title": "Nonmonotone Submodular Maximization under Matroid and Knapsack Constraints",
      "authors": "Jon Lee et al.",
      "year": 2009,
      "role": "Extension",
      "relationship_sentence": "Techniques for non-monotone submodular maximization developed here inform the algorithmic toolkit the authors can wrap; their approximation-preserving mechanism framework applies to such submodular optimizers when instantiated for procurement objectives."
    }
  ],
  "synthesis_narrative": "The paper’s core idea is to maximize a procurement buyer’s net utility—submodular quality minus sellers’ costs—while ensuring DSIC, IR for sellers and a non-deficit guarantee for the buyer, and to do so through approximation-preserving reductions from submodular optimization algorithms. The mechanism-design backbone is Archer–Tardos’ characterization for single-parameter agents, which the authors use to convert monotone allocation rules into truthful mechanisms with threshold payments. The procurement-with-submodular-valuation paradigm and the black-box reduction ethos trace directly to Singer’s budget-feasible mechanisms; however, prior work optimized value subject to a payment budget. Chen–Gravin–Lu advanced that line but still operated under exogenous budget constraints, leaving open mechanisms that directly target the profit objective v(S) − ∑c_i with a non-deficit guarantee. This paper fills that gap by providing approximation-preserving transformations that ensure IC/IR/NAS for the profit objective. On the optimization side, the relevant objective is a submodular-minus-modular function, a special case of difference-of-submodular (DS) objectives formalized by Iyer–Bilmes; the authors contribute an improved analysis for maximizing such potentially non-positive submodular functions. Concretely, they sharpen guarantees for the double-greedy algorithm of Buchbinder–Feldman–Naor–Schwartz in this regime, which becomes the optimization workhorse inside their mechanisms. Their framework is general and can also wrap other non-monotone submodular optimizers in the spirit of the Lee–Sviridenko–Vondrák toolkit, thereby linking advances in submodular maximization directly to incentive-compatible, non-deficit procurement auctions.",
  "analysis_timestamp": "2026-01-06T23:07:19.587172"
}