{
  "prior_works": [
    {
      "title": "Calibrating Noise to Sensitivity in Private Data Analysis",
      "authors": "Cynthia Dwork et al.",
      "year": 2006,
      "role": "Foundation",
      "relationship_sentence": "Introduced differential privacy and the sensitivity-based noise calibration that this paper leverages to hide a data structure’s internal randomness so multiple adaptive queries can be answered safely."
    },
    {
      "title": "Boosting and Differential Privacy",
      "authors": "Cynthia Dwork et al.",
      "year": 2010,
      "role": "Foundation",
      "relationship_sentence": "Provided advanced composition guarantees that underlie the ˜O(√T) overhead paradigm for answering T adaptive queries, a quantitative backbone the present work extends from numerical estimation to search problems."
    },
    {
      "title": "The reusable holdout: Preserving validity in adaptive data analysis",
      "authors": "Cynthia Dwork et al.",
      "year": 2015,
      "role": "Inspiration",
      "relationship_sentence": "Showed how differential privacy can be used to maintain validity under adaptively chosen queries, directly inspiring the paper’s strategy of using privacy to mask randomness so adaptively issued queries do not degrade correctness."
    },
    {
      "title": "How Robust Are Linear Sketches to Adaptive Inputs?",
      "authors": "Moritz Hardt et al.",
      "year": 2013,
      "role": "Gap Identification",
      "relationship_sentence": "Demonstrated that classical linear sketches fail under adaptively chosen inputs, pinpointing the core vulnerability that this paper overcomes by using privacy-backed sketching for adaptive search tasks."
    },
    {
      "title": "The Adversarial Robust Streaming Model",
      "authors": "Omri Ben-Eliezer et al.",
      "year": 2020,
      "role": "Gap Identification",
      "relationship_sentence": "Formalized robustness to adaptively chosen streams and documented limitations of standard streaming/sketching under adaptivity, motivating the need for mechanisms—like DP—to withstand many adaptive queries."
    },
    {
      "title": "Near-Optimal Hashing Algorithms for Approximate Nearest Neighbor in High Dimensions",
      "authors": "Alexandr Andoni et al.",
      "year": 2006,
      "role": "Foundation",
      "relationship_sentence": "Established the canonical approximate nearest neighbor search framework that this paper targets, serving as the foundational search problem whose adaptive robustness the paper brings via privacy-preserving sketching."
    },
    {
      "title": "Sketching as a Tool for Numerical Linear Algebra",
      "authors": "David P. Woodruff",
      "year": 2014,
      "role": "Foundation",
      "relationship_sentence": "Surveyed regression via sketching under turnstile updates, providing the core linear-algebraic sketching toolkit and problem setup that this paper makes adaptively robust while outputting solutions, not just costs."
    }
  ],
  "synthesis_narrative": "The paper’s core idea—using differential privacy as a principled way to hide internal randomness so that sketches can answer many adaptive queries—rests on two pillars: the privacy framework and the adaptivity-robustness gap in sketching. Foundationally, Dwork et al. (2006) introduced differential privacy, establishing the sensitivity-based noise calibration that enables hiding internal randomness, while Dwork et al. (2010) provided advanced composition, quantitatively explaining the ˜O(√T) overhead for T adaptive queries that prior works exploited for numerical answers. The reusable holdout (Dwork et al., 2015) supplied the conceptual template that privacy can preserve validity under adaptivity, directly inspiring the strategy adopted here. On the sketching side, Hardt et al. (2013) exposed that linear sketches are brittle to adaptively chosen inputs, and Ben-Eliezer et al. (2020) formalized the adversarially robust streaming model, collectively identifying the key gap: non-private sketches fail under adaptivity. This paper closes that gap for search tasks, not just numerical estimates. The specific search targets are grounded in classical formulations: Andoni and Indyk (2006) for approximate nearest neighbor and Woodruff (2014) for turnstile regression via sketching. Prior privacy-based robustness results largely returned only numerical costs; this work extends the privacy-as-randomness-hiding paradigm to produce actual solutions to search problems (e.g., nearest neighbors, regression coefficients) while tolerating many adaptive queries, thus advancing from numerical estimation to full search outputs under adaptivity.",
  "analysis_timestamp": "2026-01-06T23:07:19.629831"
}