{
  "prior_works": [
    {
      "title": "Efficient Global Optimization of Expensive Black-Box Functions",
      "authors": "Donald R. Jones, Matthias Schonlau, William J. Welch",
      "year": 1998,
      "role": "Introduced and popularized Expected Improvement (EI) within the EGO framework for BO.",
      "relationship_sentence": "The paper’s core result interprets EI—originally from EGO—as a variational inference approximation to an information-theoretic objective, making EGO’s EI the object being rederived and unified with entropy-based methods."
    },
    {
      "title": "Entropy Search for Information-Efficient Global Optimization",
      "authors": "Philipp Hennig, Christian J. Schuler",
      "year": 2012,
      "role": "Pioneered entropy-based acquisition that maximizes information gain about the global optimizer’s location.",
      "relationship_sentence": "Variational Entropy Search builds on the ES principle of reducing uncertainty about the maximizer, providing the conceptual information-theoretic side that the new framework unifies with EI."
    },
    {
      "title": "Predictive Entropy Search for Efficient Global Optimization of Black-box Functions",
      "authors": "José Miguel Hernández-Lobato, Matthew W. Hoffman, Zoubin Ghahramani",
      "year": 2014,
      "role": "Made entropy-based BO practical by expressing mutual information in a tractable, predictive form.",
      "relationship_sentence": "PES supplies the practical mutual information formulations that the unified framework abstracts, clarifying how information-theoretic BO can be approximated within a variational view allied to EI."
    },
    {
      "title": "Max-value Entropy Search for Efficient Bayesian Optimization",
      "authors": "Zi Wang, Stefanie Jegelka",
      "year": 2017,
      "role": "Introduced MES, focusing on entropy of the maximum function value rather than the optimizer’s location.",
      "relationship_sentence": "The paper’s key contribution explicitly shows EI as a variational inference approximation to MES, and its proposed VES-Gamma is designed to balance EI and MES, making MES the central information-theoretic target."
    },
    {
      "title": "The IM Algorithm: A Variational Approach to Information Maximization",
      "authors": "David Barber, Felix V. Agakov",
      "year": 2003,
      "role": "Established variational lower bounds for mutual information (Barber–Agakov bound).",
      "relationship_sentence": "The variational connection used to reinterpret EI as an approximation to MES is grounded in Barber–Agakov-style MI bounds, providing the mathematical tool for the unification."
    },
    {
      "title": "An informational approach to global optimization of expensive-to-evaluate functions",
      "authors": "Emilie Villemonteix, Emmanuel Vazquez, Eric Walter",
      "year": 2009,
      "role": "Early stepwise uncertainty reduction (SUR) method maximizing expected information gain for BO.",
      "relationship_sentence": "This work is a direct precursor to ES/PES and frames BO as information gain, which the new framework leverages to position EI within an information-theoretic, variational lens."
    }
  ],
  "synthesis_narrative": "The paper’s central innovation is to unify classical improvement-based and information-theoretic Bayesian optimization by showing that Expected Improvement (EI) can be derived as a variational inference approximation to Max-value Entropy Search (MES). This builds on two foundational strands. First, Jones et al. (1998) established EI as a highly effective, expectation-based acquisition within the EGO framework. Second, a line of information-theoretic methods—Villemonteix et al. (2009) via SUR, Hennig and Schuler (2012) via Entropy Search (ES), and Hernández-Lobato et al. (2014) via Predictive Entropy Search (PES)—recast BO as maximizing expected information gain about the optimizer. Within this lineage, Wang and Jegelka (2017) introduced MES, targeting the entropy of the maximum value and yielding a tractable, strong information-theoretic criterion.\nThe unification hinges on variational mutual information bounds, particularly the Barber–Agakov (2003) framework, which enables rewriting information objectives as optimizable expectations. Leveraging these bounds, the authors show that EI emerges as a specific variational approximation to the MES objective, resolving a long-standing conceptual divide between improvement-based and entropy-based acquisitions. Building on this insight, they propose VES-Gamma, which explicitly interpolates between the strengths of EI (simplicity, exploitation efficiency) and MES (information-efficient exploration), grounded in the same variational perspective. Together, these prior works directly underwrite the new framework’s theory and algorithmic design: EI as the classical baseline to be reinterpreted, MES as the target information objective, ES/PES/SUR as the information-theoretic foundations, and Barber–Agakov as the variational mechanism enabling the derivation and unification.",
  "analysis_timestamp": "2026-01-07T00:04:09.151447"
}