{
  "prior_works": [
    {
      "title": "Finite-Dimensional Variational Inequalities and Complementarity Problems",
      "authors": "Francisco Facchinei, Jong-Shi Pang",
      "year": 2003,
      "role": "Foundational VI framework and motivation",
      "relationship_sentence": "This monograph formalized the VI machinery, its links to Nash/LCP/GNEP, and highlighted the intractability of general (nonmonotone) VIs—setting the stage for EVI as a principled, tractable relaxation of the classical VI feasibility condition."
    },
    {
      "title": "Subjectivity and Correlation in Randomized Strategies",
      "authors": "Robert J. Aumann",
      "year": 1974,
      "role": "Conceptual precursor: correlated equilibrium as expectation-based feasibility",
      "relationship_sentence": "EVI directly generalizes Aumann’s correlated equilibrium, replacing game-specific deviation inequalities with operator-based VI inequalities that must hold in expectation under a distribution."
    },
    {
      "title": "An Analog of the Minimax Theorem for Vector Payoffs (Approachability)",
      "authors": "David Blackwell",
      "year": 1956,
      "role": "Methodological underpinning for expectation-based constraints",
      "relationship_sentence": "Blackwell’s approachability theory established how distributions can satisfy families of linear expectation constraints, a core idea that EVI leverages to enforce VI inequalities in expectation."
    },
    {
      "title": "A Simple Adaptive Procedure Leading to Correlated Equilibrium",
      "authors": "Sergiu Hart, Andreu Mas-Colell",
      "year": 2000,
      "role": "Algorithmic lens via no-regret/approachability",
      "relationship_sentence": "Their no-regret dynamics yield distributions satisfying deviation inequalities, inspiring EVI’s use of game-theoretic learning/approachability techniques to find expectation-feasible solutions even for nonmonotone operators."
    },
    {
      "title": "Computing Correlated Equilibria in Multi-Player Games",
      "authors": "Christos H. Papadimitriou, Tim Roughgarden",
      "year": 2008,
      "role": "Polynomial-time computation of expectation-feasible equilibria",
      "relationship_sentence": "This work showed that CE can be found in polynomial time via LP/separation, a paradigm EVI adapts by viewing VI constraints as deviation-style inequalities over distributions and solving them efficiently."
    },
    {
      "title": "Intrinsic Robustness of the Price of Anarchy",
      "authors": "Tim Roughgarden",
      "year": 2015,
      "role": "Deviation-inequality framework (smoothness) in expectation",
      "relationship_sentence": "The smoothness framework analyzes games via deviation inequalities that hold in expectation over randomized play; EVI abstracts and unifies such expectation-based inequalities beyond games and welfare analysis."
    },
    {
      "title": "Generalized Nash Equilibrium Problems",
      "authors": "Francisco Facchinei, Christian Kanzow",
      "year": 2010,
      "role": "Modeling link from games with coupled constraints to VIs",
      "relationship_sentence": "By framing GNEPs via VIs, this survey motivates EVI’s broader applicability—EVI inherits and generalizes from VI-based formulations to handle coupled constraints and nonconcave utilities through expectation feasibility."
    }
  ],
  "synthesis_narrative": "Expected Variational Inequalities (EVIs) are positioned at the intersection of the classical VI program and the game-theoretic view of distributional solution concepts. Facchinei and Pang’s monograph established VIs as a unifying framework for Nash, complementarity, and generalized equilibrium models, while also exposing the computational brittleness of nonmonotone operators. EVI’s central idea—satisfying VI constraints in expectation under a distribution—draws directly from Aumann’s correlated equilibrium, which recasts best-response stability as a family of linear deviation inequalities over distributions. The algorithmic tractability of EVIs leverages the approachability/no-regret toolkit pioneered by Blackwell and operationalized by Hart and Mas-Colell, where iterative procedures construct distributions that drive vector-valued regrets below zero. Complementing this learning view, Papadimitriou and Roughgarden’s result that correlated equilibria are computable in polynomial time via LP/separation informs EVI’s design: represent deviation-style inequalities compactly and solve them efficiently, even when the underlying operator is nonmonotone. EVI also synthesizes smoothness ideas (Roughgarden), which reason about performance guarantees through deviation inequalities that hold in expectation over randomized outcomes; by elevating these to operator-level constraints, EVIs unify and extend such results beyond games to broader VI instances. Finally, the GNEP literature (Facchinei–Kanzow) ties many coupled-constraint and nonconcave utility models to VIs, clarifying EVI’s extended reach: the same expectation-based relaxation that yields correlated equilibria now offers a polynomial-time pathway for a wider array of VI-modeled systems.",
  "analysis_timestamp": "2026-01-07T00:21:32.377966"
}