{
  "prior_works": [
    {
      "title": "Partitioned Variational Inference",
      "authors": "James Ashman et al.",
      "year": 2022,
      "role": "Direct antecedent federated VI framework",
      "relationship_sentence": "FedGVI explicitly generalises PVI by replacing its KL-based site updates with robust, generalized VI objectives and by rederiving cavity/aggregation rules that yield conjugate and computationally cheaper client updates."
    },
    {
      "title": "Generalized Variational Inference",
      "authors": "Jeremias Knoblauch, Jack Jewson, Theodoros Damoulas",
      "year": 2019,
      "role": "Foundational theory for robustness under misspecification",
      "relationship_sentence": "FedGVI instantiates the GVI principle at the client level—optimizing generalized Bayes/score-based objectives—to achieve calibrated uncertainty and robustness to likelihood (and prior) misspecification in federated settings."
    },
    {
      "title": "A general framework for updating belief distributions",
      "authors": "Pier Giovanni Bissiri, Chris C. Holmes, Stephen G. Walker",
      "year": 2016,
      "role": "Generalized Bayes foundation",
      "relationship_sentence": "The generalized posterior construction of Bissiri et al. under proper scoring rules underpins FedGVI’s use of loss-based posteriors and its theoretical guarantees for well-calibrated predictions under model misspecification."
    },
    {
      "title": "Expectation Propagation for Approximate Bayesian Inference",
      "authors": "Thomas P. Minka",
      "year": 2001,
      "role": "Approximate inference with cavity/tilted distributions",
      "relationship_sentence": "FedGVI’s cavity distribution, fixed-point characterisation, and site-wise message passing build on EP’s cavity/tilted distribution concepts, adapted to generalized VI objectives and federated aggregation."
    },
    {
      "title": "Conjugate-Computation Variational Inference: Converting Variational Inference in Non-Conjugate Models to Conjugate",
      "authors": "M. Emtiyaz Khan, Wu Lin",
      "year": 2017,
      "role": "Algorithmic enabler for conjugate client updates",
      "relationship_sentence": "FedGVI’s ability to realize conjugate, closed-form updates at clients—reducing on-device computation—follows the CVI idea of recasting nonconjugate updates into conjugate computations via natural-parameter mirror descent."
    },
    {
      "title": "A Bayesian Committee Machine",
      "authors": "Andreas Tresp",
      "year": 2000,
      "role": "Distributed Bayesian aggregation paradigm",
      "relationship_sentence": "FedGVI’s principled aggregation of client contributions exploits the product-of-experts/posterior factorization perspective introduced by the BCM, aligning local site factors with a global posterior through cavity corrections."
    }
  ],
  "synthesis_narrative": "FedGVI sits at the intersection of distributed Bayesian inference and robust variational objectives. Its federated architecture and message-passing mechanics directly extend Partitioned Variational Inference, retaining the partitioned/site view and cavity distribution while broadening the update class beyond standard KL-based VI. This generalization is enabled by Generalized Variational Inference and the generalized Bayes framework of Bissiri et al., which justify replacing likelihood-based objectives with proper scoring rules or divergence-robust losses. These foundations provide FedGVI with calibrated uncertainty and robustness to both likelihood and prior misspecification, addressing a key shortcoming of conventional Bayesian and frequentist FL.\n\nOn the algorithmic side, FedGVI leverages the conjugate-computation insights of CVI to translate generalized, potentially nonconjugate local objectives into tractable conjugate updates, thereby lowering client-side computational burden and communication cost. The paper’s analysis of cavity optimality and fixed-point convergence traces to Expectation Propagation, whose cavity/tilted constructs guide FedGVI’s site updates and theoretical guarantees; FedGVI adapts these constructs to generalized objectives. Finally, the Bayesian Committee Machine’s product-of-experts view provides the principled blueprint for composing client contributions into a coherent global posterior via cavity corrections, now executed under generalized VI losses. Together, these works yield a federated probabilistic framework that unifies partitioned/distributed inference with robust generalized Bayes, offering both theoretical robustness under misspecification and practical, conjugate updates suitable for heterogeneous federated environments.",
  "analysis_timestamp": "2026-01-07T00:21:32.372065"
}