{
  "prior_works": [
    {
      "title": "Estimation of Non-Normalized Statistical Models by Score Matching",
      "authors": "Aapo Hyvärinen",
      "year": 2005,
      "role": "Foundational method",
      "relationship_sentence": "Provides the core score matching objective for unnormalized models that this paper reformulates so it remains estimable when coordinates are partially missing."
    },
    {
      "title": "Some extensions of score matching",
      "authors": "Aapo Hyvärinen",
      "year": 2007,
      "role": "Methodological extensions of score matching",
      "relationship_sentence": "Introduces generalized forms and practical modifications of score matching that the authors explicitly adapt to the incomplete-data setting to keep major extensions usable under missingness."
    },
    {
      "title": "A Connection Between Score Matching and Denoising Autoencoders",
      "authors": "Pascal Vincent",
      "year": 2011,
      "role": "Denoising score matching / corruption-as-perturbation view",
      "relationship_sentence": "Motivates treating missingness as a structured corruption and informs the paper’s variational route that marginalizes or approximates unobserved components while preserving score-based training."
    },
    {
      "title": "Sliced Score Matching: A Scalable Approach to Density and Score Estimation",
      "authors": "Yang Song, Sahaj Garg, Stefano Ermon",
      "year": 2019,
      "role": "Scalable score matching variant",
      "relationship_sentence": "Supplies a widely used scalable score-matching objective that the paper aims to keep compatible with, demonstrating how their missing-data treatment can be applied to major extensions like sliced score matching."
    },
    {
      "title": "MIWAE: Deep generative modelling and imputation of missing data with importance-weighted autoencoders",
      "authors": "Pierre-Alexandre Mattei, Jes Frellsen",
      "year": 2019,
      "role": "Importance-weighted and variational treatment of missing data",
      "relationship_sentence": "Directly inspires the paper’s two adaptations—an importance-weighted estimator and a variational surrogate—for handling partially observed data, repurposed here for score objectives rather than likelihoods."
    },
    {
      "title": "Inference and Missing Data",
      "authors": "Donald B. Rubin",
      "year": 1976,
      "role": "Foundational missing-data framework (MCAR/MAR/MNAR)",
      "relationship_sentence": "Provides the conceptual underpinnings for valid reweighting/marginalization under missingness mechanisms, which the paper leverages to justify unbiasedness/consistency assumptions for its IW and variational strategies."
    },
    {
      "title": "Generative Modeling by Estimating Gradients of the Data Distribution",
      "authors": "Yang Song, Stefano Ermon",
      "year": 2019,
      "role": "Score-based generative modeling via denoising score matching",
      "relationship_sentence": "Establishes the centrality of accurate score estimation for diffusion/score-based generative models, guiding the paper’s design so its missing-data extensions remain usable in these applications."
    }
  ],
  "synthesis_narrative": "The core innovation in Score Matching with Missing Data is to make score-based learning viable when inputs are only partially observed, via two complementary strategies: an importance-weighted estimator and a variational approach. Hyvärinen’s original score matching (2005) is the fundamental objective they must preserve, while Hyvärinen (2007) provides key extensions that the authors explicitly aim to keep compatible under missingness. Vincent (2011) reframes score matching through denoising, offering a corruption-based lens that closely parallels the treatment of missing entries as structured corruption and motivates marginalizing unobserved components within a variational framework.\n\nSong, Garg, and Ermon (2019) introduce sliced score matching, a scalable variant widely used in practice; maintaining applicability to such extensions shapes the proposed missing-data formulations. The two proposed adaptations map naturally onto ideas from the missing-data literature: Mattei and Frellsen’s MIWAE (2019) demonstrates how importance weighting and variational bounds can handle partially observed data, directly informing the paper’s IW estimator and variational surrogate but now tailored to score objectives. Rubin (1976) supplies the formal assumptions (e.g., MAR) under which inverse-probability/importance weighting yields unbiasedness, supporting the finite-sample analyses the authors provide. Finally, the success of score-based generative modeling (Song and Ermon, 2019) underscores why robust score estimation under missingness matters, ensuring the adaptations integrate with diffusion-style applications and graphical model estimation. Together, these works directly shape both the problem framing and the technical machinery of the paper’s IW and variational solutions.",
  "analysis_timestamp": "2026-01-07T00:27:38.146504"
}