{
  "prior_works": [
    {
      "title": "Spectral Graph Theory",
      "authors": "Fan R. K. Chung",
      "year": 1997,
      "role": "Foundational theory linking cuts and spectra",
      "relationship_sentence": "Chung’s Cheeger inequality framework, relating graph conductance to the Laplacian’s eigenvalues, provides the blueprint our paper extends to a two-graph (G vs. H) setting with a Cheeger-type guarantee."
    },
    {
      "title": "Normalized Cuts and Image Segmentation",
      "authors": "Jianbo Shi; Jitendra Malik",
      "year": 2000,
      "role": "Generalized eigenvalue relaxation for ratio objectives",
      "relationship_sentence": "The normalized cut formulation and its solution via the generalized eigenproblem Lx = λDx directly inform our reduction of the constrained ratio cut to a generalized eigenproblem L_G x = λ L_H x."
    },
    {
      "title": "New Spectral Methods for Ratio Cut Partitioning and Clustering",
      "authors": "Lars Hagen; Andrew B. Kahng",
      "year": 1992,
      "role": "Origin of ratio cut and spectral relaxation",
      "relationship_sentence": "By introducing the ratio cut objective and its spectral relaxation, this work underpins our objective design, which replaces the denominator with cut_H to obtain a G-vs-H cut ratio amenable to spectral methods."
    },
    {
      "title": "Spectral Analysis of Signed Graphs for Clustering, Prediction and Visualization",
      "authors": "Jérôme Kunegis; Stephan Schmidt; Andreas Lommatzsch; Jürgen Lerner; Ernesto W. De Luca; Sahin Albayrak",
      "year": 2010,
      "role": "Signed Laplacian definition and properties",
      "relationship_sentence": "This paper formalizes the signed Laplacian and its spectral properties, enabling our use of the signed Laplacian of H to encode must-link/cannot-link information and to streamline the generalized eigen-solver."
    },
    {
      "title": "Constrained 1-Spectral Clustering",
      "authors": "Sujay S. Rangapuram; Matthias Hein",
      "year": 2012,
      "role": "Spectral clustering with pairwise constraints",
      "relationship_sentence": "Their principled incorporation of must-link/cannot-link constraints into spectral clustering motivates our constrained formulation and provides a comparative baseline our method generalizes with a Cheeger-type bound."
    },
    {
      "title": "The Geometry of Graphs and Some of its Algorithmic Applications",
      "authors": "Nati Linial; Eran London; Yuri Rabinovich",
      "year": 1995,
      "role": "Sparsest cut with general demands (ratio of two cuts)",
      "relationship_sentence": "By casting sparsest cut as a ratio between a capacity graph and a demand graph, this work conceptually aligns with our cut_G(S)/cut_H(S) objective and motivates analyzing a Cheeger-type guarantee for general-demand ratios."
    },
    {
      "title": "A Tutorial on Spectral Clustering",
      "authors": "Ulrike von Luxburg",
      "year": 2007,
      "role": "Algorithmic pipeline and rounding for spectral methods",
      "relationship_sentence": "The tutorial’s unifying view of spectral relaxations and rounding guides our algorithmic design, extending standard Lx = λDx pipelines to the generalized eigenproblem with L_G and the (signed) L_H."
    }
  ],
  "synthesis_narrative": "The paper’s core contribution—a Cheeger-type inequality and efficient algorithm for constrained clustering formulated as a cut ratio between two graphs G and H—sits at the intersection of spectral partitioning, signed graphs, and general-demand cut objectives. Foundationally, Chung’s spectral graph theory and Cheeger inequality establish the link between discrete cuts and Laplacian eigenvalues, which our work extends from a single graph to a two-graph setting. On the algorithmic side, the ratio-cut lineage from Hagen and Kahng and the normalized-cut framework of Shi and Malik show how ratio objectives reduce to generalized eigenvalue problems; we adapt this insight to L_G x = λ L_H x to target the G-vs-H cut ratio directly.\n\nCrucially, we leverage signed graph methodology—particularly Kunegis et al.’s signed Laplacian—to encode must-link/cannot-link information in H while preserving a well-structured, positive semidefinite operator that enables efficient spectral computation. Prior constrained spectral clustering work by Rangapuram and Hein demonstrates the value and feasibility of integrating pairwise constraints into spectral objectives, which we generalize while providing a Cheeger-type performance guarantee. Finally, the general-demand perspective of Linial–London–Rabinovich frames our objective as a sparsest-cut-like ratio between capacity (G) and demand (H), justifying the two-graph formulation. Von Luxburg’s tutorial informs our relaxation and rounding pipeline. Together, these works directly motivate our generalized eigenvalue approach and theoretical guarantee, and they underwrite the choice of the signed Laplacian to achieve both computational efficiency and constraint fidelity.",
  "analysis_timestamp": "2026-01-07T00:21:33.188070"
}