{
  "prior_works": [
    {
      "title": "Correlation Clustering",
      "authors": "Nikhil Bansal; Avrim Blum; Shuchi Chawla",
      "year": 2004,
      "role": "Problem formulation and foundational optimization perspective",
      "relationship_sentence": "Introduced the correlation clustering objective and core LP/ILP formulations that the present work extends to the constrained setting and builds upon via the stronger cluster (configuration) LP."
    },
    {
      "title": "Aggregating Inconsistent Information: Ranking and Clustering",
      "authors": "Nir Ailon; Moses Charikar; Alantha Newman",
      "year": 2008,
      "role": "Baseline constant-factor algorithm and structural pivoting framework",
      "relationship_sentence": "Provided the seminal pivot-based 3-approximation and structural insights for correlation clustering, serving as a baseline that the constrained variant has not beaten—motivating the search for stronger relaxations in this paper."
    },
    {
      "title": "Deterministic Pivoting Algorithms for Correlation Clustering",
      "authors": "Nairen van Zuylen; David P. Williamson",
      "year": 2009,
      "role": "Best-known approximation for constrained correlation clustering",
      "relationship_sentence": "Established a 3-approximation for the constrained version via deterministic pivoting, which the present work targets to surpass conditionally by leveraging the Constrained Cluster LP."
    },
    {
      "title": "Clustering with Qualitative Information",
      "authors": "Moses Charikar; Venkatesan Guruswami; Anthony Wirth",
      "year": 2005,
      "role": "Edge-based LP (metric/triangle inequalities) and rounding paradigms",
      "relationship_sentence": "Developed the widely used edge-based LP with triangle inequalities and associated rounding, clarifying the limits of pairwise relaxations that the current paper argues are insufficient to break the 2-approx barrier under constraints."
    },
    {
      "title": "Near-Optimal LP Rounding for Correlation Clustering on Complete Graphs",
      "authors": "Shuchi Chawla; Konstantin Makarychev; Tselil Schramm; Grigory Yaroslavtsev",
      "year": 2015,
      "role": "Demonstrated power of stronger LP relaxations/rounding to beat 3",
      "relationship_sentence": "Showed that careful LP rounding can yield better-than-3 approximations in the unconstrained case, informing the present work’s thesis that stronger (cluster/configuration) relaxations are the right vehicle to beat 2 when constraints are present."
    },
    {
      "title": "A Cutting Plane Algorithm for a Clique Partitioning Problem",
      "authors": "Martin Grötschel; Yoshihiro Wakabayashi",
      "year": 1989,
      "role": "Cluster/configuration LP and polyhedral foundations (clique partitioning polytope)",
      "relationship_sentence": "Provided the exponential-size cluster (configuration) formulation and polyhedral underpinnings equivalent to partitioning into cliques, which directly underlie the Constrained Cluster LP whose solvability this paper links to achieving a <2 approximation."
    }
  ],
  "synthesis_narrative": "The paper’s core contribution is a conditional pathway to break the longstanding 2-approximation barrier for constrained correlation clustering by showing that optimizing over the (exponentially large) Constrained Cluster LP suffices. This direction grows organically from four lines of prior work. First, Bansal–Blum–Chawla defined correlation clustering and its optimization view, laying the groundwork for LP/ILP formulations that any improved approximation must relax. Second, the pivoting paradigm of Ailon–Charikar–Newman established a clean 3-approximation and structural insights; for the constrained variant, van Zuylen–Williamson adapted these ideas to obtain the current best 3-approximation, highlighting the persistent gap below 3 that remained elusive with local/pivoting methods. Third, Charikar–Guruswami–Wirth’s edge-based LP with triangle inequalities and its rounding schemes crystallized the limits of pairwise relaxations: they are powerful but appear inherently insufficient to crack 2 when constraints are present. Fourth, the unconstrained advances of Chawla–Makarychev–Schramm–Yaroslavtsev exhibited that beating 3 is possible via stronger relaxations and delicate rounding, hinting that surpassing 2 likely demands a qualitatively tighter relaxation. The present work identifies that relaxation as the cluster/configuration LP rooted in the clique partitioning polytope of Grötschel–Wakabayashi. By tying a <2 approximation to solvability of this exponential LP (with constraints), the authors synthesize these strands: pivoting sets the baseline, pairwise LP shows a barrier, stronger LP successes motivate the move, and the clique-partitioning polyhedral theory supplies the exact vehicle to potentially overcome it.",
  "analysis_timestamp": "2026-01-07T00:27:38.144709"
}