{
  "prior_works": [
    {
      "title": "JAX: Autograd and XLA",
      "authors": "James Bradbury, Roy Frostig, Peter Hawkins, Matthew Johnson, Chris Leary, Dougal Maclaurin, Skye Wanderman-Milne",
      "year": 2018,
      "role": "Foundational system providing vmap-style automatic vectorization and accelerator execution that the paper targets.",
      "relationship_sentence": "The proposed FSM-based MCMC design is explicitly crafted to exploit JAX’s vmap and control-flow primitives while avoiding the synchronization penalties that arise from naive multi-chain vectorization."
    },
    {
      "title": "The No-U-Turn Sampler: Adaptively Setting Path Lengths in Hamiltonian Monte Carlo",
      "authors": "Matthew D. Hoffman, Andrew Gelman",
      "year": 2014,
      "role": "Core MCMC algorithm with data-dependent, variable-length trajectories that cause SIMD/vectorization divergence.",
      "relationship_sentence": "NUTS’ adaptive, variable-depth tree building is a canonical source of per-chain runtime variability; the paper’s FSM reformulation of HMC-NUTS directly addresses this to enable efficient vectorized multi-chain execution."
    },
    {
      "title": "Elliptical Slice Sampling",
      "authors": "Iain Murray, Ryan P. Adams, David J. C. MacKay",
      "year": 2010,
      "role": "Popular MCMC method with a variable number of bracket expansions/angle updates per iteration.",
      "relationship_sentence": "Because ESS iterations have data-dependent lengths, they suffer from lockstep waits under vmap; the paper implements ESS as an FSM so each chain advances without global synchronization."
    },
    {
      "title": "On Metropolis–Hastings Algorithms with Delayed Rejection",
      "authors": "Antonietta Mira",
      "year": 2001,
      "role": "General MH extension with multi-stage proposals that introduce irregular, chain-specific control flow.",
      "relationship_sentence": "The paper’s delayed rejection implementation as a finite state machine showcases how multi-stage acceptance logic can be vectorized without per-iteration stalls across chains."
    },
    {
      "title": "Accelerating MCMC via Parallel Predictive Prefetching",
      "authors": "Elaine Angelino, Peter Kohler, Michael W. Mahoney, Willi G. Waterland, Daniel M. Roy, Ryan P. Adams, Tamara Broderick (et al.)",
      "year": 2014,
      "role": "Prior attempt to exploit parallel hardware for MCMC by speculatively exploring acceptance branches to mitigate sequential bottlenecks.",
      "relationship_sentence": "By highlighting how irregular MH control flow limits parallelism and proposing speculative execution, this work motivates the present paper’s alternative: restructuring transitions into FSM steps that fit SIMD/vectorization cleanly."
    },
    {
      "title": "Asynchronous Gibbs Sampling",
      "authors": "Alex Terenin, Daniel Simpson, David Draper",
      "year": 2016,
      "role": "Asynchronous MCMC approach aimed at reducing synchronization, with careful conditions needed for correctness.",
      "relationship_sentence": "This paper underscores the trade-off between parallel throughput and exactness; the FSM approach achieves similar synchronization avoidance while preserving exact MCMC invariance under vectorized execution."
    },
    {
      "title": "NumPyro: A Lightweight Probabilistic Programming Library on JAX",
      "authors": "Du Phan, Neeraj Pradhan, Martin Jankowiak",
      "year": 2019,
      "role": "JAX-based system that popularized high-throughput, vmap-driven multi-chain HMC/NUTS on accelerators, exposing practical synchronization issues.",
      "relationship_sentence": "The prevalence of vectorized multi-chain MCMC in NumPyro and similar frameworks motivates the need for algorithm designs—like the proposed FSM formulation—that avoid divergence-induced slowdowns."
    }
  ],
  "synthesis_narrative": "The paper’s core contribution—designing single-chain MCMC as finite state machines (FSMs) to eliminate synchronization overheads under vectorized execution—sits at the intersection of accelerator-oriented systems and MCMC algorithms with inherently irregular control flow. On the systems side, JAX introduced composable program transformations such as vmap that make multi-chain MCMC attractive on accelerators; however, naive batching forces chains to proceed in lockstep, so the slowest chain dictates the iteration time. NumPyro widely operationalized this paradigm for HMC/NUTS, bringing the synchronization problem into practical focus.\nOn the algorithmic side, several influential samplers exhibit data-dependent, variable-length transitions—precisely what triggers divergence under SIMD/vectorization. NUTS adapts trajectory lengths via tree building; Elliptical Slice Sampling iterates bracket expansions/angle updates until a slice condition is met; and Delayed Rejection performs multi-stage proposals. These methods directly motivate the FSM reparameterization showcased in the paper, where each chain advances through well-defined states stepwise without global barriers, enabling efficient vectorized execution.\nHistorically, accelerating MCMC with irregular control flow has been approached via speculative or asynchronous strategies. Parallel Predictive Prefetching demonstrates that speculative evaluation can improve utilization but at the cost of managing branching complexity; Asynchronous Gibbs shows that relaxing synchronization risks bias unless stringent conditions hold. The FSM formulation provides a principled alternative: it preserves exactness while aligning MCMC transitions with vectorized hardware execution, and the paper’s speedup analysis formalizes when and why this restructuring yields substantial gains.",
  "analysis_timestamp": "2026-01-07T00:21:32.380156"
}