{
  "prior_works": [
    {
      "title": "Causation, Prediction, and Search",
      "authors": "Peter Spirtes et al.",
      "year": 2000,
      "role": "Baseline",
      "relationship_sentence": "Introduced the FCI algorithm that infers global partial ancestral graphs under latent variables, which is the dominant baseline our paper replaces with purely local tests for deciding whether X causes Y."
    },
    {
      "title": "Ancestral Graph Markov Models",
      "authors": "Thomas Richardson et al.",
      "year": 2002,
      "role": "Foundation",
      "relationship_sentence": "Established maximal ancestral graphs (MAGs) and m-separation semantics for models with latent and selection variables, providing the formal graphical framework our local causal-characterization proofs rely on."
    },
    {
      "title": "On the completeness of orientation rules for PAGs",
      "authors": "Jiji Zhang et al.",
      "year": 2008,
      "role": "Foundation",
      "relationship_sentence": "Provided complete local orientation rules and semantics for reading (possible) ancestral relations from partial ancestral graphs, which our work refines into necessary-and-sufficient local criteria that obviate building the full PAG."
    },
    {
      "title": "Learning High-Dimensional Causal Graphs with Latent and Selection Variables",
      "authors": "Dan Colombo et al.",
      "year": 2012,
      "role": "Gap Identification",
      "relationship_sentence": "RFCI reduces the number of conditional independence tests but still targets recovery of the entire PAG; our method addresses this inefficiency by answering the specific X→Y query without global structure learning."
    },
    {
      "title": "A Complete Graphical Characterization of Adjustment in Causal DAGs and MAGs",
      "authors": "Emilija Perković et al.",
      "year": 2018,
      "role": "Inspiration",
      "relationship_sentence": "Demonstrated that identification tasks in MAGs/PAGs admit complete local graphical criteria, inspiring our development of complete local characterizations for deciding causal relations between two variables under latent confounding."
    },
    {
      "title": "Estimating High-Dimensional Intervention Effects from Observational Data",
      "authors": "Marloes H. Maathuis et al.",
      "year": 2009,
      "role": "Related Problem",
      "relationship_sentence": "IDA targets pairwise causal queries (effects) from partial graphs, motivating our focus on answering targeted causality questions directly and efficiently rather than learning the full causal structure."
    },
    {
      "title": "A Local and Efficient Algorithm for Learning Causal Models in the Presence of Latent Variables and Selection Bias",
      "authors": "Tom Claassen et al.",
      "year": 2012,
      "role": "Gap Identification",
      "relationship_sentence": "FCI+ leverages local information to accelerate FCI yet still reconstructs a global PAG; our approach advances this line by providing locally testable necessary-and-sufficient criteria to decide X causes Y without global reconstruction."
    }
  ],
  "synthesis_narrative": "The paper’s core idea—deciding whether X causes Y under latent variables using purely local, necessary-and-sufficient criteria—stands on the formal semantics of ancestral graphs and PAGs. Richardson and Spirtes (2002) introduced MAGs and m-separation for models with hidden and selection variables, establishing the representational bedrock. Building on this, Zhang (2008) provided complete, local orientation rules for PAGs, clarifying how ancestral relations can be read from edge marks—insights our work refines into pair-specific, local characterizations that eliminate the need to recover the full PAG.\n\nMethodologically, the dominant practice for latent-variable causal discovery has been global structure learning via FCI (Spirtes et al., 2000) and its faster variants like RFCI (Colombo et al., 2012) and FCI+ (Claassen and Heskes, 2012). These methods motivated our contribution by exposing a gap: even when interest lies in a single causal relation, they expend effort to reconstruct an entire PAG. Our algorithms directly address this redundancy by answering the X→Y query from local tests alone while retaining soundness and completeness.\n\nConceptually, the work is inspired by the trend of complete local graphical characterizations for identification tasks, exemplified by Perković et al. (2018) for adjustment in MAGs/PAGs. Finally, Maathuis et al. (2009) underscored the value of pairwise, target-focused inference (IDA), reinforcing our objective to resolve specific causal relationships efficiently without global structure recovery.",
  "analysis_timestamp": "2026-01-06T23:07:19.590146"
}