{
  "prior_works": [
    {
      "title": "Competitive Caching with Machine Learned Advice",
      "authors": "Thodoris Lykouris, Sergei Vassilvitskii",
      "year": 2018,
      "role": "Foundational framework for learning-augmented algorithms",
      "relationship_sentence": "Established the robustness–consistency paradigm for algorithms with predictions, providing the conceptual foundation that this paper builds on when rethinking how to quantify and trust advice."
    },
    {
      "title": "Improving Online Algorithms Using Machine Learning Predictions",
      "authors": "Manish Purohit, Zoya Svitkina, Ravi Kumar",
      "year": 2018,
      "role": "Archetypal analysis of ski rental with predictions",
      "relationship_sentence": "Introduced prediction-dependent competitive analysis for ski rental and related problems; the present paper extends this line by replacing aggregate error-based trust with calibrated, per-instance guidance to achieve near-optimal performance."
    },
    {
      "title": "Optimal Robustness-Consistency Trade-offs for Learning-Augmented Online Algorithms",
      "authors": "Alexander Wei, Dominik Wajc",
      "year": 2020,
      "role": "Trade-off theory in learning-augmented algorithms",
      "relationship_sentence": "Characterized fundamental limits between robustness and consistency for problems including ski rental, motivating the need for finer-grained uncertainty quantification that this paper achieves via calibration."
    },
    {
      "title": "On Calibration of Modern Neural Networks",
      "authors": "Chuan Guo, Geoff Pleiss, Yu Sun, Kilian Q. Weinberger",
      "year": 2017,
      "role": "Modern empirical and methodological basis for calibration",
      "relationship_sentence": "Demonstrated miscalibration in contemporary classifiers and popularized practical post-hoc calibration techniques that this paper leverages to convert raw predictions into trustworthy advice levels."
    },
    {
      "title": "Transforming Classifier Scores into Accurate Multiclass Probability Estimates",
      "authors": "Bianca Zadrozny, Charles Elkan",
      "year": 2002,
      "role": "Classical probability calibration methods",
      "relationship_sentence": "Provided foundational isotonic and Platt-scaling procedures for probability calibration, which underpin the paper’s use of calibrated per-instance uncertainty as inputs to online algorithms."
    },
    {
      "title": "Online Scheduling with Predictions",
      "authors": "Sungjin Im, Benjamin Moseley, Kirk Pruhs, Clifford Stein",
      "year": 2021,
      "role": "Baseline for prediction-augmented online scheduling",
      "relationship_sentence": "Showed how predicted processing times/weights can improve online scheduling with robustness guarantees; the current work advances this by demonstrating that calibrated predictors yield larger gains in practice and theory."
    }
  ],
  "synthesis_narrative": "This paper advances the learning-augmented algorithms paradigm by replacing coarse, global trust parameters with calibrated, per-instance guidance. The foundational shift is rooted in the robustness–consistency framework of Lykouris and Vassilvitskii, which formalized how to exploit predictions without sacrificing worst-case guarantees. Purohit–Svitkina–Kumar’s treatment of ski rental with predictions provided a canonical template for prediction-dependent competitive analysis, while Wei and Wajc exposed fundamental trade-offs that motivate more nuanced uncertainty quantification than aggregate error bounds. The calibration literature supplies that nuance: Guo et al. revealed that modern predictors are often miscalibrated and popularized practical post-hoc fixes, and Zadrozny–Elkan established classical calibration tools that can transform raw scores into reliable probabilities. Building on these, the paper operationalizes calibrated outputs as actionable advice levels for online decisions, showing theoretically that in high-variance regimes calibrated information guides choices more effectively than alternative uncertainty quantification proxies. In the job scheduling case study, prior learning-augmented scheduling results (e.g., Im–Moseley–Pruhs–Stein) demonstrate how predictions can improve flow time or makespan under robustness constraints; this work strengthens that narrative by showing that calibrated predictors unlock stronger, prediction-dependent performance improvements. Collectively, these strands directly inform the paper’s core contribution: a principled bridge between ML-generated uncertainty and online decision-making that achieves near-optimal, fine-grained performance guarantees.",
  "analysis_timestamp": "2026-01-07T00:05:12.562923"
}