{
  "prior_works": [
    {
      "title": "Interatomic Potentials from First-Principles Calculations: The Force-Matching Method",
      "authors": "F. Ercolessi, J. B. Adams",
      "year": 1994,
      "role": "Foundational force-training methodology",
      "relationship_sentence": "This classic force-matching framework established training on forces directly without necessarily ensuring integrability, providing the conceptual backdrop for evaluating when learned force fields are non-conservative."
    },
    {
      "title": "Machine learning of accurate energy-conserving molecular force fields (sGDML)",
      "authors": "S. Chmiela, A. Tkatchenko, H. E. Sauceda, I. Poltavsky, K. T. Schütt, K.-R. Müller",
      "year": 2017,
      "role": "Prototype of strictly conservative, gradient-domain ML force fields",
      "relationship_sentence": "sGDML demonstrated the benefits and feasibility of enforcing energy conservation in force learning, serving as a key conservative counterpoint against which non-conservative approaches are assessed."
    },
    {
      "title": "The Open Catalyst 2020 (OC20) Dataset and Community Challenges",
      "authors": "L. Chanussot et al.",
      "year": 2020,
      "role": "Benchmark that popularized large-scale force supervision for relaxations",
      "relationship_sentence": "OC20 emphasized force-centric training and geometry relaxations, catalyzing widespread adoption of force-only predictors and motivating scrutiny of their behavior in optimization and dynamics."
    },
    {
      "title": "GemNet-OC: Developed for the Open Catalyst Project",
      "authors": "J. Gasteiger, J. Groß, S. Günnemann (and collaborators within OCP)",
      "year": 2021,
      "role": "Directional message passing model widely used for force prediction in relaxations",
      "relationship_sentence": "GemNet-OC operationalized high-accuracy force prediction for catalyst relaxations often independent of a consistent energy functional, directly inspiring the present paper’s evaluation of non-conservative force fields in geometry optimization."
    },
    {
      "title": "TorchMD-Net: Equivariant Transformers for Molecular Property Prediction",
      "authors": "P. Thölke, G. De Fabritiis",
      "year": 2022,
      "role": "Equivariant architecture enabling practical force-only training and MD",
      "relationship_sentence": "TorchMD-Net popularized training and deployment of equivariant, force-only models for molecular dynamics, motivating a systematic study of their stability and conservativity in simulation."
    },
    {
      "title": "E(3)-Equivariant Graph Neural Networks for Data-Efficient and Accurate Interatomic Potentials (NequIP)",
      "authors": "S. Batzner, A. Musaelian, L. Sun, M. Geiger, A. P. Bartók, D. P. Kovács, C. Ortner, B. Kozinsky",
      "year": 2022,
      "role": "State-of-the-art conservative, energy-based equivariant potential",
      "relationship_sentence": "NequIP provides a strong, energy-conserving baseline demonstrating stability and accuracy in MD, against which the drawbacks of non-conservative force predictors can be contrasted."
    },
    {
      "title": "Deep Potential Molecular Dynamics: A Scalable Model with the Accuracy of Quantum Mechanics",
      "authors": "L. Zhang, J. Han, H. Wang, R. Car, W. E",
      "year": 2018,
      "role": "Widely adopted conservative energy-based potential for MD",
      "relationship_sentence": "DeePMD exemplifies the mainstream practice of deriving forces as energy gradients for stable, long MD, framing why deviations from conservativity demand careful assessment."
    }
  ],
  "synthesis_narrative": "The paper interrogates a growing trend in atomistic machine learning: training models to predict forces directly without guaranteeing they derive from a potential energy. This trajectory can be traced back to the force-matching paradigm of Ercolessi and Adams, which legitimized learning from forces but did not enforce integrability, and to sGDML, which demonstrated that explicitly conservative force fields are both feasible and data-efficient. The Open Catalyst 2020 benchmark and its GemNet-OC models then shifted community focus to force-centric training and geometry relaxations at scale, where many high-performing models were deployed without a provable energy functional, implicitly suggesting that conservativity might be unnecessary. Concurrently, architectures such as TorchMD-Net made force-only, SE(3)-equivariant predictors practical for molecular dynamics, further normalizing non-conservative usage in simulation settings. Against this backdrop, conservative, energy-based standards like NequIP and DeePMD consistently delivered accurate and stable MD, providing a robust baseline for comparison. The present work synthesizes these streams by systematically stress-testing non-conservative force models in core simulation tasks—geometry optimization and various molecular dynamics protocols—revealing ill-posed convergence and instabilities that conservative models avoid. In doing so, it challenges the emerging narrative that energy conservation can be ‘learned implicitly,’ arguing instead for explicit conservativity or principled constraints when the goal is reliable microscopic simulation.",
  "analysis_timestamp": "2026-01-07T00:04:09.139688"
}