{
  "prior_works": [
    {
      "title": "Conditional Flow Matching: Simulation-Free Training of Continuous Normalizing Flows",
      "authors": "Alexander Tong et al.",
      "year": 2023,
      "role": "Foundation",
      "relationship_sentence": "Introduces the conditional flow matching (CFM) objective and pathwise velocity-field formulation that this paper directly extends by adding guidance terms, yielding new training losses and corrected sampling dynamics for general flow matching."
    },
    {
      "title": "Stochastic Interpolants: A Unifying Framework for Flows and Diffusions",
      "authors": "Michael S. Albergo et al.",
      "year": 2023,
      "role": "Foundation",
      "relationship_sentence": "Provides the theoretical continuity-equation/interpolant framework that the paper leverages to define guidance on arbitrary flow paths and to prove asymptotic exactness of its training-free guidance."
    },
    {
      "title": "Score-Based Generative Modeling through Stochastic Differential Equations",
      "authors": "Yang Song et al.",
      "year": 2021,
      "role": "Foundation",
      "relationship_sentence": "Establishes the probability flow ODE view of diffusion processes, which the paper generalizes to flow matching by deriving how energy-based guidance modifies the ODE/vector field to target energy-tilted distributions."
    },
    {
      "title": "Denoising Diffusion Implicit Models",
      "authors": "Jiaming Song et al.",
      "year": 2020,
      "role": "Related Problem",
      "relationship_sentence": "Introduces deterministic ODE sampling for diffusion; the paper recasts such ODE-based guided sampling within the broader flow-matching framework and recovers classical gradient guidance as a special case."
    },
    {
      "title": "Diffusion Models Beat GANs on Image Synthesis",
      "authors": "Prafulla Dhariwal et al.",
      "year": 2021,
      "role": "Extension",
      "relationship_sentence": "Proposes classifier guidance (adding ∇x log p(y|x) to the reverse dynamics); the paper generalizes this gradient-guidance principle beyond diffusion to arbitrary flow-matching paths and shows it as a limiting case of their approximate guidance."
    },
    {
      "title": "Classifier-Free Diffusion Guidance",
      "authors": "Jonathan Ho et al.",
      "year": 2022,
      "role": "Baseline",
      "relationship_sentence": "Introduces training-based guidance via joint conditional/unconditional training; the paper designs flow-matching analogues—novel training losses and samplers—that extend classifier-free guidance beyond diffusion to general flow matching."
    }
  ],
  "synthesis_narrative": "The core contribution of “On the Guidance of Flow Matching” is a unified guidance framework for general flow-matching models, yielding training-free asymptotically exact guidance, new training-based guidance losses, and principled approximate gradient guidance. This builds directly on the foundations laid by Conditional Flow Matching, which formulates generative modeling by learning pathwise velocity fields along arbitrary interpolants; the new work augments that formulation with guidance terms in both training and sampling. Stochastic Interpolants provides the continuity-equation view and path-distribution calculus that the paper exploits to define guidance on general interpolants and to prove asymptotic exactness of its training-free method. From the diffusion side, Score-Based Generative Modeling through SDEs and DDIM establish the probability-flow ODE and deterministic ODE sampling perspectives; the present paper generalizes the idea of modifying ODE drifts for guidance from diffusion-specific dynamics to arbitrary flow-matching paths. Critically, the widely used diffusion guidance mechanisms—classifier guidance (Dhariwal & Nichol) and classifier-free guidance (Ho & Salimans)—serve as immediate baselines and inspirations: the authors’ approximate guidance recovers classical gradient guidance as a special case, while their training-based objectives are the flow-matching analogues of classifier-free guidance. Together, these works directly shaped the paper’s framework, which fills the explicit gap of principled, general guidance for flow matching beyond diffusion-only formulations.",
  "analysis_timestamp": "2026-01-06T23:07:19.611872"
}