{
  "prior_works": [
    {
      "title": "Thin shell implies spectral gap up to polylogarithmic factors for convex bodies",
      "authors": "Ronen Eldan",
      "year": 2013,
      "role": "Foundation",
      "relationship_sentence": "Introduces the stochastic localization framework; this paper directly repurposes Eldan’s stochastic localization as the central formalism to explain how generative processes localize onto sub-populations, yielding critical windows."
    },
    {
      "title": "The KLS conjecture is true up to a polylogarithmic factor",
      "authors": "Yin Tat Lee et al.",
      "year": 2021,
      "role": "Extension",
      "relationship_sentence": "Develops matrix-valued stochastic localization and refined control of covariance along the localization process; the present work leverages these strengthened tools to avoid Gaussian-specific assumptions and prove model-agnostic localization phenomena."
    },
    {
      "title": "Deep Unsupervised Learning using Nonequilibrium Thermodynamics",
      "authors": "Jascha Sohl-Dickstein et al.",
      "year": 2015,
      "role": "Foundation",
      "relationship_sentence": "Introduces diffusion-based generative modeling via forward noising and reverse denoising, establishing the generative process whose stepwise dynamics and feature emergence this paper seeks to explain in a general, theory-driven way."
    },
    {
      "title": "Denoising Diffusion Probabilistic Models",
      "authors": "Jonathan Ho et al.",
      "year": 2020,
      "role": "Foundation",
      "relationship_sentence": "Provides the modern DDPM formulation and Gaussian noise schedules that underlie much of the empirical and theoretical discussion of critical timesteps; this paper generalizes beyond such Gaussian-specific settings using stochastic localization."
    },
    {
      "title": "Score-Based Generative Modeling through Stochastic Differential Equations",
      "authors": "Yang Song et al.",
      "year": 2021,
      "role": "Foundation",
      "relationship_sentence": "Frames diffusion generation as SDEs/ODEs, giving a process-level view that this paper builds on to articulate localization over time and to unify diffusion and autoregressive generation under a common stochastic-process lens."
    },
    {
      "title": "Elucidating the Design Space of Diffusion-Based Generative Models",
      "authors": "Tero Karras et al.",
      "year": 2022,
      "role": "Gap Identification",
      "relationship_sentence": "Empirically and analytically highlights that certain noise ranges and schedules disproportionately determine sample quality—an observation of narrow ‘critical’ regimes that this paper explains generically via stochastic localization, beyond Gaussian design choices."
    },
    {
      "title": "High-Resolution Image Synthesis with Latent Diffusion Models",
      "authors": "Robin Rombach et al.",
      "year": 2022,
      "role": "Gap Identification",
      "relationship_sentence": "Documents coarse-to-fine, step-dependent feature formation in diffusion (semantics decided early, details later); this empirical critical-window phenomenon is given a unifying theoretical explanation here via localization to sub-populations."
    }
  ],
  "synthesis_narrative": "The core innovation of this paper is a simple, unifying theory for feature localization across generative models, grounded in stochastic localization. Eldan’s introduction of stochastic localization established the key probabilistic lens: a stochastic process that incrementally concentrates a distribution onto sub-populations. Subsequent advances by Lee and collaborators (matrix stochastic localization) provided sharper, time-evolving covariance control, enabling analyses that do not hinge on Gaussian structure—precisely the technical capability this work exploits to avoid distribution-specific assumptions.\n\nOn the generative modeling side, the diffusion paradigm introduced by Sohl-Dickstein and solidified by Ho et al. (DDPM) defined the stepwise denoising process where ‘critical windows’ have been repeatedly observed. Song et al.’s SDE formalization furnishes a process-level language unifying diffusion dynamics with broader stochastic processes; the present paper leverages this to articulate localization over time and extend beyond Gaussian diffusion to autoregressive generation.\n\nEmpirically oriented studies in diffusion—especially Karras et al.’s analysis of noise-level design and Rombach et al.’s latent diffusion—highlight that narrow bands of timesteps disproportionately determine semantic content and final quality. These works exposed a gap: compelling evidence of critical windows but explanations tied to Gaussian schedules and specific architectures. By importing stochastic localization into the generative modeling context, this paper closes that gap, showing that sudden, step-localized behavioral shifts arise generically as the generation process localizes to sub-populations, unifying observations across diffusion and autoregressive models.",
  "analysis_timestamp": "2026-01-06T23:07:19.629348"
}