{
  "prior_works": [
    {
      "title": "3D Gaussian Splatting for Real-Time Radiance Field Rendering",
      "authors": "Kerbl et al.",
      "year": 2023,
      "role": "Foundation",
      "relationship_sentence": "ReferSplat operates directly on the 3D Gaussian Splatting representation, inheriting its point-based radiance parameterization and differentiable rendering; the paper’s core idea of segmenting and grounding language on Gaussian points depends on Kerbl et al.’s representation."
    },
    {
      "title": "LERF: Language Embedded Radiance Fields",
      "authors": "Kerr et al.",
      "year": 2023,
      "role": "Foundation",
      "relationship_sentence": "LERF introduced embedding language features into 3D radiance fields for open-vocabulary queries; ReferSplat brings this language-embedded 3D idea to Gaussian splats and explicitly addresses LERF’s limitations (slow NeRF rendering and weak handling of occluded/relational targets), even building the Ref-LERF dataset from LERF-style scenes."
    },
    {
      "title": "LangSplat: 3D Language Gaussian Splatting",
      "authors": "Zhang et al.",
      "year": 2024,
      "role": "Baseline",
      "relationship_sentence": "LangSplat attaches vision-language features to Gaussians for open-vocabulary querying; ReferSplat directly extends this line by adding spatially aware language–3D modeling to support referring segmentation and reasoning about occluded objects, and uses it as a primary baseline."
    },
    {
      "title": "OpenGaussian: Open-Vocabulary 3D Scene Understanding with Gaussian Splatting",
      "authors": "Liu et al.",
      "year": 2024,
      "role": "Baseline",
      "relationship_sentence": "OpenGaussian propagates 2D open-vocabulary semantics into Gaussian splats; ReferSplat improves upon this paradigm by explicitly modeling 3D spatial relations in language queries, overcoming OpenGaussian’s limitation of mostly handling directly visible, attribute-only matches."
    },
    {
      "title": "Panoptic Gaussian Splatting",
      "authors": "Han et al.",
      "year": 2023,
      "role": "Gap Identification",
      "relationship_sentence": "Panoptic Gaussian Splatting integrates closed-vocabulary semantic/panoptic labels into Gaussians; its inability to support open-vocabulary and relational/occluded referring queries motivates ReferSplat’s open-vocabulary, language-conditioned segmentation on Gaussians."
    },
    {
      "title": "ScanRefer: 3D Object Localization in RGB-D Scans using Natural Language",
      "authors": "Chen et al.",
      "year": 2020,
      "role": "Foundation",
      "relationship_sentence": "ScanRefer formulated 3D referring expression grounding with explicit spatial-relation cues; ReferSplat transposes this problem to Gaussian scenes and extends localization to fine-grained segmentation over splats."
    },
    {
      "title": "3DVG-Transformer: Relation Modeling for Visual Grounding on Point Clouds",
      "authors": "Zhao et al.",
      "year": 2021,
      "role": "Inspiration",
      "relationship_sentence": "3DVG-Transformer demonstrated that modeling inter-object spatial relations is critical for 3D language grounding; ReferSplat adopts this insight to design a spatially aware language–Gaussian interaction module for referring segmentation."
    }
  ],
  "synthesis_narrative": "ReferSplat’s core innovation—referring segmentation directly over 3D Gaussian splats with explicit spatial-relation reasoning—emerges from two converging threads. First, Kerbl et al.’s 3D Gaussian Splatting establishes the foundational point-based radiance representation that ReferSplat both optimizes and segments; without 3DGS, the paper’s notion of assigning and reasoning over language features at the Gaussian primitive level would not stand. Second, the language-embedded 3D idea crystallized by LERF shows how to imbue a 3D radiance representation with open-vocabulary semantics, but its NeRF backbone and visibility-centric matching limit practical reasoning about occluded objects and relational descriptions—gaps ReferSplat explicitly targets and for which Ref-LERF provides tailored data.\nWithin the Gaussian family, LangSplat and OpenGaussian are the most direct precursors, attaching vision–language features to splats to enable text queries. ReferSplat positions these as primary baselines and extends them by introducing spatially aware language–3D modeling that reasons across neighborhoods of splats and inter-object layouts, thereby handling occlusions and language with relational cues. Complementing this, Panoptic Gaussian Splatting demonstrates semantic labeling in Gaussians but within a closed vocabulary, underscoring the need for open-vocabulary referring abilities that ReferSplat delivers.\nFinally, the problem formulation and key insight that relational reasoning is central to 3D language grounding trace to ScanRefer and 3DVG-Transformer. ReferSplat internalizes these lessons in a Gaussian setting, upgrading from object localization to fine-grained segmentation while preserving the relational grounding essential for real-world, language-driven 3D understanding.",
  "analysis_timestamp": "2026-01-06T23:07:19.636452"
}