{
  "prior_works": [
    {
      "title": "The Design of Experiments",
      "authors": "R. A. Fisher",
      "year": 1935,
      "role": "Foundational framework for factorial experimental design and randomization in experiments",
      "relationship_sentence": "The paper generalizes classical factorial experiments by replacing fixed treatment combinations with a product-Bernoulli randomized assignment, explicitly formalizing Fisher’s randomization principle for multi-factor settings."
    },
    {
      "title": "The Design of Optimum Multifactorial Experiments",
      "authors": "R. L. Plackett, J. P. Burman",
      "year": 1946,
      "role": "Fractional factorial designs enabling efficient screening of many factors with limited runs",
      "relationship_sentence": "The proposed probabilistic factorial design addresses the same scaling challenge as Plackett–Burman designs but does so via randomized independent dosing, providing a flexible alternative to fixed fractional designs when interactions are present."
    },
    {
      "title": "Optimum Designs in Regression Problems",
      "authors": "Jack Kiefer, Jacob Wolfowitz",
      "year": 1959,
      "role": "Foundations of optimal experimental design (e.g., D-, A-optimality) using Fisher information",
      "relationship_sentence": "Optimizing treatment dosages (Bernoulli probabilities) to maximize information for bounded-degree interaction models directly builds on Kiefer–Wolfowitz optimality criteria for design selection."
    },
    {
      "title": "Bayesian Experimental Design: A Review",
      "authors": "Kathryn Chaloner, Isabella Verdinelli",
      "year": 1995,
      "role": "Principled adaptive/active experimental design via expected utility and information-based criteria",
      "relationship_sentence": "The paper’s multi-round, adaptive adjustment of treatment dosages follows the Bayesian design paradigm of iteratively choosing designs to maximize expected information gain under model uncertainty."
    },
    {
      "title": "Efficiently Learning Ising Models",
      "authors": "Guy Bresler",
      "year": 2015,
      "role": "Identification of bounded-degree interaction structures from randomized observations",
      "relationship_sentence": "The bounded-degree interaction assumption and sample-complexity insights for recovering sparse higher-order dependencies inform the identifiability and efficiency guarantees of the proposed combinatorial intervention model."
    },
    {
      "title": "A Lasso for Hierarchical Interactions",
      "authors": "Jacob Bien, Jonathan Taylor, Robert Tibshirani",
      "year": 2013,
      "role": "Modeling and selecting sparse interaction effects under hierarchical structural constraints",
      "relationship_sentence": "The focus on sparse, structured interaction effects parallels the paper’s bounded-degree model, motivating designs that are especially informative for detecting interaction terms rather than only main effects."
    },
    {
      "title": "Combinatorial CRISPR–Cas9 Screens for De Novo Mapping of Genetic Interactions",
      "authors": "J. P. Shen, D. Zhao, R. Sasik, J. Luebeck, et al.",
      "year": 2017,
      "role": "Empirical paradigm for combinatorial perturbations with interactive effects in biomedicine",
      "relationship_sentence": "Real-world combinatorial perturbation screens motivated the need for scalable designs; the paper’s probabilistic assignment across multiple treatments aligns with how pooled dual-/multi-guide CRISPR experiments are implemented in practice."
    }
  ],
  "synthesis_narrative": "The paper’s core innovation—a probabilistic factorial experimental design that assigns each unit an independently sampled combination of treatments from a product Bernoulli distribution and adapts dosages over rounds—sits at the intersection of classical design of experiments, optimal design theory, sparse interaction modeling, and modern applications in combinatorial perturbations. Fisher’s foundational work on factorial experiments and randomization defined the design space the authors aim to modernize, while Plackett–Burman’s fractional factorials provided the canonical approach to scaling multifactor experiments when full 2^p designs are infeasible. The present work departs by replacing fixed assignment matrices with a flexible probabilistic scheme that naturally extends to multiple rounds.\n\nOn the optimization side, Kiefer–Wolfowitz’s optimal design criteria and the Bayesian experimental design framework of Chaloner–Verdinelli directly inform how to choose and adapt treatment probabilities to maximize information about model parameters. The paper’s bounded-degree interaction model connects to theory on learning sparse interaction structures: Bien–Taylor–Tibshirani formalize hierarchical sparsity in interactions, while Bresler’s results for bounded-degree Ising models illustrate identifiability and sample-complexity advantages under structural constraints with randomized measurements. Finally, empirical advances in combinatorial CRISPR screening (e.g., Shen et al.) motivate the need for a design that matches lab practice—assigning multiple perturbations per unit with controllable frequencies—while enabling principled, information-efficient optimization and adaptive rounds. Together, these works directly scaffold the paper’s probabilistic design formalism, its optimality objectives, and its structural modeling assumptions.",
  "analysis_timestamp": "2026-01-07T00:21:32.373814"
}