{
  "prior_works": [
    {
      "title": "Tree of Thoughts: Deliberate Problem Solving with Large Language Models",
      "authors": [
        "Shunyu Yao et al."
      ],
      "year": 2023,
      "role": "LLM-guided search and evaluation",
      "relationship_sentence": "PokéChamp’s use of an LLM to propose and evaluate branches in a game-tree directly builds on ToT’s insight that LLMs can guide tree search via intermediate reasoning rather than relying solely on fixed heuristics."
    },
    {
      "title": "ReAct: Synergizing Reasoning and Acting in Language Models",
      "authors": [
        "Shunyu Yao et al."
      ],
      "year": 2023,
      "role": "History-conditioned reasoning and action selection",
      "relationship_sentence": "ReAct’s interleaving of reasoning with environment interaction informed PokéChamp’s history-aware prompting for action sampling and opponent modeling, crucial for handling partial observability in battles."
    },
    {
      "title": "Mastering Chess and Shogi by Self-Play with a General Reinforcement Learning Algorithm (AlphaZero)",
      "authors": [
        "David Silver et al."
      ],
      "year": 2017,
      "role": "Search with learned policy and value priors",
      "relationship_sentence": "PokéChamp mirrors AlphaZero’s decomposition into policy priors and value estimation inside tree search, but replaces trained networks with zero-shot LLM modules for action priors and value evaluation in a minimax framework."
    },
    {
      "title": "ReBeL: Combining deep reinforcement learning and search for imperfect-information games",
      "authors": [
        "Noam Brown",
        "Anton Bakhtin",
        "Adam Lerer",
        "Qucheng Gong"
      ],
      "year": 2020,
      "role": "Belief-state search in imperfect-information settings",
      "relationship_sentence": "ReBeL’s public-belief-state search directly motivates PokéChamp’s treatment of hidden information via LLM-based opponent modeling and value estimation conditioned on observed history."
    },
    {
      "title": "Information Set Monte Carlo Tree Search",
      "authors": [
        "Peter I. Cowling",
        "Edward J. Powley",
        "Daniel Whitehouse"
      ],
      "year": 2012,
      "role": "Planning under partial observability",
      "relationship_sentence": "PokéChamp’s approach to reduce the search space under hidden information parallels ISMCTS’s determinization over information sets, here realized by prompting an LLM to hypothesize opponent options and likely states."
    },
    {
      "title": "Human-level play in the game of Diplomacy by combining language models with strategic reasoning (CICERO)",
      "authors": [
        "Noam Brown et al."
      ],
      "year": 2022,
      "role": "Opponent modeling integrated with language",
      "relationship_sentence": "CICERO demonstrated that language models can power opponent modeling and strategic reasoning; PokéChamp adapts this idea by prompting LLMs to predict opponent actions within a competitive, imperfect-information game."
    },
    {
      "title": "PokeLLMon: An LLM Agent for Pokémon Battles",
      "authors": [
        "Community project / open-source"
      ],
      "year": 2024,
      "role": "Domain-specific LLM baseline",
      "relationship_sentence": "As the prior LLM-based Pokémon agent, PokeLLMon provides the immediate baseline that PokéChamp surpasses, with PokéChamp’s novelty being the integration of LLM modules inside a principled minimax search with opponent modeling and value estimates."
    }
  ],
  "synthesis_narrative": "PokéChamp’s core innovation—plugging zero-shot LLM modules into a principled minimax search to handle action proposal, opponent modeling, and value estimation under partial observability—sits at the intersection of three lines of prior work. From the game-search perspective, AlphaZero established the power of combining tree search with learned policy priors and value functions. PokéChamp mirrors this decomposition but replaces trained neural heads with promptable LLMs, leveraging their general knowledge to guide search without additional training. For imperfect-information reasoning, ReBeL and ISMCTS provided templates for searching over belief or information sets, showing how hidden information can be handled through structured search and opponent modeling. PokéChamp adopts this stance by conditioning LLM judgments on gameplay history to implicitly form and exploit beliefs about the opponent’s hidden choices.\nConcurrently, the LLM-agents literature demonstrated that language models can plan via search and benefit from history conditioning. Tree of Thoughts showed that LLMs can evaluate and expand branches in a deliberative tree, while ReAct emphasized using accumulated interaction history to inform next actions. PokéChamp fuses these insights: the LLM proposes plausible actions, predicts opponent responses, and assigns value estimates to nodes in a minimax tree, all conditioned on rich battle context. Finally, domain-specific momentum came from PokeLLMon, which proved that LLMs can play competitive Pokémon but lacked principled search and opponent modeling. By unifying these strands, PokéChamp attains expert-level play with zero additional LLM training.",
  "analysis_timestamp": "2026-01-07T00:04:09.143254"
}