{
  "prior_works": [
    {
      "title": "The On-Line Encyclopedia of Integer Sequences",
      "authors": "N. J. A. Sloane",
      "year": 2003,
      "role": "Foundation",
      "relationship_sentence": "OEIS established the paradigm of pairing large example corpora with open mathematical questions to facilitate conjecture formation; ACD Repo adopts this examples-first, research-facing curation philosophy within algebraic combinatorics."
    },
    {
      "title": "FindStat — The Combinatorial Statistics Database",
      "authors": "Martin Rubey et al.",
      "year": 2016,
      "role": "Extension",
      "relationship_sentence": "FindStat created a structured, machine-readable repository linking combinatorial objects to statistics; ACD Repo directly extends this database-centric approach by curating task-specific datasets and massive example sets aimed at conjecturing in algebraic combinatorics."
    },
    {
      "title": "On Conjectures of Graffiti",
      "authors": "Ermelinda Fajtlowicz",
      "year": 1988,
      "role": "Foundation",
      "relationship_sentence": "Graffiti pioneered automated conjecture generation from invariants over large collections of discrete objects; ACD Repo formalizes benchmarks enabling modern ML to replicate and evaluate this conjecturing workflow at research level."
    },
    {
      "title": "Variable Neighborhood Search for Extremal Graphs: The AutoGraphiX System",
      "authors": "Gilles Caporossi et al.",
      "year": 2000,
      "role": "Inspiration",
      "relationship_sentence": "AutoGraphiX demonstrated a data-driven loop—generate many examples, search for patterns, pose conjectures—in discrete mathematics; ACD Repo generalizes this loop to algebraic combinatorics with orders-of-magnitude larger, standardized datasets."
    },
    {
      "title": "Advancing mathematics by guiding human intuition with AI",
      "authors": "Alex Davies et al.",
      "year": 2021,
      "role": "Gap Identification",
      "relationship_sentence": "This work showed ML can spark new mathematical conjectures but lacked standardized, open datasets; ACD Repo explicitly addresses this gap by providing research-level, open-ended conjecturing benchmarks grounded in large example sets."
    },
    {
      "title": "Measuring Mathematical Problem Solving With the MATH Dataset",
      "authors": "Dan Hendrycks et al.",
      "year": 2021,
      "role": "Gap Identification",
      "relationship_sentence": "MATH popularized large-scale math benchmarks but focuses on fixed-solution problems; ACD Repo targets the missing regime of open-ended, research-level conjecture generation using extensive example corpora."
    },
    {
      "title": "On the Measure of Intelligence (introducing the ARC benchmark)",
      "authors": "François Chollet",
      "year": 2019,
      "role": "Related Problem",
      "relationship_sentence": "ARC formalized evaluating abstraction via pattern induction from examples; ACD Repo transports this evaluation philosophy to rigorous pure mathematics, where conjectures are induced from structured algebraic-combinatorial examples."
    }
  ],
  "synthesis_narrative": "The ACD Repo’s core innovation—standardized, large-scale datasets for research-level conjecturing in algebraic combinatorics—arises from two intertwined lineages: data-centric mathematical discovery and modern ML benchmarks. Historically, Graffiti and AutoGraphiX showed that assembling large collections of discrete objects and invariants enables algorithmic conjecture generation, seeding the workflow ACD seeks to benchmark. In parallel, OEIS institutionalized an examples-first practice for discovery, while FindStat brought that discipline to combinatorial objects and statistics, supplying the structural template that ACD explicitly extends to algebraic combinatorics tasks with millions of examples. On the ML side, Davies et al. demonstrated that learning systems can meaningfully guide mathematical intuition, but the field lacked shared, open benchmarks that reflect the open-endedness professional mathematicians face; ACD directly answers this deficit with research-level conjecturing tasks. Meanwhile, popular benchmarks like MATH honed problem solving on fixed-answer questions, leaving conjecture generation under-served—precisely the gap ACD fills. Finally, ARC’s emphasis on abstraction via induction from examples influenced ACD’s evaluative stance: conjectures should emerge from patterns in data. Together, these works directly shaped ACD’s formulation: curate large, structured example repositories around foundational and open problems in algebraic combinatorics to measure and catalyze ML-driven conjecturing at the frontier of pure mathematics.",
  "analysis_timestamp": "2026-01-06T23:07:19.607695"
}