{
  "prior_works": [
    {
      "title": "Algorithmic Learning in a Random World",
      "authors": "Vladimir Vovk; Alex Gammerman; Glenn Shafer",
      "year": 2005,
      "role": "Foundational conformal prediction",
      "relationship_sentence": "Establishes distribution-free prediction sets that underpin the paper’s finite-sample, distribution-free construction and its use of prediction sets as the uncertainty object for downstream decisions."
    },
    {
      "title": "Conformalized Quantile Regression",
      "authors": "Yaniv Romano; Evan Patterson; Emmanuel J. Candès",
      "year": 2019,
      "role": "Quantile-oriented conformal inference",
      "relationship_sentence": "Introduces conformal procedures targeted at conditional quantiles, directly informing the paper’s VaR-centric view of uncertainty and its population characterization of sets aligned with loss quantiles."
    },
    {
      "title": "Conformal Risk Control",
      "authors": "Stephen Bates; Anastasios N. Angelopoulos; Lihua Lei; Yaniv Romano",
      "year": 2021,
      "role": "Risk-aware conformal calibration",
      "relationship_sentence": "Provides a framework for designing prediction sets to control general risks beyond marginal coverage, a direct precursor to the paper’s Risk-Averse Calibration that targets Value-at-Risk objectives."
    },
    {
      "title": "Least Ambiguous Set-Valued Classifiers With Bounded Error Levels",
      "authors": "Mauricio Sadinle; Jing Lei; Larry Wasserman",
      "year": 2019,
      "role": "Decision-theoretic optimal set prediction",
      "relationship_sentence": "Characterizes optimal set-valued predictors under risk constraints, informing this paper’s decision-theoretic treatment of prediction sets and the optimality structure of sets for downstream actions."
    },
    {
      "title": "Coherent Measures of Risk",
      "authors": "Philippe Artzner; Freddy Delbaen; Jean-Marc Eber; David Heath",
      "year": 1999,
      "role": "Foundations of risk measures and VaR/CVaR",
      "relationship_sentence": "Formalizes axioms for risk measures and situates VaR within decision theory, grounding the paper’s choice of VaR as the risk-averse objective linked to prediction sets."
    },
    {
      "title": "Optimization of Conditional Value-at-Risk",
      "authors": "R. Tyrrell Rockafellar; Stanislav Uryasev",
      "year": 2000,
      "role": "Optimization under tail risk",
      "relationship_sentence": "Develops tractable optimization for tail risk (VaR/CVaR) and connects quantile objectives to auxiliary variables, informing the paper’s characterization of VaR-optimal policies and sets."
    },
    {
      "title": "Robust Convex Optimization",
      "authors": "Aharon Ben-Tal; Arkadi Nemirovski",
      "year": 1998,
      "role": "Max–min decision-making via uncertainty sets",
      "relationship_sentence": "Establishes worst-case (max–min) decision rules over uncertainty sets, directly supporting the paper’s result that a simple max–min policy is optimal when acting on prediction sets."
    }
  ],
  "synthesis_narrative": "The paper’s core contribution—linking prediction sets to optimal decision-making for risk-averse agents via Value-at-Risk (VaR) and deriving Risk-Averse Calibration (RAC)—rests on three intertwined lines of prior work. First, conformal prediction provides the distribution-free machinery for constructing valid prediction sets. Vovk, Gammerman, and Shafer introduced conformal prediction, giving the finite-sample guarantees that RAC leverages, while Romano, Patterson, and Candès’s conformalized quantile regression points directly at quantile-oriented objectives like VaR that the present work formalizes. Second, recent advances in risk-aware conformal methods laid the blueprint for targeting decision-relevant risks: Bates, Angelopoulos, Lei, and Romano’s Conformal Risk Control generalizes conformal calibration to user-defined risks, paving the way for the paper’s specialization to VaR and its exact population characterization of optimal sets.\nThird, decision-theoretic and optimization foundations clarify why prediction sets and max–min policies are the right coupling for risk aversion. Artzner et al. formalize risk measures and position VaR within coherent risk theory, while Rockafellar and Uryasev’s tail-risk optimization connects quantiles to tractable optimization, reinforcing the paper’s VaR-optimality results. Finally, Ben-Tal and Nemirovski’s robust optimization shows that acting by minimizing worst-case loss over an uncertainty set is optimal under ambiguity, directly supporting the paper’s max–min policy result when actions are conditioned on prediction sets. Complementing these, Sadinle, Lei, and Wasserman’s decision-theoretic treatment of optimal set-valued predictors informs the structural optimality of prediction sets for downstream actions. Together, these works directly enable the paper’s decision-theoretic foundation and distribution-free RAC algorithm.",
  "analysis_timestamp": "2026-01-07T00:05:12.562439"
}