{
  "prior_works": [
    {
      "title": "On the Randomness Complexity of Stability (ICML 2024)",
      "authors": "James R. Dixon, A. Pavan, Michael Vander Woude, N. V. Vinodchandran",
      "year": 2024,
      "role": "Direct precursor",
      "relationship_sentence": "Introduced and analyzed the randomness complexity of stability notions (in particular, replicability), providing weak-to-strong style amplification ideas and baseline upper/lower bounds that this paper generalizes and sharpens."
    },
    {
      "title": "On the Randomness Complexity of Differential Privacy (ITCS 2024)",
      "authors": "Dario Cannone, Weijie J. Su, Salil Vadhan",
      "year": 2024,
      "role": "Direct precursor",
      "relationship_sentence": "Studied how many random bits are necessary and sufficient for differentially private algorithms, developing techniques (e.g., limited-independence, extractor-based arguments) that the present work adapts to unify and extend randomness bounds across DP and replicability."
    },
    {
      "title": "Stability and Generalization",
      "authors": "Olivier Bousquet, André Elisseeff",
      "year": 2002,
      "role": "Foundational concept",
      "relationship_sentence": "Established algorithmic stability as a core route to generalization, grounding the paper’s central question and providing the formal stability framework within which randomness requirements are quantified."
    },
    {
      "title": "The Reusable Holdout: Preserving Validity in Adaptive Data Analysis",
      "authors": "Cynthia Dwork, Vitaly Feldman, Moritz Hardt, Toniann Pitassi, Omer Reingold, Aaron Roth",
      "year": 2015,
      "role": "Conceptual bridge",
      "relationship_sentence": "Linked differential privacy to stability and generalization under adaptivity, motivating a unified treatment of replicability and DP and informing how stability guarantees interact with randomized algorithm design."
    },
    {
      "title": "Mechanism Design via Differential Privacy",
      "authors": "Frank McSherry, Kunal Talwar",
      "year": 2007,
      "role": "Canonical mechanism/technical anchor",
      "relationship_sentence": "Introduced the exponential mechanism and crystallized the inherently randomized nature of DP, furnishing canonical targets for analyzing and benchmarking randomness complexity in private algorithms."
    },
    {
      "title": "What Can We Learn Privately?",
      "authors": "Shiva Prasad Kasiviswanathan, Homin K. Lee, Kobbi Nissim, Sofya Raskhodnikova, Adam Smith",
      "year": 2011,
      "role": "Foundational in private learning",
      "relationship_sentence": "Characterized the landscape of differentially private learning, shaping the learning-theoretic context in which the present work quantifies randomness needed to attain DP (and thereby stability) guarantees."
    }
  ],
  "synthesis_narrative": "This paper’s core contribution—quantifying the randomness complexity required to achieve strong forms of stability, particularly replicability and differential privacy (DP), and proving a weak-to-strong upgrade—builds most immediately on two 2024 threads. Dixon–Pavan–Vander Woude–Vinodchandran (ICML 2024) initiated a direct study of the randomness needed for stability/replicability and introduced amplification-style arguments that convert weak guarantees into stronger ones with additional randomness. In parallel, Cannone–Su–Vadhan (ITCS 2024) analyzed the randomness complexity of DP mechanisms, developing techniques (e.g., limited-independence and extractor-style constructions) and lower-bound frameworks that the present work adapts and unifies across both DP and replicability.\nFoundationally, Bousquet–Elisseeff (2002) formalized algorithmic stability and its connection to generalization, providing the conceptual backbone for asking how much randomness is necessary for stability. Dwork et al. (2015) further cemented the bridge between DP and stability/generalization in adaptive settings, motivating a common treatment of these notions under a shared randomness budget. Within DP, McSherry–Talwar (2007) delineated the inherently randomized nature of private mechanisms via the exponential mechanism, offering concrete algorithmic templates whose seed length can be scrutinized. Finally, Kasiviswanathan et al. (2011) situated DP firmly within learning theory, clarifying the targets and constraints for private learners.\nTogether, these works supply both the conceptual unification (stability ↔ DP) and the technical machinery (amplification, limited-independence, extractor-inspired analyses) that enable this paper’s weak-to-strong theorem and its tight bounds on the random bits required to realize robust stability guarantees.",
  "analysis_timestamp": "2026-01-07T00:21:32.365811"
}