{
  "prior_works": [
    {
      "title": "Other-Play for Zero-Shot Coordination",
      "authors": "Hu et al.",
      "year": 2020,
      "role": "Foundational ZSC method and evaluation protocol",
      "relationship_sentence": "CEC builds directly on the ZSC problem framing and cross-play evaluation popularized by Other-Play, extending from single-game symmetry randomization to learning general cooperative norms across a distribution of environments."
    },
    {
      "title": "Fictitious Co-Play (FCP): Belief Learning for Zero-Shot Coordination",
      "authors": "Hu et al.",
      "year": 2020,
      "role": "Algorithmic baseline for partner-agnostic cooperation",
      "relationship_sentence": "CEC contrasts with FCP’s partner-belief approach by showing that training with a single partner across many procedurally generated tasks can produce norms that transfer to many unseen partners and tasks without modeling partner distributions explicitly."
    },
    {
      "title": "The Hanabi Challenge: A New Frontier for AI Research",
      "authors": "Bard et al.",
      "year": 2020,
      "role": "Benchmark and motivation for human-compatible cooperative AI",
      "relationship_sentence": "CEC adopts the Hanabi-inspired emphasis on human-agent cooperation, but generalizes beyond a single task by creating broad procedural task families and validating with real human collaborators."
    },
    {
      "title": "Procgen Benchmark: Procedurally-Generated Game-Like Environments for Evaluating Reinforcement Learning",
      "authors": "Cobbe et al.",
      "year": 2020,
      "role": "Procedural generation for generalization in RL",
      "relationship_sentence": "CEC leverages the Procgen insight that procedural diversity combats overfitting, introducing JAX-based generators that produce billions of solvable coordination problems to induce transferable cooperative skills."
    },
    {
      "title": "Open-ended Learning Leads to Generally Capable Agents",
      "authors": "Puigdomènech Badia et al.",
      "year": 2021,
      "role": "Open-ended, multi-task training for transferable abilities",
      "relationship_sentence": "CEC adapts open-ended, multi-task training to the cooperative multi-agent setting, showing that broad task diversity yields general normative behaviors that enable zero-shot coordination with unseen partners."
    },
    {
      "title": "Ad Hoc Teamwork",
      "authors": "Stone et al.",
      "year": 2010,
      "role": "Foundational problem definition for teaming with unknown partners",
      "relationship_sentence": "CEC targets the ad hoc teamwork objective at scale, demonstrating that cross-environment training with a single partner can produce policies that coordinate effectively with many unknown partners."
    },
    {
      "title": "Learning with Opponent-Learning Awareness (LOLA)",
      "authors": "Foerster et al.",
      "year": 2018,
      "role": "Shaping learning dynamics for cooperation",
      "relationship_sentence": "CEC complements LOLA’s gradient-shaping perspective by showing that environmental diversity, rather than opponent-modeling or gradient shaping alone, can induce cooperative norms that generalize zero-shot."
    }
  ],
  "synthesis_narrative": "Cross-environment Cooperation (CEC) sits at the intersection of zero-shot coordination, ad hoc teamwork, and generalization via procedural diversity. The ZSC literature, crystallized by Other-Play and Fictitious Co-Play, defined the core goal and evaluation via cross-play: train agents that coordinate with independently trained partners. However, these techniques typically target a single game and rely on symmetry randomization or partner-belief modeling within that fixed setting. In parallel, the Hanabi challenge foregrounded human-compatible cooperation, highlighting the gap between self-play specialists and agents that collaborate well with unfamiliar teammates.\n\nFrom the RL generalization side, Procgen demonstrated that procedural task diversity curbs overfitting and yields transferable representations, while open-ended learning in XLand showed that multi-task curricula can produce broadly capable agents. The ad hoc teamwork paradigm provided the overarching objective—performing with unknown partners—emphasizing robustness to partner variation rather than joint overfitting. Earlier methods like LOLA illustrated how shaping learning dynamics can foster cooperation, yet did not directly address generalization to novel partners and tasks.\n\nCEC synthesizes these threads: it replaces single-task specialization with large-scale procedural diversity, but in a cooperative multi-agent regime explicitly aimed at ZSC. By training with a single partner across many solvable coordination challenges, CEC induces general norms that transfer to many new partners on many new problems, bridging the gap between ZSC algorithms and open-ended generalization, and validating benefits with real human collaborators.",
  "analysis_timestamp": "2026-01-07T00:04:09.136935"
}