{
  "prior_works": [
    {
      "title": "What Can We Learn Privately?",
      "authors": "Kartik H. Nissim, Kobbi Nissim, Sofya Raskhodnikova, Adam Smith, and others (commonly cited as Kasiviswanathan, Lee, Nissim, Raskhodnikova, Smith)",
      "year": 2011,
      "role": "Foundational model",
      "relationship_sentence": "Established the local (interaction with a local randomizer) model of differential privacy that the paper’s LDP setting relies on and frames the interactive vs noninteractive protocol landscape."
    },
    {
      "title": "Local, Private, Efficient Protocols for Succinct Histograms",
      "authors": "Raef Bassily and Adam Smith",
      "year": 2015,
      "role": "Baseline nonadaptive approach",
      "relationship_sentence": "Provided near-optimal LDP histogram estimation protocols that underpin standard nonadaptive quantile estimation via histograms, the baseline that incurs extra log B factors which the present adaptive algorithms improve upon."
    },
    {
      "title": "Minimax Optimal Procedures for Locally Private Estimation",
      "authors": "John C. Duchi, Michael I. Jordan, and Martin J. Wainwright",
      "year": 2018,
      "role": "Lower bounds and rates",
      "relationship_sentence": "Developed information-theoretic techniques and ε-LDP minimax rates (e.g., 1/(ε^2 α^2)) that guide the user/sample complexity targets and underpin the paper’s matching lower-bound methodology for adaptive protocols."
    },
    {
      "title": "Distributed Differential Privacy via Shuffling",
      "authors": "Alan T. Cheu, Adam Smith, Jonathan Ullman, and David Zeber",
      "year": 2019,
      "role": "Shuffle model introduction",
      "relationship_sentence": "Introduced the shuffle model and privacy amplification by shuffling for one-message protocols, providing the conceptual and technical basis for the paper’s shuffle-DP algorithm and its privacy accounting."
    },
    {
      "title": "The Privacy Blanket of the Shuffle Model",
      "authors": "Borja Balle, James Bell, Adrià Gascón, and Kobbi Nissim",
      "year": 2019,
      "role": "Tight amplification analysis",
      "relationship_sentence": "Gave tight analyses of privacy amplification by shuffling, tools directly used to obtain (ε, δ)-shuffle guarantees and to calibrate user complexity in the paper’s adaptive shuffle protocol."
    },
    {
      "title": "On the Power of Multiple Anonymous Messages: Frequency Estimation, Selection, and Median",
      "authors": "Badih Ghazi, Noah Golowich, Ravi Kumar, and Pasin Manurangsi",
      "year": 2021,
      "role": "Shuffle selection/median precedents",
      "relationship_sentence": "Studied selection and median in the shuffled model, offering algorithmic templates and bounds that the paper refines with lightweight adaptive protocols achieving improved user complexity."
    },
    {
      "title": "Noisy Binary Search and Its Applications",
      "authors": "Ravi Kannan Karp and Jon Kleinberg",
      "year": 2007,
      "role": "Adaptive search technique",
      "relationship_sentence": "Analyzed adaptive binary search under noisy comparisons, a methodological precursor to the paper’s adaptive thresholding strategy for quantile estimation that achieves O(log B) query depth despite noise."
    }
  ],
  "synthesis_narrative": "The paper’s core advance—adaptive, lightweight protocols for quantile estimation under local and shuffle differential privacy with improved user complexity—builds on three converging lines of prior work. First, the modeling and statistical foundations of LDP trace to Kasiviswanathan et al., which formalized local randomizers and the interactive/noninteractive landscape, and to Duchi–Jordan–Wainwright, whose minimax techniques and ε-LDP rates shape both target sample complexity (∼1/(ε^2α^2)) and the lower-bound toolkit needed to match the new upper bounds. Second, the practical nonadaptive baseline for quantiles arises from LDP histograms (Bassily–Smith), which estimate the entire distribution and then extract order statistics; this approach incurs extra log B factors, motivating a more targeted, query-efficient strategy. The paper’s key algorithmic idea—adaptive thresholding akin to a binary search over [B]—is methodologically foreshadowed by classic noisy binary search (Karp–Kleinberg), demonstrating how to navigate logarithmic-depth searches despite noise. Third, in the shuffle setting, the work leverages the privacy amplification framework inaugurated by Cheu et al. and made tight by Balle et al., enabling one-message protocols with central-like accuracy. Recent shuffle-model results on selection and median (Ghazi et al.) provide problem-specific precedents the paper sharpens by designing adaptive, single-query-per-user protocols with user complexity Õ((1/ε^2 + 1/α^2) log B). Together, these works directly inform the paper’s adaptive designs, yield principled privacy analyses in the shuffle model, and anchor the matching lower bounds that certify optimality up to logarithmic factors.",
  "analysis_timestamp": "2026-01-07T00:21:32.391489"
}