{
  "prior_works": [
    {
      "title": "Asymptotically Efficient Adaptive Allocation Rules",
      "authors": "T. L. Lai, H. Robbins",
      "year": 1985,
      "role": "Foundational lower bound and consistency theory",
      "relationship_sentence": "Provides the instance-dependent lower bounds and notion of consistency that the paper leverages to calibrate instance-dependent regret rates (β) and prove optimality of the proposed tail-decay trade-offs."
    },
    {
      "title": "Finite-Time Analysis of the Multiarmed Bandit Problem",
      "authors": "P. Auer, N. Cesa-Bianchi, P. Fischer",
      "year": 2002,
      "role": "Algorithmic and high-probability analysis baseline (UCB1)",
      "relationship_sentence": "Introduces UCB with finite-time and high-probability guarantees, supplying techniques and benchmarks for relating expected regret to tail probabilities that the paper refines into sharp tail-risk characterizations."
    },
    {
      "title": "Minimax Policies for Adversarial and Stochastic Bandits",
      "authors": "J.-Y. Audibert, S. Bubeck",
      "year": 2009,
      "role": "Worst-case optimality (MOSS) and trade-off tension",
      "relationship_sentence": "Establishes minimax-optimal worst-case regret via MOSS and highlights its tension with instance-dependent performance, directly motivating the paper’s explicit trade-off between worst-case optimality (α) and instance-dependent consistency (β)."
    },
    {
      "title": "UCB Revisited: Improved Regret Bounds for the Stochastic Multi-Armed Bandit Problem",
      "authors": "P. Auer, R. Ortner",
      "year": 2010,
      "role": "Sharper deviation control for regret",
      "relationship_sentence": "Develops tighter high-probability and refined finite-time analyses of UCB-type policies, informing the paper’s precise linkage between the order of expected regret and the decay rate of large-regret tail probabilities."
    },
    {
      "title": "The KL-UCB Algorithm for Bounded Stochastic Bandits and Beyond",
      "authors": "A. Garivier, O. Cappé",
      "year": 2011,
      "role": "KL-based confidence bounds and exponential tails",
      "relationship_sentence": "Introduces KL-UCB with Chernoff-style deviation control, a core technique the paper builds on to obtain exponential tail decay with only polynomial prefactors while meeting instance-dependent and worst-case targets."
    },
    {
      "title": "Optimally Confident UCB: Improved Regret for Finite-Armed Bandits",
      "authors": "T. Lattimore",
      "year": 2015,
      "role": "Balancing worst-case and instance-dependent performance",
      "relationship_sentence": "Shows how tuning confidence radii can simultaneously optimize worst-case and instance-dependent regret up to constants, a design principle the paper generalizes into a tunable (α, β) policy achieving tail-optimal guarantees."
    },
    {
      "title": "Stochastic Multi-Armed Bandit Problem with Nonstationary Rewards",
      "authors": "O. Besbes, Y. Gur, A. Zeevi",
      "year": 2014,
      "role": "Framework for non-stationary bandits",
      "relationship_sentence": "Provides the variation-budget framework and regret baselines for non-stationary rewards, which the paper extends by carrying its tail-risk characterization and trade-off policy to a non-stationary setting."
    }
  ],
  "synthesis_narrative": "The paper’s core contribution—characterizing the precise interplay between worst-case optimality, instance-dependent consistency, and light-tailed risk, and proposing a policy that achieves any target (α, β) while attaining optimal regret-tail decay—rests on three pillars from prior work. First, Lai and Robbins established the instance-dependent lower bounds and consistency paradigm that define what it means to be distribution-dependent optimal. Second, the UCB lineage (Auer et al.; Auer and Ortner) provided finite-time and high-probability analyses linking expected regret to deviation probabilities, setting methodological templates for controlling regret tails. Third, KL-based and carefully tuned confidence policies (Garivier and Cappé’s KL-UCB; Lattimore’s OCUCB) demonstrated how sharper, information-theoretic confidence radii yield exponential-type deviations and can simultaneously balance worst-case and instance-dependent performance.\n\nAudibert and Bubeck’s MOSS clarified the minimax frontier and exposed tension with instance-dependent optimality, directly motivating a calibrated trade-off rather than a single operating point. Building on these insights, the paper formalizes how the order of expected regret dictates achievable tail decay and designs a policy whose confidence structure interpolates between minimax and instance-dependent regimes while preserving exponential tail behavior with only polynomial prefactors—proving this rate is unimprovable. Finally, the non-stationary extension leverages the Besbes–Gur–Zeevi framework to transplant these guarantees beyond the stationary setting, showing that the proposed tail-optimal trade-offs persist under controlled reward drift.",
  "analysis_timestamp": "2026-01-06T23:42:49.086095"
}