{
  "prior_works": [
    {
      "title": "Score-Based Generative Modeling through Stochastic Differential Equations",
      "authors": "Yang Song, Jascha Sohl-Dickstein, Diederik P. Kingma, Abhishek Kumar, Stefano Ermon, Ben Poole",
      "year": 2021,
      "role": "Foundational framework for score-based generative models via reverse-time SDEs",
      "relationship_sentence": "LIM directly generalizes Song et al.’s reverse-time SDE framework from Brownian motion to α-stable Lévy drivers and inherits the training/sampling paradigm built around scores of progressively noised data."
    },
    {
      "title": "Deep Unsupervised Learning using Nonequilibrium Thermodynamics",
      "authors": "Jascha Sohl-Dickstein, Eric A. Weiss, Niru Maheswaranathan, Surya Ganguli",
      "year": 2015,
      "role": "Conceptual precursor of diffusion probabilistic modeling and time-reversal",
      "relationship_sentence": "The LIM setup retains the diffusion-model idea of forward noising and reverse-time generative dynamics, while replacing Gaussian diffusion with Lévy processes to address limitations of light-tailed noise."
    },
    {
      "title": "Denoising Score Matching with Gaussian Noise",
      "authors": "Pascal Vincent",
      "year": 2011,
      "role": "Training objective linking denoising to score estimation",
      "relationship_sentence": "LIM extends Vincent’s denoising score matching to heavy-tailed α-stable corruptions, yielding a fractional denoising score matching objective suited to Lévy-driven dynamics."
    },
    {
      "title": "Estimation of Non-Normalized Statistical Models by Score Matching",
      "authors": "Aapo Hyvärinen",
      "year": 2005,
      "role": "Core score matching principle for unnormalized models",
      "relationship_sentence": "The base score-matching framework is adapted in LIM to accommodate non-Gaussian α-stable noise through fractional operators, enabling consistent estimation of scores under Lévy perturbations."
    },
    {
      "title": "Reverse-Time Diffusion Equation Models",
      "authors": "Brian D. O. Anderson",
      "year": 1982,
      "role": "Foundation for reverse-time constructions of stochastic processes",
      "relationship_sentence": "LIM’s exact reverse-time SDE for Lévy-driven forward dynamics builds on the reverse-time theory originating with Anderson, extending it beyond continuous-path diffusions to jump processes."
    },
    {
      "title": "Lévy Processes and Stochastic Calculus",
      "authors": "David Applebaum",
      "year": 2009,
      "role": "Mathematical toolbox for Lévy-Itô decomposition and generators",
      "relationship_sentence": "Applebaum’s calculus underpins LIM’s use of the Lévy–Itô decomposition and the generator (fractional Laplacian) structure needed to define and analyze α-stable Lévy SDEs and their reverse dynamics."
    },
    {
      "title": "Stable Non-Gaussian Random Processes: Stochastic Models with Infinite Variance",
      "authors": "Gennady Samorodnitsky, Murad S. Taqqu",
      "year": 1994,
      "role": "Foundational theory of α-stable processes and heavy tails",
      "relationship_sentence": "LIM’s choice of isotropic α-stable Lévy drivers and the exploitation of heavy-tailed jump behavior for faster, more diverse sampling are grounded in the properties synthesized in this monograph."
    }
  ],
  "synthesis_narrative": "LIM stands at the intersection of score-based generative modeling and Lévy-process theory. Its sampling and training pipelines directly inherit from score-based diffusion models: Sohl-Dickstein et al. introduced the forward noising/reverse denoising paradigm, while Song et al. unified this paradigm with reverse-time SDEs and noise-conditioned score estimation. On the objective side, Hyvärinen’s score matching and Vincent’s denoising score matching constitute the estimation backbone that LIM generalizes to non-Gaussian, heavy-tailed corruptions, leading to a fractional denoising score matching objective aligned with the generator of α-stable semigroups.\n\nThe theoretical leap in LIM is to replace Brownian motion with isotropic α-stable Lévy processes. This requires moving from continuous-path diffusions to jump processes: Anderson’s reverse-time construction provides the conceptual and technical basis for deriving exact reverse dynamics, which LIM adapts to Lévy-driven SDEs. The necessary stochastic calculus, Lévy–Itô decomposition, and generator characterization via the fractional Laplacian come from Applebaum’s treatment of Lévy SDEs, while Samorodnitsky and Taqqu supply the heavy-tailed, infinite-variance properties that motivate Lévy noise for faster exploration and mode coverage.\n\nBy synthesizing these strands, LIM formalizes a reverse-time SDE under α-stable drivers and a matching training criterion that respects the fractional generator, thereby achieving faster sampling (lower NFE) and improved diversity relative to Gaussian diffusion while maintaining high fidelity.",
  "analysis_timestamp": "2026-01-06T23:42:49.098203"
}