{
  "prior_works": [
    {
      "title": "A multiple testing procedure for clinical trials",
      "authors": [
        "Peter C. O’Brien",
        "Thomas R. Fleming"
      ],
      "year": 1979,
      "role": "Foundational group-sequential stopping boundaries",
      "relationship_sentence": "CLASH’s early-stopping module builds on classical group-sequential ideas such as O’Brien–Fleming boundaries to control Type I error while allowing repeated interim looks; the paper extends this paradigm from aggregate to subgroup-targeted harm detection."
    },
    {
      "title": "Discrete sequential boundaries for clinical trials",
      "authors": [
        "K. K. G. Lan",
        "David L. DeMets"
      ],
      "year": 1983,
      "role": "Alpha-spending framework for flexible interim monitoring",
      "relationship_sentence": "The alpha-spending principle underlies CLASH’s ability to monitor adaptively over time without inflating false positives, enabling the method to incorporate multiple checks for harm in learned subgroups."
    },
    {
      "title": "Always valid inference: Bringing sequential analysis to A/B testing",
      "authors": [
        "Ramesh Johari",
        "Leo Pekelis",
        "David J. Walsh"
      ],
      "year": 2017,
      "role": "Anytime-valid sequential inference for online experiments",
      "relationship_sentence": "CLASH targets both clinical trials and A/B tests; its sequential validity and practical monitoring design draw directly from anytime-valid testing ideas introduced for online experimentation."
    },
    {
      "title": "Estimation and inference of heterogeneous treatment effects using random forests",
      "authors": [
        "Stefan Wager",
        "Susan Athey"
      ],
      "year": 2018,
      "role": "Causal forests and asymptotically valid CATE inference",
      "relationship_sentence": "CLASH relies on causal machine learning to detect harmed subpopulations; causal forests provide a principled, honest approach to estimate CATEs with inference, forming a core plug-in learner for subgroup harm identification."
    },
    {
      "title": "Recursive partitioning for heterogeneous causal effects",
      "authors": [
        "Susan Athey",
        "Guido W. Imbens"
      ],
      "year": 2016,
      "role": "Causal trees for interpretable subgroup discovery",
      "relationship_sentence": "The causal tree framework motivates CLASH’s strategy of learning data-driven subgroups with treatment effect heterogeneity while maintaining separation between discovery and estimation to curb bias."
    },
    {
      "title": "Metalearners for estimating heterogeneous treatment effects using machine learning",
      "authors": [
        "Sören R. Künzel",
        "Jasjeet S. Sekhon",
        "Peter J. Bickel",
        "Bin Yu"
      ],
      "year": 2019,
      "role": "General meta-learning recipes (X/T/S-learners) for CATE",
      "relationship_sentence": "CLASH is intentionally broadly applicable; meta-learner templates inform its plug-in design, allowing a variety of base learners to estimate subgroup-level harm robustly across settings."
    },
    {
      "title": "Double/debiased machine learning for treatment and structural parameters",
      "authors": [
        "Victor Chernozhukov",
        "Denis Chetverikov",
        "Mert Demirer",
        "Esther Duflo",
        "Christian Hansen",
        "Whitney K. Newey"
      ],
      "year": 2018,
      "role": "Orthogonalization and cross-fitting for valid ML-based inference",
      "relationship_sentence": "To ensure valid inference when using flexible learners for heterogeneity, CLASH adopts the DML principle (orthogonal scores and cross-fitting), decoupling nuisance learning from the target and enabling reliable stopping rules."
    }
  ],
  "synthesis_narrative": "CLASH’s core contribution—early stopping for harm that is sensitive to treatment effect heterogeneity—arises by fusing two mature literatures: sequential monitoring from clinical trials/online testing and causal machine learning for heterogeneous treatment effects (HTE). On the monitoring side, the O’Brien–Fleming boundaries and the Lan–DeMets alpha‑spending framework establish how to control Type I error across repeated interim looks; Johari–Pekelis–Walsh adapt these ideas to anytime‑valid inference in A/B testing. CLASH inherits this sequential validity but redirects it from aggregate effects to subgroup‑specific harm, the locus where conventional procedures can miss minority harms.\nOn the HTE side, causal forests (Wager & Athey) and causal trees (Athey & Imbens) provide honest, data‑adaptive subgroup discovery and asymptotically valid CATE estimation. Meta‑learners (Künzel et al.) generalize this into a modular plug‑in architecture, allowing CLASH to be broadly applicable across learners and outcomes. Because adaptive subgroup learning can bias inference, CLASH leverages orthogonalization and cross‑fitting from double/debiased machine learning (Chernozhukov et al.) to preserve valid uncertainty quantification when combining flexible learners with sequential testing. Together, these components yield a principled procedure that repeatedly learns who is at risk, monitors those groups with proper spending of statistical error, and stops promptly when harm manifests—even if confined to a minority subgroup—thereby closing a gap left by aggregate early‑stopping methods in both clinical trials and online experiments.",
  "analysis_timestamp": "2026-01-07T00:02:04.826821"
}