{
  "prior_works": [
    {
      "title": "How Powerful are Graph Neural Networks?",
      "authors": "Keyulu Xu, Weihua Hu, Jure Leskovec, Stefanie Jegelka",
      "year": 2019,
      "role": "Expressivity baseline for MP-GNNs via the 1-WL test",
      "relationship_sentence": "This paper formalized the representational limits of message-passing GNNs through their equivalence to 1-WL, motivating the search for complementary invariants; the present work positions persistent homology as such a complement and gives a WL-analogous, complete characterization of what PH can (and cannot) distinguish on attributed graphs."
    },
    {
      "title": "Stability of persistence diagrams",
      "authors": "David Cohen-Steiner, Herbert Edelsbrunner, John Harer",
      "year": 2007,
      "role": "Foundational theory for PH under filter functions",
      "relationship_sentence": "Their stability and sublevel-set framework underpins analyzing PH induced by functions on vertices/edges; the new ‘color-separating sets’ and necessary/sufficient distinguishability conditions rely on this formal treatment of filtrations and 0D persistence."
    },
    {
      "title": "Computational Topology: An Introduction",
      "authors": "Herbert Edelsbrunner, John L. Harer",
      "year": 2010,
      "role": "Canonical definitions of persistent homology and 0D persistence",
      "relationship_sentence": "Provides the standard constructions (e.g., 0-dimensional PH capturing connected components over filtrations and clique/flag complexes on graphs) that the paper leverages to rigorously compare vertex- and edge-induced PH and to prove their incomparability."
    },
    {
      "title": "Persistent homology of complex networks",
      "authors": "Danijela Horak, Sasa Maletić, Milan Rajković",
      "year": 2009,
      "role": "Early application of PH to graphs and filtrations",
      "relationship_sentence": "By demonstrating how different graph filtrations (e.g., edge-weight thresholding, clique complexes) yield distinct topological signatures, this work set the stage for the present paper’s formal separation of vertex- vs edge-level PH and the proof that neither subsumes the other."
    },
    {
      "title": "A Stable Multi-Scale Kernel for Topological Machine Learning",
      "authors": "Jan Reininghaus, Stefan Huber, Ulrich Bauer, Roland Kwitt",
      "year": 2015,
      "role": "Turning persistence diagrams into trainable, stable features",
      "relationship_sentence": "Kernelization of persistence diagrams provided a principled path to learning with PH features; RePHINE builds on this paradigm by constructing learnable graph representations that jointly exploit vertex- and edge-level PH in a unified, more powerful scheme."
    },
    {
      "title": "Sliced Wasserstein kernel for persistence diagrams",
      "authors": "Mathieu Carrière, Marco Cuturi, Steve Oudot",
      "year": 2017,
      "role": "Scalable similarity measures for persistence diagrams",
      "relationship_sentence": "Introduced efficient, stable metrics/kernels on PDs, enabling practical end-to-end learning with topological summaries; the new method leverages such advances to combine multiple PH channels (vertex and edge) into a learnable, discriminative representation."
    },
    {
      "title": "Clique topology reveals intrinsic geometric structure in neural correlations",
      "authors": "Chad Giusti, Eva Pastalkova, Carina Curto, Vladimir Itskov",
      "year": 2015,
      "role": "Graph-to-complex constructions and edge-based filtrations in practice",
      "relationship_sentence": "Showed how edge-weight filtrations via clique/flag complexes expose structure on graphs, highlighting that filtration choice dictates the captured invariants—an observation that directly motivates the paper’s theory of color-separating sets and its edge–vertex PH integration."
    }
  ],
  "synthesis_narrative": "The paper addresses a core gap between the well-understood expressivity of message-passing GNNs and the comparatively opaque discriminative scope of persistent homology when applied to attributed graphs. Xu et al. (2019) establish the 1-WL ceiling for MP-GNNs, motivating the need for complementary invariants. Foundational PH theory by Cohen-Steiner, Edelsbrunner, and Harer (2007), together with the Edelsbrunner–Harer monograph (2010), provides the precise sublevel-set filtration framework and 0D persistence machinery needed to analyze distinguishability induced by filter functions on vertices and edges. Early graph-focused PH studies, notably Horak et al. (2009) and Giusti et al. (2015), demonstrated that different graph filtrations (edge-thresholding, clique/flag complexes, vertex functions) capture distinct structures, foreshadowing the present work’s key insight: vertex-level and edge-level PH are fundamentally incomparable.\nBuilding on these theoretical pillars, the learning component of the paper (RePHINE) connects to the maturation of PH in machine learning. Stable, differentiable surrogates for persistence diagrams—via multi-scale kernels (Reininghaus et al., 2015) and Wasserstein-based kernels (Carrière, Cuturi, Oudot, 2017)—made PH-based features practical and trainable. The present work uses its new concept of color-separating sets to deliver necessary and sufficient conditions for PH-based graph distinguishability, explicitly proving the limits of vertex- and edge-level PH and showing neither subsumes the other. Leveraging these insights, RePHINE efficiently combines both PH channels into a provably stronger, learnable representation, thereby extending PH’s role from an ad hoc augmentation to a theoretically grounded, synergistic complement to WL-bounded MP-GNNs.",
  "analysis_timestamp": "2026-01-06T23:42:49.078975"
}