{
  "prior_works": [
    {
      "title": "Online k-Clustering with Moving Costs",
      "authors": "Dimitris Fotakis et al.",
      "year": 2021,
      "role": "Immediate baseline",
      "relationship_sentence": "Established the first O(k)-regret guarantee focusing only on the connection cost, defining the online k-clustering-with-movement model that the NeurIPS 2023 paper strengthens to O(log n)-regret on total (connection + movement) cost."
    },
    {
      "title": "Metrical Task Systems on Trees via Mirror Descent",
      "authors": "Sébastien Bubeck, Michael B. Cohen, James R. Lee, Yin Tat Lee",
      "year": 2018,
      "role": "Technical framework",
      "relationship_sentence": "Introduced entropic mirror-descent–based algorithms for service-plus-movement objectives on tree metrics with O(log n)-type guarantees, providing the movement-cost control paradigm that the paper adapts to k-clustering objectives."
    },
    {
      "title": "A tight bound on approximating arbitrary metrics by tree metrics",
      "authors": "Jittat Fakcharoenphol, Satish Rao, Kunal Talwar",
      "year": 2004,
      "role": "Embedding tool",
      "relationship_sentence": "Provides the FRT HST embedding with O(log n) distortion, a standard reduction that enables lifting tree-based movement-cost algorithms to general metrics—crucial for achieving O(log n) factors in the paper’s regret bounds."
    },
    {
      "title": "Facility Location in Evolving Metrics (Dynamic Facility Location)",
      "authors": "David Eisenstat, Claire Mathieu, Nicolas Schabanel",
      "year": 2014,
      "role": "Modeling and LP-relaxation precedent",
      "relationship_sentence": "Formalized facility movement costs across time and developed LP/rounding techniques to balance movement and connection costs, informing how to couple the two costs in analysis for dynamic clustering settings."
    },
    {
      "title": "Online Facility Location",
      "authors": "Adam Meyerson",
      "year": 2001,
      "role": "Online primal–dual template",
      "relationship_sentence": "Pioneered online facility-location techniques to control connection costs via primal–dual ideas, a template that influences how online clustering algorithms reason about service cost under adversarial arrivals."
    },
    {
      "title": "Local search heuristics for k-median and facility location",
      "authors": "Vineet Arya, Naveen Garg, Rajiv Khandekar, Adam Meyerson, Kamesh Munagala, Vinayaka Pandit",
      "year": 2004,
      "role": "Structural properties of k-median",
      "relationship_sentence": "Provides foundational structural insights for k-median (e.g., exchange and triangle-inequality–based analyses) used to relate online decisions to the best fixed set of centers in regret comparisons."
    }
  ],
  "synthesis_narrative": "The NeurIPS 2023 paper’s core advance—an O(log n)-regret, polynomial-time algorithm that controls both connection and movement costs for online k-clustering—sits at the intersection of dynamic facility models and movement-aware online optimization. Its most direct precursor is Fotakis et al. (2021), which introduced the same online clustering-with-movement framework but only achieved O(k)-regret on the connection cost; the new work closes this gap by jointly controlling movement and service and improving the factor to O(log n). The technical route follows the movement-cost paradigm from metrical task systems on trees (Bubeck–Cohen–Lee–Lee), where entropic mirror-descent potentials balance service and movement. To extend guarantees beyond trees, the paper leverages FRT embeddings, whose O(log n) distortion naturally explains the appearance of the logarithmic factor in the regret bound when moving from HSTs to general metrics. On the modeling and coupling of costs over time, dynamic facility-location work (Eisenstat–Mathieu–Schabanel) provides a canonical way to account for facility movement and its interplay with assignment costs, guiding both problem formulation and analysis. Finally, classical online facility location (Meyerson) and structural results for k-median via local search (Arya et al.) supply the service-cost control and exchange/triangle-inequality tools needed to compare online decisions to the best fixed centers. Together, these threads yield a polynomial-time algorithm that upgrades prior guarantees to an O(log n) bound on total cost.",
  "analysis_timestamp": "2026-01-06T23:42:48.041571"
}