{
  "prior_works": [
    {
      "title": "Why Should I Trust You? Explaining the Predictions of Any Classifier",
      "authors": "Marco Tulio Ribeiro, Sameer Singh, Carlos Guestrin",
      "year": 2016,
      "role": "Foundational baseline",
      "relationship_sentence": "GLIME directly extends LIME’s surrogate-weighted linear explanation framework, diagnosing its instability and low local fidelity as consequences of LIME’s sampling and weighting choices and proposing principled fixes."
    },
    {
      "title": "DLIME: Deterministic Local Interpretable Model-Agnostic Explanations",
      "authors": "M. Zafar, A. Khan, et al.",
      "year": 2019,
      "role": "Identified limitation and variant",
      "relationship_sentence": "DLIME exposed LIME’s sensitivity to randomness and proposed deterministic neighborhood construction; GLIME explains the root cause (tiny sample weights and non-local sampling) and achieves stability without hard clustering, subsuming DLIME as a special neighborhood choice."
    },
    {
      "title": "ALIME: Auto/Active Learning for Local Interpretable Model-Agnostic Explanations",
      "authors": "Naren Shankaranarayana, Ognjen Runje",
      "year": 2019,
      "role": "Identified limitation and sampling improvement",
      "relationship_sentence": "ALIME mitigated LIME instability via active sampling of informative perturbations; GLIME formalizes locality and reweighting so that active or adaptive sampling becomes a principled instance within its unified, stable framework."
    },
    {
      "title": "On the locality of explanation methods for black-box decision systems",
      "authors": "Lucie Laugel, Xavier Renard, Marie-Jeanne Lesot, Christophe Marsala, Marcin Detyniecki",
      "year": 2018,
      "role": "Theoretical critique of locality",
      "relationship_sentence": "Laugel et al. showed LIME’s neighborhood can be non-local and biased toward the reference point; GLIME directly addresses this by enforcing genuinely local, less biased sampling and weights to improve local fidelity."
    },
    {
      "title": "A Unified Approach to Interpreting Model Predictions (SHAP)",
      "authors": "Scott M. Lundberg, Su-In Lee",
      "year": 2017,
      "role": "Weighted regression perspective and unification target",
      "relationship_sentence": "KernelSHAP’s weighted linear regression view informed GLIME’s analysis of weight magnitudes and kernels; GLIME designs stable weighting that avoids tiny effective weights and positions LIME/SHAP-like methods within a single generalized framework."
    },
    {
      "title": "Model Agnostic Supervised Local Explanations (MAPLE)",
      "authors": "Gregory Plumb, Denali Molitor, Ameet Talwalkar",
      "year": 2018,
      "role": "Alternative local surrogate emphasizing data-driven neighborhoods",
      "relationship_sentence": "MAPLE highlighted the importance of data-dependent locality and robust local surrogates; GLIME incorporates this insight by constructing truly local neighborhoods and stable weighting, improving fidelity while keeping LIME’s generality."
    }
  ],
  "synthesis_narrative": "GLIME’s core contribution—a general, stable, and truly local surrogate explanation—emerges from a precise diagnosis of where LIME fails and a unification of influential strands in local explainability. Ribeiro et al. (2016) introduced LIME’s weighted local linear surrogate idea but left open problems of instability and poor locality. Follow-on variants such as DLIME and ALIME pinpointed instability due to stochastic sampling and attempted fixes via deterministic or active neighborhood selection. GLIME builds on these observations but advances them by identifying the root mechanism: LIME’s kernel often yields very small sample weights, causing regularization to dominate and optimization to converge slowly, amplifying randomness. Concurrently, theoretical critiques by Laugel et al. demonstrated that LIME’s neighborhood can be non-local and biased toward the reference, undermining local fidelity. GLIME explicitly redesigns sampling and reweighting to enforce genuine locality and reduce bias.\nInsights from KernelSHAP and MAPLE further shape GLIME’s framework. KernelSHAP frames explanations as weighted linear regression with a specific kernel, motivating GLIME’s analysis of weight magnitudes and kernel choice to avoid pathological tiny weights. MAPLE underscores the value of data-driven, locally faithful neighborhoods. GLIME synthesizes these lines by proposing a generalized, principled neighborhood and weighting scheme that stabilizes the surrogate fit, improves local fidelity, and unifies LIME-style and SHAP-style explanations as special cases within one coherent methodology.",
  "analysis_timestamp": "2026-01-06T23:33:35.591510"
}