{
  "prior_works": [
    {
      "title": "Spectrum-Dependent Learning Curves in Kernel Regression",
      "authors": "Blake Bordelon, Abdulkadir Canatar, Cengiz Pehlevan",
      "year": 2020,
      "role": "Core theoretical framework relating generalization error to kernel eigenspectra and target alignment",
      "relationship_sentence": "This work provides the precise eigenmode-based learning-curve decomposition that the paper adapts to the neural-prediction setting, enabling error to be expressed in terms of model spectra, target alignment, and sample size."
    },
    {
      "title": "Spectral bias and task-model alignment explain generalization in neural networks",
      "authors": "Abdulkadir Canatar, Blake Bordelon, Cengiz Pehlevan",
      "year": 2021,
      "role": "Extension of spectral learning-curve theory to deep networks and definition of task–model alignment",
      "relationship_sentence": "The paper’s geometric alignment measures and interpretation of neural prediction error directly build on this task–model alignment framework, importing its spectral bias perspective to the model–brain regression context."
    },
    {
      "title": "Exact solutions to the nonlinear dynamics of learning in deep linear neural networks",
      "authors": "Andrew M. Saxe, James L. McClelland, Surya Ganguli",
      "year": 2014,
      "role": "Foundational mode-wise (SVD/eigen) analysis of learning dynamics and alignment",
      "relationship_sentence": "The paper’s decomposition of prediction into contributions of spectral modes echoes Saxe et al.’s insight that learning proceeds along principal modes, motivating an eigenvector-alignment view of representational prediction."
    },
    {
      "title": "Performance-optimized hierarchical models predict neural responses in higher visual cortex",
      "authors": "James J. DiCarlo, Daniel L. K. Yamins, Ha Hong, Ethan N. Fineberg et al.",
      "year": 2014,
      "role": "Established linear regression from model features to neural responses as a benchmark for neural predictivity",
      "relationship_sentence": "The present paper analyzes exactly this encoding-model setup, aiming to differentiate among high-performing models by decomposing regression error via spectral properties."
    },
    {
      "title": "Brain-Score: Which Artificial Neural Network for Object Recognition is most Brain-Like?",
      "authors": "Jonas Schrimpf, James J. DiCarlo, Rishi Rajalingham, et al.",
      "year": 2020,
      "role": "Benchmarking framework highlighting ties among many models on neural predictivity",
      "relationship_sentence": "The motivation to distinguish among models with similar neural prediction performance is directly aligned with Brain-Score’s observation of near-ties, prompting this paper’s spectral criteria for differentiation."
    },
    {
      "title": "Similarity of Neural Network Representations Revisited",
      "authors": "Simon Kornblith, Mohammad Norouzi, Honglak Lee, Geoffrey Hinton",
      "year": 2019,
      "role": "Introduced robust alignment/similarity metrics (CKA) for comparing representational subspaces",
      "relationship_sentence": "Their representation alignment perspective inspires the paper’s geometry-based measures, while the new work grounds alignment in predictive error via spectral decompositions rather than purely similarity indices."
    },
    {
      "title": "Encoding and decoding in fMRI",
      "authors": "Thomas Naselaris, Kendrick N. Kay, Shinji Nishimoto, Jack L. Gallant",
      "year": 2011,
      "role": "Canonical framework for encoding models using regression from features to neural responses",
      "relationship_sentence": "The paper directly extends the encoding-model paradigm by providing a spectral theory for its generalization error, connecting feature eigenspectra and target alignment to neural prediction accuracy."
    }
  ],
  "synthesis_narrative": "The paper’s central contribution is to bring a modern spectral learning-curve theory of regression to the long-standing problem of predicting biological neural responses from deep network activations, and to use this to parse prediction error into interpretable geometric factors. This builds most directly on recent kernel/regression theory by Bordelon, Canatar, and Pehlevan, which shows that generalization is governed by the kernel (or feature) eigenspectrum and the target’s projection onto corresponding eigenfunctions. Their follow-up on spectral bias and task–model alignment extends these ideas to deep networks, providing the precise alignment constructs and intuition the present work repurposes for neural prediction.\n\nConceptually, Saxe, McClelland, and Ganguli’s mode-wise analysis of learning dynamics in deep linear networks underpins the idea that learning and error decompose along spectral modes, motivating an eigenvector-alignment view. On the neuroscience side, the encoding-model tradition (Naselaris et al.) and performance-optimized model-to-brain prediction (Yamins/DiCarlo) established linear regression from model features to neural responses as the standard evaluation; the new paper retains this setup but explains its generalization behavior spectrally. Brain-Score’s observation that many modern models achieve similar neural predictivity provides the practical motivation to look beyond aggregate scores, while representation similarity work such as CKA (Kornblith et al.) demonstrates the utility of geometric alignment measures across models. Integrating these threads, the paper formalizes how a model’s eigenspectrum, its eigenvector alignment with neural targets, and dataset size jointly determine neural prediction error, yielding principled geometric diagnostics to distinguish models that otherwise tie on standard neural metrics.",
  "analysis_timestamp": "2026-01-07T00:02:04.815790"
}