{
  "prior_works": [
    {
      "title": "A Linear Non-Gaussian Acyclic Model for Causal Discovery (LiNGAM)",
      "authors": "Shohei Shimizu; Patrik O. Hoyer; Aapo Hyvärinen; Antti Kerminen; Markus Jordan",
      "year": 2006,
      "role": "Non-Gaussian identification principle in linear SCMs",
      "relationship_sentence": "The paper’s key identification step—exploiting non-Gaussianity of a latent confounder via cross-moments—directly builds on the LiNGAM insight that non-Gaussian disturbances enable point identification in linear structural models."
    },
    {
      "title": "Identifying confounded causal effects using proxy variables",
      "authors": "Wei Miao; Zhi Geng; Eric J. Tchetgen Tchetgen",
      "year": 2018,
      "role": "Proxy-variable identification baseline (two proxies/negative controls)",
      "relationship_sentence": "This work formalizes identification with proxy variables (often requiring two conditionally independent proxies), which the NeurIPS paper extends by showing identification with a single proxy under non-Gaussianity using cross-moments."
    },
    {
      "title": "Measurement bias and effect restoration in causal inference using surrogate variables",
      "authors": "Manabu Kuroki; Judea Pearl",
      "year": 2014,
      "role": "Effect restoration using proxy/surrogate variables",
      "relationship_sentence": "Kuroki and Pearl’s surrogate-based restoration results are a direct antecedent to the paper’s aim of recovering causal effects in the presence of unmeasured confounding, with the new contribution being single-proxy identification via higher-order moments."
    },
    {
      "title": "Negative Controls: A Tool for Detecting Confounding and Bias in Observational Studies",
      "authors": "Marc Lipsitch; Eric J. Tchetgen Tchetgen; Ted Cohen",
      "year": 2010,
      "role": "Negative control framework",
      "relationship_sentence": "The negative control paradigm (typically leveraging two proxies) motivates the proxy design the authors compare against, while their method shows that non-Gaussian cross-moments can supplant the need for a second negative control."
    },
    {
      "title": "Using Heteroscedasticity to Identify and Estimate Mismeasured and Endogenous Regressor Models",
      "authors": "Arthur Lewbel",
      "year": 2012,
      "role": "Method-of-moments identification without external instruments",
      "relationship_sentence": "Lewbel’s construction of identification from higher-order/cross-moment restrictions informs the paper’s strategy of using cross-moments of treatment, outcome, and a proxy to break endogeneity from latent confounding."
    },
    {
      "title": "Semiparametric Difference-in-Differences Estimators",
      "authors": "Alberto Abadie",
      "year": 2005,
      "role": "Difference-in-differences benchmark and identifying assumptions",
      "relationship_sentence": "By clarifying DiD identification via parallel trends, this work provides the benchmark the authors critique—showing DiD is unbiased only under a special equality-of-effects condition that their cross-moment method relaxes."
    },
    {
      "title": "Identifiability of a Linear Relation Between Variables",
      "authors": "Olav Reiersøl",
      "year": 1950,
      "role": "Non-Gaussian errors-in-variables identifiability",
      "relationship_sentence": "Reiersøl’s classic result that non-normality can identify linear models with measurement error underpins the paper’s use of non-Gaussianity to achieve identification with only a single proxy."
    }
  ],
  "synthesis_narrative": "The paper’s core innovation—identifying the causal effect in a linear SCM with a single proxy by exploiting cross-moments under non-Gaussian latent confounding—sits at the intersection of proxy-variable identification and non-Gaussian causal discovery. On the proxy side, Miao–Geng–Tchetgen Tchetgen and Kuroki–Pearl formalized how auxiliary variables (negative controls/surrogates) can restore identifiability, but typically require two proxies with conditional independence or bridge conditions. This NeurIPS paper directly advances that line by showing that, when the latent confounder is non-Gaussian, cross-moments of treatment, outcome, and a single proxy suffice for identification.\nNon-Gaussianity as an identification lever traces to LiNGAM and, more fundamentally, Reiersøl’s identifiability results for errors-in-variables with non-normal disturbances. These works justify the paper’s reliance on higher-order moments and the idea that Gaussianity is a knife-edge case where such moment-based identification fails. Methodologically, the approach aligns with Lewbel’s heteroskedasticity-based identification: both exploit higher-order/cross-moment structure to overcome endogeneity without external instruments. Finally, the paper positions itself against Difference-in-Differences, whose semiparametric foundations (Abadie) elucidate the parallel-trends/equal-effect requirement; the authors show DiD emerges as a special unbiased case, whereas their cross-moment estimator remains valid more broadly under non-Gaussian confounding. Together, these threads crystallize into a single-proxy, cross-moment identification strategy that generalizes negative control ideas beyond their traditional two-proxy requirements.",
  "analysis_timestamp": "2026-01-07T00:02:04.818676"
}