{
  "prior_works": [
    {
      "title": "Learn then Test: Calibrating Predictive Uncertainties by Controlling Risks",
      "authors": "Anastasios N. Angelopoulos, Stephen Bates, Jitendra Malik, Michael I. Jordan",
      "year": 2021,
      "role": "Methodological foundation for distribution-free risk control via holdout calibration",
      "relationship_sentence": "Deng et al. adopt and extend the LTT paradigm—searching over model/threshold choices and using a held-out set to certify a target risk—to certify constraints not just on expected loss or miscoverage, but on dispersion functionals of the entire loss distribution."
    },
    {
      "title": "Conformal Risk Control",
      "authors": "Anastasios N. Angelopoulos, Stephen Bates, Emmanuel Candès, Michael I. Jordan, Tijana Zrnic",
      "year": 2023,
      "role": "General framework for finite-sample, distribution-free control of user-specified risk metrics",
      "relationship_sentence": "The proposed dispersion-control framework builds directly on the CRC idea of distribution-free post-hoc auditing and threshold selection, generalizing the class of controllable objectives from event-based risks to dispersion measures that depend on the full loss CDF."
    },
    {
      "title": "Distribution-Free Predictive Inference for Regression",
      "authors": "Jing Lei, Max G'Sell, Alessandro Rinaldo, Ryan J. Tibshirani, Larry Wasserman",
      "year": 2018,
      "role": "Foundational split conformal methodology enabling finite-sample guarantees under exchangeability",
      "relationship_sentence": "The paper inherits the split-calibration blueprint of conformal prediction—fit on one split, certify on another—and repurposes it to certify bounds on loss-dispersion functionals rather than on coverage alone."
    },
    {
      "title": "Dvoretzky–Kiefer–Wolfowitz Inequality (with Massart’s sharp constant)",
      "authors": "Aryeh Dvoretzky, Jack Kiefer, Jacob Wolfowitz; Pascal Massart",
      "year": 1956,
      "role": "Statistical tool for uniform, distribution-free control of empirical CDF deviations",
      "relationship_sentence": "A key technical ingredient is uniform control of the empirical loss CDF; the authors leverage DKW to translate empirical dispersion estimates into finite-sample, distribution-free guarantees on the true dispersion."
    },
    {
      "title": "Fairness Without Demographics in Repeated Loss Minimization",
      "authors": "Tatsunori B. Hashimoto, Megha Srivastava, Hongseok Namkoong, Percy Liang",
      "year": 2018,
      "role": "Motivational and conceptual link between tail/dispersion of losses and societal disparities",
      "relationship_sentence": "By showing that controlling heavy-tail/worst-case losses can mitigate group disparities, this work motivates Deng et al.’s focus on directly constraining dispersion of individual losses with formal guarantees."
    },
    {
      "title": "Optimization of Conditional Value-at-Risk",
      "authors": "R. Tyrrell Rockafellar, Stanislav Uryasev",
      "year": 2000,
      "role": "Definition and optimization of CVaR as a canonical tail/dispersion risk measure",
      "relationship_sentence": "CVaR is a prototypical dispersion/tail functional that the new framework can control distribution-free; this paper provides the risk-measure formalism that underlies several objectives considered."
    }
  ],
  "synthesis_narrative": "Deng et al. extend the recent line of distribution-free risk control beyond expectations and coverage to dispersion measures of loss, which are central to societal concerns about unequal error burdens. The methodological backbone is the learn-then-test (LTT) and conformal risk control paradigm: train a flexible predictor, then use a held-out calibration set to certify that a user-specified risk stays below a target with finite-sample validity. Prior work operationalized this for event-based risks (e.g., miscoverage), but dispersion measures depend on the entire loss distribution, not just per-example indicators. To bridge this gap, the authors combine split-style calibration from conformal prediction with uniform empirical process control via the Dvoretzky–Kiefer–Wolfowitz inequality, allowing them to bound functionals that are Lipschitz or otherwise well-behaved with respect to the loss CDF. This mathematical move is what enables distribution-free guarantees for quantities like variance, interquantile range, or CVaR. Conceptually, fairness research—particularly the link between tail losses and group disparities—motivates targeting dispersion directly, while classic risk-measure theory (e.g., CVaR) supplies concrete objectives. Together, these strands yield a simple, plug-in framework: learn a model and tuning parameter, estimate the loss CDF on a calibration split, apply DKW-based confidence bands, and select settings that provably satisfy dispersion constraints at a chosen confidence level. The result is a general, distribution-free recipe that subsumes earlier risk-control methods and directly addresses inequality in model performance across individuals.",
  "analysis_timestamp": "2026-01-06T23:33:35.584555"
}