{
  "prior_works": [
    {
      "title": "Linear Convergence of Gradient and Proximal-Gradient Methods Under the Polyak–Łojasiewicz Condition",
      "authors": "Hadi Karimi, Julie Nutini, Mark Schmidt",
      "year": 2016,
      "role": "Theoretical tool: PL inequality and linear-rate template",
      "relationship_sentence": "This work provides the PL-based framework that Ward and Kolda leverage by proving a uniform PL inequality for the matrix factorization objective, yielding global linear convergence and iteration complexity scaling with (L/μ) log(1/ε)."
    },
    {
      "title": "Low-rank Matrix Completion Using Alternating Minimization",
      "authors": "Prateek Jain, Praneeth Netrapalli, Sujay Sanghavi",
      "year": 2013,
      "role": "Algorithmic paradigm: alternating updates with tailored initialization",
      "relationship_sentence": "Introduces and analyzes alternating update methods for low-rank factorization with spectral/warm starts, directly motivating Ward–Kolda’s alternating gradient scheme and their emphasis on principled initialization for fast convergence."
    },
    {
      "title": "A Nonlinear Programming Algorithm for Solving Semidefinite Programs via Low-Rank Factorization",
      "authors": "Samuel Burer, Renato D. C. Monteiro",
      "year": 2003,
      "role": "Factorization and over-parameterization paradigm",
      "relationship_sentence": "Established the efficacy of working in factorized low-rank variables and the benefits of mild over-parameterization, a modeling choice mirrored in Ward–Kolda’s asymmetric factorization with d ≥ r to obtain uniform constants."
    },
    {
      "title": "Global Optimality of Local Search for Low-Rank Matrix Recovery",
      "authors": "Arvind Bhojanapalli, Behnam Neyshabur, Nati Srebro",
      "year": 2016,
      "role": "Benign landscape/strict saddle for low-rank problems",
      "relationship_sentence": "Shows that nonconvex low-rank objectives can have no spurious local minima and satisfy strict saddle properties, supporting Ward–Kolda’s strategy to target a region where a global PL condition holds and linear convergence follows."
    },
    {
      "title": "No Spurious Local Minima in Nonconvex Low Rank Problems: A Unified Geometric Analysis",
      "authors": "Rong Ge, Chi Jin, Yi Zheng",
      "year": 2017,
      "role": "Unified geometric analysis of low-rank factorization landscapes",
      "relationship_sentence": "Provides broad conditions under which low-rank factorizations have benign geometry, informing Ward–Kolda’s use of over-parameterization and their simple global argument based on a uniform PL inequality."
    },
    {
      "title": "Guaranteed Matrix Completion via Nonconvex Factorization",
      "authors": "Yudong Chen, Yuejie Chi, Jianqing Fan, Cong Ma (often cited with related work by Yuxin Sun, Quanquan Gu, and John Wright in 2016)",
      "year": 2016,
      "role": "Initialization and linear-rate analysis for nonconvex MF",
      "relationship_sentence": "Demonstrates that with an appropriate initialization, gradient-type methods on factorized objectives achieve linear convergence, directly motivating Ward–Kolda’s design of an atypical random initialization that enables a uniform PL-based rate without sampling assumptions."
    }
  ],
  "synthesis_narrative": "Ward and Kolda’s core contribution—global, linear-rate convergence of alternating gradient descent for asymmetric matrix factorization with mild over-parameterization from a tailored random initialization—sits at the intersection of three lines of prior work. First, Karimi–Nutini–Schmidt established the Polyak–Łojasiewicz (PL) framework that converts a uniform PL inequality plus smoothness into an iteration complexity of O((L/μ) log(1/ε)). Ward and Kolda’s analysis hinges on proving such a uniform PL bound for the full-observation factorized objective, which directly yields the stated rate with condition-number dependence (σ1/σr)².\nSecond, a decade of results on nonconvex low-rank factorization shaped both the algorithmic template and the geometric expectations. Jain–Netrapalli–Sanghavi’s alternating minimization with spectral initialization highlighted how alternating updates can attain linear convergence when properly initialized, and inspired the AGD variant studied here. The Burer–Monteiro factorization philosophy and subsequent benign-landscape results (Bhojanapalli–Neyshabur–Srebro; Ge–Jin–Zheng) justified working in over-parameterized factors and suggested that, away from saddle sets, global convergence should be attainable.\nThird, nonconvex matrix completion analyses (e.g., 2016-era works showing linear rates from spectral/warm starts) emphasized the power of tailored initializations for achieving fast global convergence. Ward and Kolda advance this by proposing an “atypical” but simple random initialization that, together with mild over-parameterization, places the iterates in a region where a uniform PL inequality holds, enabling a clean, global AGD analysis and practical speedups without relying on sampling or problem-specific incoherence assumptions.",
  "analysis_timestamp": "2026-01-06T23:33:35.591071"
}