{
  "prior_works": [
    {
      "title": "Nonlinear Shrinkage Estimation of Large-Dimensional Covariance Matrices",
      "authors": "Olivier Ledoit, Michael Wolf",
      "year": 2012,
      "role": "Conceptual and technical foundation for rotationally invariant estimators (RIE) via oracle spectral shrinkage in high dimensions.",
      "relationship_sentence": "The paper’s use of rotation-invariant estimators and comparisons to oracle estimators directly build on Ledoit–Wolf’s framework of optimal eigenvalue shrinkage under rotational invariance."
    },
    {
      "title": "Cleaning Large Correlation Matrices: Tools from Random Matrix Theory",
      "authors": "C. Bun, J.-P. Bouchaud, M. Potters",
      "year": 2017,
      "role": "RIE methodology and oracle estimators for noisy covariance/correlation matrices using random matrix theory.",
      "relationship_sentence": "The authors generalize the RIE/“cleaning” paradigm of Bun–Bouchaud–Potters from single-matrix denoising to bilinear matrix factorization with extensive rank under rotationally invariant priors."
    },
    {
      "title": "Optimal Shrinkage of Singular Values",
      "authors": "Matan Gavish, David L. Donoho",
      "year": 2017,
      "role": "Optimal spectral shrinkage for matrix denoising under additive noise; design of singular-value shrinkers.",
      "relationship_sentence": "Their optimal singular-value shrinkage principles inform the present work’s rotation-invariant spectral formulas that denoise products of high-rank factors."
    },
    {
      "title": "The Singular Values and Vectors of Low Rank Perturbations of Large Rectangular Random Matrices",
      "authors": "Florent Benaych-Georges, Raj Rao Nadakuditi",
      "year": 2012,
      "role": "Spectral behavior and vector alignment in spiked random matrices, guiding oracle and shrinkage designs.",
      "relationship_sentence": "Insights on how signal and noise mix in singular spectra underpin the paper’s oracle comparisons and justify rotation-invariant shrinkage in the high-dimensional limit."
    },
    {
      "title": "Bilinear Generalized Approximate Message Passing (BiG-AMP)",
      "authors": "Philip Schniter, Sundeep Rangan, Alyson K. Parker, Volkan Cevher (and collaborators)",
      "year": 2014,
      "role": "Bayesian algorithmic framework for matrix/bilinear factorization under AWGN and separable priors.",
      "relationship_sentence": "BiG-AMP established the Bayesian matrix-factorization setting that the paper studies, motivating Bayes-optimal reconstruction for bilinear models though here extended to extensive-rank and rotationally invariant priors."
    },
    {
      "title": "Fundamental Limits of Symmetric Low-Rank Matrix Estimation",
      "authors": "Marc Lelarge, Léo Miolane",
      "year": 2019,
      "role": "Bayes-optimal MMSE and mutual information formulas in symmetric low-rank models via replica/cavity methods.",
      "relationship_sentence": "This work’s Bayes-optimal perspective and large-N formulas for symmetric models inspire the present paper’s conjectured optimality of rotation-invariant estimators beyond the low-rank regime."
    },
    {
      "title": "Deterministic Equivalents for Certain Functionals of Large Random Matrices",
      "authors": "Walid Hachem, Philippe Loubaton, Jamal Najim",
      "year": 2007,
      "role": "Random matrix theory toolset to compute spectral transforms for rotationally invariant ensembles.",
      "relationship_sentence": "Deterministic equivalents enable the analytical spectral calculations the authors use to derive closed-form rotation-invariant Bayesian estimators in the extensive-rank limit."
    }
  ],
  "synthesis_narrative": "The paper’s core advance—closed-form Bayesian reconstruction formulas for extensive-rank matrix factorization under rotationally invariant priors—sits at the intersection of rotationally invariant estimation, random matrix theory, and Bayesian optimal inference. The RIE paradigm of Ledoit–Wolf and Bun–Bouchaud–Potters established that when priors/noise are rotationally invariant, optimal estimators reduce to spectral shrinkage with oracle targets determined by population spectra. Gavish–Donoho’s optimal singular-value shrinkage further refined how to design nonlinear spectral mappings for additive-noise denoising, providing a template the authors adapt to a bilinear product contaminated by noise.\nSpectral behavior insights from Benaych-Georges–Nadakuditi on signal–noise interactions in spiked models motivate how oracle estimators should behave and why rotation-invariant shrinkage can be optimal in high dimensions. On the Bayesian side, BiG-AMP formulated bilinear factorization under AWGN and priors, motivating the present focus on Bayes-optimal estimators; however, those earlier methods largely target low-rank or i.i.d. settings. Lelarge–Miolane’s replica-based characterizations of Bayes-optimal limits in symmetric low-rank estimation demonstrate how Bayes-optimality can be captured via spectral quantities, a viewpoint the present work extends to extensive-rank factors. Finally, deterministic equivalents from Hachem–Loubaton–Najim supply the random matrix toolkit to express the posterior means as explicit spectral integrals under rotational invariance. Together, these lines converge to justify and derive rotation-invariant Bayesian estimators for two-factor reconstruction and to support the paper’s optimality conjecture via oracle comparisons.",
  "analysis_timestamp": "2026-01-06T23:42:49.094727"
}