{
  "prior_works": [
    {
      "title": "Orthogonal Matching Pursuit: Recursive Function Approximation with Applications to Wavelet Decomposition",
      "authors": "P. P. Pati, R. Rezaiifar, P. S. Krishnaprasad",
      "year": 1993,
      "role": "Algorithmic foundation for OMP",
      "relationship_sentence": "Provides the core greedy procedure that selects dictionary atoms by correlation with the residual—the mechanism the paper shows emerges from information gain under random-query IP."
    },
    {
      "title": "Signal Recovery From Random Measurements Via Orthogonal Matching Pursuit",
      "authors": "J. A. Tropp, A. C. Gilbert",
      "year": 2007,
      "role": "Theoretical guarantees and analysis of OMP",
      "relationship_sentence": "Supplies the sparse recovery theory and residual/inner-product analysis that the paper leverages when interpreting OMP as an information-maximizing selector."
    },
    {
      "title": "Extensions of Lipschitz mappings into a Hilbert space (Johnson–Lindenstrauss lemma)",
      "authors": "W. B. Johnson, J. Lindenstrauss",
      "year": 1984,
      "role": "Random projection theory enabling reduction",
      "relationship_sentence": "Underpins the paper’s result that IP with random projections preserves (normalized) inner products, making greedy MI selection ‘almost’ equivalent to OMP."
    },
    {
      "title": "An Active Testing Model for Tracking Roads in Satellite Images",
      "authors": "S. Geman, B. Jedynak",
      "year": 1996,
      "role": "Foundational active testing / information-pursuit paradigm",
      "relationship_sentence": "Establishes the sequential, information-gain-driven query selection framework that the paper formalizes and connects to OMP."
    },
    {
      "title": "Near-Optimal Sensor Placements in Gaussian Processes: Theory, Efficient Algorithms and Empirical Studies",
      "authors": "A. Krause, A. Singh, C. Guestrin",
      "year": 2008,
      "role": "Greedy information gain justification (submodularity)",
      "relationship_sentence": "Provides the submodular/greedy optimality rationale for MI-based selection, validating the paper’s use of greedy criteria when relating IP and OMP."
    },
    {
      "title": "Least Angle Regression",
      "authors": "B. Efron, T. Hastie, I. Johnstone, R. Tibshirani",
      "year": 2004,
      "role": "Greedy residual-correlation selection in regression",
      "relationship_sentence": "Clarifies the connection between residual-correlation greedy selection and normalized correlations, informing the paper’s distinction between OMP and IP’s normalized gains."
    },
    {
      "title": "Learning to Explain: An Information-Theoretic Perspective on Model Interpretation (L2X)",
      "authors": "J. Chen, L. Song, M. I. Jordan, M. J. Wainwright",
      "year": 2018,
      "role": "MI-based explainability motivation and application",
      "relationship_sentence": "Demonstrates the use of mutual information for selecting explanatory features, motivating the paper’s IP→OMP reduction as a practical, scalable path to MI-driven explanations."
    }
  ],
  "synthesis_narrative": "The paper’s key contribution is to show that greedy information gain selection (Information Pursuit, IP) nearly reduces to Orthogonal Matching Pursuit (OMP) when queries are random projections of dictionary atoms, with the remaining difference being IP’s use of normalized correlation gain. This rests on two strands of prior work. First, active testing and information-pursuit ideas (Geman & Jedynak) and the submodularity-based theory of greedy information gain (Krause et al.) formalized sequential query selection by mutual information, providing the conceptual target the authors aim to approximate efficiently. Second, OMP and its theory (Pati et al.; Tropp & Gilbert) deliver an operational greedy procedure that selects atoms by correlation with the residual, together with guarantees for sparse recovery and analysis of residual inner products. The bridge between these worlds is random projection theory (Johnson–Lindenstrauss), which ensures that random queries preserve inner products (and thus the orderings induced by normalized correlations), enabling the reduction from MI-based selection to OMP-like selection. Connections to residual-correlation methods in statistics (LARS; Efron et al.) clarify the role of normalized versus unnormalized correlations in greedy selection, aligning with the paper’s IP-OMP variant. Finally, information-theoretic explainability work (L2X) motivates and grounds the paper’s applications: replacing expensive MI estimation with an OMP-style surrogate yields scalable, faithful explanatory feature selection consistent with an information maximization perspective.",
  "analysis_timestamp": "2026-01-06T23:33:36.295414"
}