{
  "prior_works": [
    {
      "title": "The Assignment Game I: The Core",
      "authors": "Lloyd S. Shapley, Martin Shubik",
      "year": 1971,
      "role": "Foundational concept of the core in assignment/coalitional settings",
      "relationship_sentence": "Introduces the core as a coalition-proof notion of group stability in assignment markets, directly inspiring the paper’s definition of group fairness as a core-like, coalition-resilient reviewing assignment."
    },
    {
      "title": "On Cores and Indivisibilities",
      "authors": "Lloyd S. Shapley, Herbert Scarf",
      "year": 1974,
      "role": "Existence and algorithmic ideas for core allocations (TTC) in one-sided matching",
      "relationship_sentence": "Establishes existence of core allocations and provides TTC as an efficient method, informing the paper’s existence proof and algorithmic approach for finding core-review assignments."
    },
    {
      "title": "College Admissions and the Stability of Marriage",
      "authors": "David Gale, Lloyd S. Shapley",
      "year": 1962,
      "role": "Stability as no-blocking criterion in matching",
      "relationship_sentence": "Provides the stability paradigm (absence of blocking coalitions/pairs) that the paper generalizes to communities in peer review, linking fairness to coalition-proofness in assignment."
    },
    {
      "title": "Two-Sided Matching: A Study in Game-Theoretic Modeling and Analysis",
      "authors": "Alvin E. Roth, Marilda A. Oliveira Sotomayor",
      "year": 1990,
      "role": "Comprehensive theory of stable and core outcomes in many-to-one and many-to-many matchings",
      "relationship_sentence": "Supplies theory connecting stability/core and capacity-constrained matchings, directly relevant to peer review where papers and reviewers have multi-unit demands/capacities."
    },
    {
      "title": "The Toronto Paper Matching System: An Automated Paper-Reviewer Assignment System",
      "authors": "Laurent Charlin, Richard Zemel",
      "year": 2013,
      "role": "Practical/optimization framework for reviewer-paper assignment via similarity scores",
      "relationship_sentence": "Provides the standard similarity-based assignment model and constraints used in modern conferences, which the paper augments with a coalition-proof group fairness requirement."
    },
    {
      "title": "PeerReview4All: Fair and Accurate Reviewer Assignment in Conference Peer Review",
      "authors": "Ilya Stelmakh, Nihar B. Shah, Aarti Singh",
      "year": 2019,
      "role": "Fairness guarantees in reviewer assignment (protecting worst-off papers) with efficient algorithms",
      "relationship_sentence": "Introduces formal fairness objectives for peer-review assignments, serving as a key antecedent that the paper extends from individual/worst-case fairness to coalition (community) fairness via the core."
    }
  ],
  "synthesis_narrative": "The paper’s core contribution—defining and achieving group fairness in peer review via a core-style notion that prevents any community from benefiting by seceding—sits at the intersection of cooperative game theory and modern reviewer assignment systems. The intellectual backbone is the core from cooperative game theory, pioneered by Shapley and Shubik (1971), which formalizes coalition-proof outcomes in assignment markets. Shapley and Scarf (1974) further cement the algorithmic and existential underpinnings of core allocations in one-sided matching, offering TTC-like insights that motivate existence and efficient computation in discrete allocation settings. Complementing these, Gale and Shapley (1962) and the Roth–Sotomayor monograph (1990) supply the stability framework and its generalizations to capacity-constrained (many-to-many) environments, which closely mirror peer review where each paper requires multiple reviews and reviewers have limited load. On the application side, Charlin and Zemel’s TPMS (2013) provides the prevailing similarity-based modeling and optimization template for large-scale conferences, the substrate on which fairness constraints must operate. Building on this, PeerReview4All (Stelmakh, Shah, Singh, 2019) demonstrates that fairness can be formalized and algorithmically guaranteed in reviewer assignment; the present paper advances this line by elevating fairness from individual or worst-case protection to coalition (community) robustness, translating core-style guarantees into the peer-review context and delivering both existence and efficient algorithms under a realistic assignment model.",
  "analysis_timestamp": "2026-01-06T23:39:42.975842"
}