{
  "prior_works": [
    {
      "title": "Testing by Betting: A Strategy for Statistical Science",
      "authors": "Glenn Shafer",
      "year": 2021,
      "role": "Conceptual framework",
      "relationship_sentence": "Introduced the testing-by-betting paradigm and interpretable evidence via betting scores/e-processes, which the paper directly adapts to construct sequential, nonparametric fairness audits with anytime-valid guarantees."
    },
    {
      "title": "Game-Theoretic Foundations for Probability and Finance",
      "authors": "Glenn Shafer; Vladimir Vovk",
      "year": 2019,
      "role": "Foundational theory (test martingales)",
      "relationship_sentence": "Provides the game-theoretic statistics foundation—nonnegative supermartingales/test martingales and wealth processes—that underpins the paper’s e-value based auditing procedures and their validity under optional stopping and policy changes."
    },
    {
      "title": "Time-Uniform, Nonparametric, Nonasymptotic Confidence Sequences",
      "authors": "Steven L. Howard; Aaditya Ramdas; Jon McAuliffe; Jasper Sekhon",
      "year": 2021,
      "role": "Anytime-valid inference tool",
      "relationship_sentence": "Supplies the time-uniform concentration/CS machinery from nonnegative supermartingales that the paper leverages to monitor fairness gaps continuously and handle distribution shift without fixed-sample assumptions."
    },
    {
      "title": "Safe Testing",
      "authors": "Peter D. Grünwald; Rianne de Heide; Wouter M. Koolen",
      "year": 2020,
      "role": "Methodological grounding for e-values",
      "relationship_sentence": "Formalizes e-values and safe anytime-valid testing, directly informing the paper’s use of e-processes to build interpretable, sequential fairness audits that remain valid under adaptivity."
    },
    {
      "title": "E-values: Calibration, Combination and Applications",
      "authors": "Vladimir Vovk; Ruodu Wang",
      "year": 2021,
      "role": "Evidence measures and combination rules",
      "relationship_sentence": "Provides calibration and combination principles for e-values that enable the paper’s aggregation of evidence across time and subpopulations when auditing multiple fairness criteria."
    },
    {
      "title": "Preventing Fairness Gerrymandering: Auditing and Learning for Subgroup Fairness",
      "authors": "Michael Kearns; Seth Neel; Aaron Roth; Zhiwei Steven Wu",
      "year": 2018,
      "role": "Fairness auditing precedent",
      "relationship_sentence": "Establishes the auditing perspective for subgroup fairness, which the paper extends from fixed-sample, batch tests to sequential, anytime-valid audits under streaming data."
    },
    {
      "title": "Doubly Robust Policy Evaluation and Learning",
      "authors": "Miroslav Dudík; John Langford; Lihong Li",
      "year": 2011,
      "role": "Off-policy/propensity weighting foundation",
      "relationship_sentence": "Introduces importance weighting and doubly robust ideas for data collected under probabilistic policies, which the paper incorporates to audit fairness when data are logged by changing policies."
    }
  ],
  "synthesis_narrative": "Auditing Fairness by Betting fuses the fairness-auditing problem with the modern, game-theoretic view of statistical evidence to deliver sequential, nonparametric, and off-policy valid tests. Shafer’s Testing by Betting and the Shafer–Vovk game-theoretic foundations supply the core idea of representing evidence as a bettor’s wealth via nonnegative supermartingales. This makes test outcomes interpretable and, crucially, yields validity under optional stopping and policy shifts—properties essential for continuous monitoring in deployed systems. Building on this conceptual base, Howard–Ramdas–McAuliffe–Sekhon develop time-uniform concentration and confidence sequences from supermartingale techniques, which the paper uses to track evolving fairness gaps without fixed sample sizes or asymptotics. Complementary to this, Grünwald–de Heide–Koolen’s Safe Testing and Vovk–Wang’s work on e-values provide the formal apparatus for constructing and combining e-processes, enabling principled aggregation of evidence across time, metrics, and subgroups. On the application side, Kearns–Neel–Roth–Wu established the auditing lens for subgroup fairness in a batch setting; the present paper extends that ambition to an anytime-valid, streaming regime. Finally, Dudík–Langford–Li’s off-policy evaluation framework legitimizes the use of importance weighting when data arise from probabilistic logging policies, allowing fairness audits on adaptively collected, repurposed data. Together, these strands yield an auditing methodology that is interpretable, sequential, robust to distribution shift, and applicable under changing, policy-driven data collection.",
  "analysis_timestamp": "2026-01-06T23:42:49.087546"
}