{
  "prior_works": [
    {
      "title": "Sinkhorn Distances: Lightspeed Computation of Optimal Transport",
      "authors": "Marco Cuturi",
      "year": 2013,
      "role": "Origin of entropic OT and baseline algorithm",
      "relationship_sentence": "Introduced entropic regularization and Sinkhorn scaling, defining the EOT objective that ENOT solves while explicitly targeting Sinkhorn’s limitations (quadratic cost, instability at small regularization) with a neural diffusion-based alternative."
    },
    {
      "title": "Optimal Transportation Problem by Stochastic Optimal Control",
      "authors": "Takuya Mikami, Mathieu Thieullen",
      "year": 2006,
      "role": "Dynamic equivalence between EOT and Schrödinger Bridge",
      "relationship_sentence": "Established the equivalence between entropic OT and the Schrödinger Bridge as a stochastic control problem, providing the theoretical foundation for ENOT’s dynamic SB-based formulation of EOT."
    },
    {
      "title": "On the Relation Between Optimal Transport and Schrödinger Bridges: A Stochastic Control Viewpoint",
      "authors": "Yongxin Chen, Tryphon T. Georgiou, Michele Pavon",
      "year": 2016,
      "role": "Control-theoretic and dual/variational structure of SB",
      "relationship_sentence": "Developed the KL-control formulation and dual potentials for SB, motivating the saddle-point (min–max) reformulation that ENOT leverages for single-step, end-to-end training."
    },
    {
      "title": "A Computational Fluid Mechanics Solution to the Monge–Kantorovich Mass Transfer Problem",
      "authors": "Jean-David Benamou, Yann Brenier",
      "year": 2000,
      "role": "Dynamic OT and saddle Lagrangian template",
      "relationship_sentence": "Provided the dynamic OT framework and primal–dual structure (via continuity equation and Lagrange multipliers) that inspire ENOT’s dynamic, saddle-point optimization—adapted here to the entropic/SB setting."
    },
    {
      "title": "Score-Based Generative Modeling through Stochastic Differential Equations",
      "authors": "Yang Song, Jascha Sohl-Dickstein, Diederik P. Kingma, Abhishek Kumar, Stefano Ermon, Ben Poole",
      "year": 2020,
      "role": "Diffusion/score SDE machinery",
      "relationship_sentence": "Supplied the diffusion SDE and score-learning toolkit for modeling and training stochastic dynamics, which ENOT employs to parameterize diffusion processes implementing the SB-based transport."
    },
    {
      "title": "Diffusion Schrödinger Bridge with Applications to Score-Based Generative Modeling",
      "authors": "Valentin De Bortoli, James Thornton, Jeremy Heng, Arnaud Doucet",
      "year": 2021,
      "role": "Algorithmic precedent for SB via diffusion",
      "relationship_sentence": "Showed how to solve SB using diffusion models and learned scores; ENOT builds on this paradigm but replaces iterative IPF/alternating procedures with a single saddle-point learning step for faster inference and robustness at small regularization."
    },
    {
      "title": "Stochastic Optimization for Large-Scale Optimal Transport",
      "authors": "Alexis Genevay, Gabriel Peyré, Marco Cuturi",
      "year": 2016,
      "role": "Sample-based EOT via (semi-)dual stochastic optimization",
      "relationship_sentence": "Pioneered scalable, sample-based optimization of EOT duals; ENOT contrasts with these static semi-dual approaches by solving the dynamic SB formulation end-to-end, improving scalability and handling small entropy coefficients."
    }
  ],
  "synthesis_narrative": "Entropic Neural Optimal Transport (ENOT) sits at the junction of entropic OT, dynamic formulations, and diffusion-based generative modeling. Cuturi’s introduction of entropic regularization established the EOT objective and the Sinkhorn algorithm, which dominates practice but struggles with quadratic cost structures and small regularization. Mikami and Thieullen’s equivalence between EOT and the Schrödinger Bridge (SB) reframed entropic OT as a stochastic control problem, opening a dynamic route to computing EOT plans. Chen, Georgiou, and Pavon’s KL-control viewpoint and dual potentials further clarified the variational and saddle-point structure of SB, directly motivating ENOT’s min–max reformulation and single-step end-to-end training.\nBenamou and Brenier’s dynamic OT provided the archetypal primal–dual Lagrangian and continuity-equation framework that ENOT adapts to the entropic/SB setting. On the modeling side, score-based diffusion SDEs (Song et al.) contributed practical parameterizations and training tools for stochastic dynamics, enabling learned diffusion processes that realize transport. De Bortoli et al.’s Diffusion Schrödinger Bridge demonstrated how diffusion and score learning can solve SB, but relied on iterative IPF-like alternations; ENOT builds upon this but replaces iteration with a saddle-point learning strategy, yielding fast inference and improved behavior at small entropy. Finally, stochastic semi-dual methods for sample-based EOT (Genevay et al.) form the main static baseline that ENOT surpasses by leveraging the SB dynamic formulation. Together, these works directly shape ENOT’s core innovation: a diffusion-based, saddle-point neural algorithm for EOT that is end-to-end, scalable, and effective at low regularization.",
  "analysis_timestamp": "2026-01-07T00:02:04.838933"
}