{
  "prior_works": [
    {
      "title": "Pretrained Transformers as Universal Computation Engines (a.k.a. Frozen Pretrained Transformers)",
      "authors": "Kevin Lu, Aditya Grover, Pieter Abbeel, Igor Mordatch",
      "year": 2021,
      "role": "Frozen-backbone paradigm",
      "relationship_sentence": "Introduced the FPT approach—freezing pretrained Transformer self-attention/FFN blocks and learning small input/output interfaces—directly mirrored by this paper’s Frozen Pretrained Transformer for time series."
    },
    {
      "title": "Parameter-Efficient Transfer Learning for NLP",
      "authors": "Neil Houlsby et al.",
      "year": 2019,
      "role": "Parameter-efficient transfer precursor",
      "relationship_sentence": "Established that keeping the backbone fixed and training lightweight adapter modules can yield strong transfer, informing this work’s decision to avoid modifying core Transformer blocks while adapting to time-series tasks."
    },
    {
      "title": "Prefix-Tuning: Optimizing Continuous Prompts for Generation",
      "authors": "Xiang Lisa Li, Percy Liang",
      "year": 2021,
      "role": "Freeze-and-adapt methodology",
      "relationship_sentence": "Demonstrated effective adaptation of frozen LMs via small learnable prefixes, reinforcing the feasibility of leaving self-attention/FFN weights untouched as done here."
    },
    {
      "title": "An Image is Worth 16x16 Words: Transformers for Image Recognition at Scale",
      "authors": "Alexey Dosovitskiy et al.",
      "year": 2021,
      "role": "Architectural and tokenization inspiration",
      "relationship_sentence": "ViT’s patch-based tokenization and large-scale pretraining provide both the pretrained CV backbones and the patching interface paradigm that this paper repurposes for time-series inputs."
    },
    {
      "title": "Language Models are Few-Shot Learners",
      "authors": "Tom B. Brown et al.",
      "year": 2020,
      "role": "Large-scale pretraining motivation",
      "relationship_sentence": "Showed the broad generalization power of massive pretrained LMs; this work leverages such backbones to overcome time-series data scarcity by freezing and reusing their learned representations."
    },
    {
      "title": "AST: Audio Spectrogram Transformer",
      "authors": "Yuan Gong, Yu-An Chung, James Glass",
      "year": 2021,
      "role": "Cross-modal transfer evidence",
      "relationship_sentence": "Provided a concrete precedent for reusing image-pretrained Transformers on a different sequential modality (audio) via spectrogram patching, closely paralleling this paper’s cross-modal repurposing for time series."
    },
    {
      "title": "A Transformer-based Framework for Multivariate Time Series Representation Learning",
      "authors": "Georgios Zerveas et al.",
      "year": 2021,
      "role": "Time-series Transformer precursor",
      "relationship_sentence": "Established effective Transformer formulations for multivariate time series and informed tokenization/positional encoding choices that enable plugging time-series data into pretrained Transformer backbones."
    }
  ],
  "synthesis_narrative": "The paper’s core insight—repurposing large pretrained language/vision Transformers for general time-series analysis by freezing their residual self-attention/FFN blocks and learning small interfaces—draws most directly from the Frozen Pretrained Transformer paradigm of Lu et al., which showed that a fixed Transformer can be retargeted by training only input/output mappings. This freeze-and-adapt philosophy is reinforced by parameter-efficient transfer methods such as adapter tuning (Houlsby et al.) and prefix-tuning (Li & Liang), which empirically validated that high-capacity backbones can remain untouched while small parameter sets enable effective specialization. Large-scale pretraining results from GPT-3 (Brown et al.) motivate the use of LMs as universal feature extractors to mitigate time-series data scarcity. On the vision side, ViT (Dosovitskiy et al.) established patch-based tokenization and provided robust image-pretrained Transformer backbones; AST (Gong et al.) offered a salient cross-modal example by adapting ViT to audio via spectrogram patching, demonstrating that minimal interfaces can bridge modalities. Finally, prior Transformer formulations for time series (Zerveas et al.) informed how to tokenize multivariate sequences and apply positional encodings so that time-series inputs are compatible with pretrained Transformer stacks. Together, these works converge on a simple but powerful recipe: keep the pretrained Transformer blocks frozen, design lightweight input/output interfaces tailored to time-series structure, and fine-tune for diverse tasks (forecasting, classification, anomaly detection, few-shot), yielding a single model that “fits all.”",
  "analysis_timestamp": "2026-01-07T00:02:04.848509"
}