{
  "prior_works": [
    {
      "title": "Score-Based Generative Modeling through Stochastic Differential Equations",
      "authors": "Yang Song, Jascha Sohl-Dickstein, Diederik P. Kingma, Abhishek Kumar, Stefano Ermon, Ben Poole",
      "year": 2021,
      "role": "Foundational SDE-based diffusion/score framework",
      "relationship_sentence": "This paper established the continuous-time score-based generative modeling framework and reverse-time SDE used by diffusion models; HDM directly generalizes this reverse-time SDE framework from finite-dimensional Euclidean spaces to stochastic evolution equations on Hilbert spaces."
    },
    {
      "title": "Reverse-time diffusion equation models",
      "authors": "B. D. O. Anderson",
      "year": 1982,
      "role": "Key time-reversal theorem for diffusions",
      "relationship_sentence": "Anderson’s reverse-time diffusion results underlie the reverse-SDE formulation in score-based models; HDM extends this time-reversal principle to infinite-dimensional stochastic evolution equations, deriving a generalized reverse-time formula in Hilbert spaces."
    },
    {
      "title": "Time reversal of diffusion processes",
      "authors": "U. G. Haussmann, E. Pardoux",
      "year": 1986,
      "role": "Rigorous time-reversal theory",
      "relationship_sentence": "Haussmann–Pardoux provide rigorous conditions and formulas for time-reversed diffusions; HDM leverages and extends these ideas to the setting of stochastic evolution equations on Hilbert spaces to connect forward and reverse dynamics."
    },
    {
      "title": "Stochastic Equations in Infinite Dimensions (2nd ed.)",
      "authors": "G. Da Prato, J. Zabczyk",
      "year": 2014,
      "role": "Mathematical framework for SEEs/SPDEs in Hilbert spaces",
      "relationship_sentence": "This monograph supplies the SEE/SPDE toolbox (mild solutions, semigroup/evolution operators, Hilbert-space stochastic calculus) that HDM uses to formalize forward SEE dynamics and to prove the generalized time-reversal formula."
    },
    {
      "title": "Denoising Diffusion Probabilistic Models",
      "authors": "Jonathan Ho, Ajay Jain, Pieter Abbeel",
      "year": 2020,
      "role": "Training objective and discretization for diffusion models",
      "relationship_sentence": "DDPM’s denoising-based training and discretized diffusion schedules inform HDM’s practical training and discretization of Hilbert-space dynamics, tying the generalized SEE formulation back to scalable learning."
    },
    {
      "title": "A Connection Between Score Matching and Denoising Autoencoders",
      "authors": "Pascal Vincent",
      "year": 2011,
      "role": "Score estimation via denoising (DSM)",
      "relationship_sentence": "Vincent’s denoising score-matching principle underlies how diffusion models learn scores; HDM adapts this score-learning approach to function spaces to estimate Hilbert-space scores required by the reverse SEE."
    },
    {
      "title": "Fourier Neural Operator for Parametric Partial Differential Equations",
      "authors": "Zongyi Li, Nikola Kovachki, Kamyar Azizzadenesheli, Burigede Liu, Kaushik Bhattacharya, Andrew Stuart, Anima Anandkumar",
      "year": 2020,
      "role": "Operator-learning architecture on function spaces",
      "relationship_sentence": "FNO provides a practical function-to-function parameterization that HDM uses to model Hilbert-space scores/evolution operators, enabling generation over functional data and operator-structured dynamics."
    }
  ],
  "synthesis_narrative": "HDM’s core contribution—extending score-based generative modeling to stochastic evolution equations on Hilbert spaces—sits at the intersection of modern diffusion modeling and classical stochastic analysis in infinite dimensions. Song et al. (2021) supplied the continuous-time SDE formulation of diffusion models and the reverse-time SDE viewpoint, which HDM generalizes from finite-dimensional Euclidean spaces to Hilbert-space SEEs. This generalization hinges on time-reversal theory: Anderson (1982) and Haussmann–Pardoux (1986) provide the foundational reverse-time formulas for diffusions that HDM extends to infinite-dimensional settings, yielding a new reverse-time expression for SEEs. To make this extension mathematically sound, HDM relies on the SEE/SPDE framework of Da Prato & Zabczyk (2014), including semigroups/evolution operators and mild solutions, which allow formulating both forward and reverse dynamics in Hilbert spaces. On the learning side, HDM inherits practical training protocols from DDPM (Ho et al., 2020) and denoising score matching (Vincent, 2011), adapting noise-conditioned score learning to function spaces. Finally, to parameterize mappings between functions inherent in Hilbert-space scores and operator-driven dynamics, HDM leverages the Fourier Neural Operator (Li et al., 2020), enabling scalable operator learning and capturing transformations like image/function-to-function drifts. Together, these works directly inform HDM’s theoretical bridge (time reversal in Hilbert spaces), its probabilistic modeling template (score-based diffusion), and its implementable parameterization (neural operators) for generative modeling of functional data.",
  "analysis_timestamp": "2026-01-06T23:42:49.122147"
}