{
  "prior_works": [
    {
      "title": "Diffusion Schrödinger Bridge",
      "authors": "Valentin De Bortoli, James Thornton, Jeremy Heng, Arnaud Doucet",
      "year": 2021,
      "role": "Algorithmic template for dynamic, score-based SB between two marginals",
      "relationship_sentence": "TreeDSB explicitly extends DSB from the two-marginal setting to a multi-marginal, tree-structured setting, preserving the forward/backward diffusion and alternating-projection scheme while introducing message-passing over tree edges."
    },
    {
      "title": "Iterative Bregman Projections for Regularized Transportation Problems",
      "authors": "Jean-David Benamou, Guillaume Carlier, Marco Cuturi, Luca Nenna, Gabriel Peyré",
      "year": 2015,
      "role": "Generalized Sinkhorn/IBP for entropic multi-marginal OT (including tree-structured costs and barycenters)",
      "relationship_sentence": "TreeDSB is the continuous-time, continuous-state dynamic counterpart of the generalized Sinkhorn/IBP updates for multi-marginal entropic OT, with the tree factorization mirrored by TreeDSB’s message-passing projections."
    },
    {
      "title": "Fast Computation of Wasserstein Barycenters",
      "authors": "Marco Cuturi, Arnaud Doucet",
      "year": 2014,
      "role": "Introduced entropic regularization and Sinkhorn-based algorithms for Wasserstein barycenters via a star-shaped multi-marginal formulation",
      "relationship_sentence": "TreeDSB leverages the star-shaped tree reformulation of barycenters from this work, providing a dynamic SB-based procedure to compute high-dimensional barycenters as a special case of its tree-structured multi-marginal framework."
    },
    {
      "title": "Barycenters in the Wasserstein Space",
      "authors": "Mohamed Agueh, Guillaume Carlier",
      "year": 2011,
      "role": "Foundational definition and characterization of Wasserstein barycenters",
      "relationship_sentence": "TreeDSB targets the barycenter problem defined here, recasting it as a tree-shaped multi-marginal OT task solvable through a dynamic Schrödinger-bridge perspective."
    },
    {
      "title": "A survey of the Schrödinger problem and some of its connections with optimal transport",
      "authors": "Christian Léonard",
      "year": 2014,
      "role": "Theoretical bridge equating entropic OT with Schrödinger bridge via large deviations/stochastic control",
      "relationship_sentence": "TreeDSB relies on this equivalence to justify solving entropic multi-marginal OT with a dynamic SB formulation and alternating projections on marginal constraints."
    },
    {
      "title": "Optimal Transportation Problem as a Stochastic Control Problem",
      "authors": "Toshio Mikami, Michel Thieullen",
      "year": 2006,
      "role": "Stochastic control formulation of (entropic) OT and its dynamic characterization",
      "relationship_sentence": "TreeDSB’s controlled diffusion view of multi-marginal entropic OT follows the stochastic-control foundations laid by Mikami–Thieullen, extended to tree-structured multi-terminal constraints."
    },
    {
      "title": "Score-Based Generative Modeling through Stochastic Differential Equations",
      "authors": "Yang Song, Jascha Sohl-Dickstein, Diederik P. Kingma, Abhishek Kumar, Stefano Ermon, Ben Poole",
      "year": 2021,
      "role": "Score-SDE framework enabling learned drifts and time-reversal for high-dimensional diffusion-based sampling",
      "relationship_sentence": "TreeDSB adopts score-based estimators within the SB framework to scale multi-marginal entropic OT and barycenter computation to high-dimensional data such as images."
    }
  ],
  "synthesis_narrative": "TreeDSB sits at the intersection of entropic multi-marginal optimal transport (mOT), Schrödinger bridges (SB), and score-based diffusion modeling. The theoretical foundation that entropic OT admits a dynamic SB formulation originates from the stochastic-control and large-deviation perspectives of Mikami–Thieullen and Léonard, which justify casting regularized transport as a controlled diffusion with marginal constraints. On the computational OT side, Cuturi and Doucet introduced efficient entropic barycenters via Sinkhorn, and Benamou–Carlier–Cuturi–Nenna–Peyré generalized this to multi-marginal problems through iterative Bregman projections (generalized Sinkhorn), with structure that naturally accommodates tree factorizations; the star-shaped case corresponds to Wasserstein barycenters. Diffusion Schrödinger Bridge (De Bortoli et al.) then brought these ideas to continuous-time dynamics with learned score functions, enabling high-dimensional applications by alternating forward/backward diffusions and marginal projections. Song et al.’s score-SDE framework provides the practical machinery to learn time-reversed drifts required by DSB-style algorithms.\n\nTreeDSB’s key contribution is to merge these threads: it extends DSB from two marginals to a tree of marginals, designing a message-passing, alternating-projection procedure over edges that is the dynamic continuous-state analogue of generalized Sinkhorn on trees. This yields a principled and scalable method for multi-marginal entropic OT, with Wasserstein barycenters emerging as the star-tree special case. The result is a high-dimensional, diffusion-based algorithm that inherits both the theoretical guarantees of SB/entropic OT equivalence and the computational efficiency of Sinkhorn-style factorizations.",
  "analysis_timestamp": "2026-01-06T23:42:49.102526"
}