{
  "prior_works": [
    {
      "title": "A New Approach to Linear Filtering and Prediction Problems",
      "authors": "Rudolf E. Kalman",
      "year": 1960,
      "role": "Foundational LQG theory",
      "relationship_sentence": "Provides the LQG baseline—linear controllers and the separation principle—against which the paper’s main result (optimality of linear-in-observation policies under distributional ambiguity) is formulated and proven as a robust generalization."
    },
    {
      "title": "Optimal stochastic linear systems with exponential performance criteria and their relation to deterministic differential games",
      "authors": "David H. Jacobson",
      "year": 1973,
      "role": "Risk-sensitive LQG and robustness via KL",
      "relationship_sentence": "Introduces risk-sensitive LQG, linking exponential-of-quadratic costs to robustness and dynamic games, which later underpins minimax interpretations under KL-divergence; the NeurIPS paper extends this robustness paradigm to Wasserstein ambiguity while preserving linear policy optimality."
    },
    {
      "title": "Risk-sensitive control and dynamic games for partially observed linear stochastic systems",
      "authors": "Matthew R. James, John S. Baras, Richard J. Elliott",
      "year": 1994,
      "role": "Minimax/risk-sensitive LQG under partial observation",
      "relationship_sentence": "Establishes linear controllers and a separation principle for partially observed minimax/risk-sensitive LQG, providing the closest structural precedent that the present work generalizes from KL-based to Wasserstein-based distributional robustness."
    },
    {
      "title": "Robustness",
      "authors": "Lars Peter Hansen, Thomas J. Sargent",
      "year": 2008,
      "role": "Robust LQG via relative entropy ambiguity",
      "relationship_sentence": "Formalizes minimax LQG with KL (relative-entropy) model ambiguity and shows that linear strategies remain optimal; the current paper mirrors this intellectual template but for Wasserstein ambiguity sets and potentially non-Gaussian worst-case noise."
    },
    {
      "title": "Data-driven Distributionally Robust Optimization using the Wasserstein metric: Performance guarantees and tractable reformulations",
      "authors": "Peyman Mohajerin Esfahani, Daniel Kuhn",
      "year": 2018,
      "role": "Wasserstein DRO foundations and duality",
      "relationship_sentence": "Provides the core mathematical machinery for Wasserstein ambiguity sets and tractable worst-case expectation reformulations that the paper leverages to characterize and compute the robust LQG controller."
    },
    {
      "title": "Wasserstein distributionally robust stochastic control: A data-driven approach",
      "authors": "Insoon Yang",
      "year": 2019,
      "role": "Dynamic programming under Wasserstein ambiguity",
      "relationship_sentence": "Develops dynamic programming for stochastic control with Wasserstein uncertainty, offering the general DRO control framework that the paper specializes and sharpens to the partial-information linear–quadratic setting with a linear-policy optimality result."
    },
    {
      "title": "Distributionally Robust Markov Decision Processes",
      "authors": "Huan Xu, Shie Mannor",
      "year": 2010,
      "role": "Robust DP with ambiguity sets",
      "relationship_sentence": "Establishes minimax dynamic programming for MDPs under distributional ambiguity, informing the paper’s worst-case Bellman recursion logic and policy characterization under ambiguity (though the present work focuses on LQG and Wasserstein balls)."
    }
  ],
  "synthesis_narrative": "The paper’s core innovation—showing that in finite-horizon, partially observed linear–quadratic systems with unknown noise supported in Wasserstein balls around Gaussian models, the optimal controller remains linear in the observations—builds on a sequence of results that progressively marry optimal control with robustness and distributional uncertainty. Kalman’s foundational work establishes the LQG benchmark and the separation between estimation (Kalman filtering) and control. Jacobson (1973) and James–Baras–Elliott (1994) extend this paradigm to risk-sensitive and minimax settings, proving that under KL-type robustness, linear controllers and a separation principle persist even with partial observation. Hansen–Sargent codify KL-based model uncertainty as a minimax control problem, further cementing linear structure under distributional misspecification.\n\nThe present work departs from relative-entropy ambiguity and embraces Wasserstein uncertainty to better capture data-driven, non-Gaussian deviations—an approach made computationally viable by Esfahani–Kuhn’s duality and tractable reformulations for Wasserstein DRO. On the dynamic optimization side, Yang (2019) develops a general dynamic programming framework for Wasserstein-robust stochastic control, which the authors here specialize to linear–quadratic systems with partial observations. Complementing these is the robust DP perspective from Xu–Mannor on distributionally robust MDPs, guiding the minimax Bellman recursion under ambiguity. Together, these threads enable the paper’s main theoretical advance—preservation of linear optimality under Wasserstein ambiguity—and the associated efficient computational scheme for robust LQG synthesis.",
  "analysis_timestamp": "2026-01-07T00:02:04.809244"
}