{
  "prior_works": [
    {
      "title": "Controlling the false discovery rate: a practical and powerful approach to multiple testing",
      "authors": "Yoav Benjamini; Yosef Hochberg",
      "year": 1995,
      "role": "Foundational FDR control and step-up selection rule",
      "relationship_sentence": "AMDP’s selection step builds on the BH framework for controlling FDR when setting a global threshold for mediator discoveries."
    },
    {
      "title": "A direct approach to false discovery rates",
      "authors": "John D. Storey",
      "year": 2002,
      "role": "Adaptive FDR via estimating the null proportion (π0) and data-driven thresholding",
      "relationship_sentence": "AMDP extends the adaptive spirit of Storey’s q-value by estimating proportions of composite-null components to inform both ranking and threshold choice."
    },
    {
      "title": "The optimal discovery procedure for large-scale hypothesis testing",
      "authors": "John D. Storey; Jonathan E. Taylor; David Siegmund",
      "year": 2007,
      "role": "Optimal ranking via likelihood-based ordering to maximize true discoveries",
      "relationship_sentence": "AMDP’s claim of an optimal ranking rule echoes ODP’s principle of ranking by likelihood ratios, adapted to the mediation setting with composite nulls."
    },
    {
      "title": "Oracle and adaptive FDR control for large-scale multiple testing",
      "authors": "Wei Sun; T. Tony Cai",
      "year": 2007,
      "role": "Decision-theoretic local-fdr framework yielding power-optimal rankings under FDR constraints",
      "relationship_sentence": "AMDP’s theory that couples an optimal ranking with an FDR-controlling threshold parallels Sun–Cai’s local-fdr-based oracle/data-driven procedures."
    },
    {
      "title": "AdaPT: An interactive procedure for multiple testing with side information",
      "authors": "Lihua Lei; William Fithian",
      "year": 2018,
      "role": "Adaptive, data-driven thresholding based on estimated local false discovery rates",
      "relationship_sentence": "AMDP’s data-driven selection step, which learns from estimated distributions and null-type proportions, is conceptually aligned with AdaPT’s adaptive threshold control."
    },
    {
      "title": "The moderator–mediator variable distinction in social psychological research",
      "authors": "Reuben M. Baron; David A. Kenny",
      "year": 1986,
      "role": "Classical joint-significance paradigm defining the mediation composite null",
      "relationship_sentence": "AMDP directly addresses the composite-null structure inherent in mediation identified by Baron–Kenny, replacing their uncalibrated joint-significance logic with principled ranking and selection."
    },
    {
      "title": "A Cauchy Combination Test for rare-variant association and other sparse signals",
      "authors": "Yuanjia Liu; Jun Xie",
      "year": 2019,
      "role": "Robust p-value combination under dependence for composite hypotheses",
      "relationship_sentence": "AMDP improves on generic p-value combination ideas (e.g., Cauchy combination) by explicitly estimating composite-null proportions and deriving an optimal ranking tailored to mediation tests."
    }
  ],
  "synthesis_narrative": "AMDP’s core innovation—an optimal ranking coupled with a data-driven selection rule that controls FDR for high-dimensional mediation under a composite null—stands at the intersection of three lines of prior work. First, the selection step is grounded in the BH paradigm for FDR control, with Storey’s adaptive approach motivating the estimation of null proportions; AMDP generalizes this adaptivity by modeling the distinct components of the mediation composite null (a = 0, b = 0, or both). Second, the ranking step draws from optimality principles developed for large-scale testing: Storey–Taylor–Siegmund’s Optimal Discovery Procedure and the Sun–Cai local-fdr framework show that likelihood-based or lfdr-based orderings maximize true discoveries under FDR constraints. AMDP translates these ideas to the mediation setting by constructing an optimal ordering that leverages the composite-null mixture and test-statistic distributions across mediators, thereby using joint information across hypotheses rather than treating them independently. Third, mediation-specific testing tradition (Baron–Kenny) and modern combination strategies (e.g., Cauchy combination) highlight the challenges of p-value calibration under composite nulls; AMDP replaces ad hoc combination with principled estimation of null-type proportions and distributional components to both rank and threshold. Finally, the adaptivity of AdaPT informs AMDP’s data-driven thresholding, ensuring asymptotic FDR control while maximizing power. Together, these works directly shape AMDP’s design: optimal (lfdr/likelihood) ranking adapted to composite nulls, and adaptive, estimation-driven thresholds for scalable, powerful FDR control in high-dimensional mediation.",
  "analysis_timestamp": "2026-01-06T23:42:49.054838"
}