{
  "prior_works": [
    {
      "title": "Global optimization with polynomials and the problem of moments",
      "authors": "Jean B. Lasserre",
      "year": 2001,
      "role": "Foundational certification framework (moment/SOS hierarchy) for polynomial global optimization",
      "relationship_sentence": "GloptiNets explicitly positions itself as a scalable alternative to Lasserre’s hierarchy, replacing algebraic moment/SOS machinery with spectral models that yield certificates while handling problems (many coefficients) intractable for SDP-based hierarchies."
    },
    {
      "title": "Semidefinite programming relaxations for semialgebraic problems",
      "authors": "Pablo A. Parrilo",
      "year": 2003,
      "role": "Introduced SOS/SDP machinery and duality for nonnegativity certificates",
      "relationship_sentence": "Parrilo’s SOS framework is the canonical route to certified bounds; GloptiNets departs from this SDP-centric approach by parameterizing certificates in the Fourier domain and optimizing them with neural-network tooling, thus avoiding heavy SDPs while retaining provable certificates."
    },
    {
      "title": "Sums of squares and semidefinite program relaxations for polynomial optimization problems with structured sparsity",
      "authors": "Hiroshi Waki, Sunyoung Kim, Masakazu Kojima, Masakazu Muramatsu",
      "year": 2006,
      "role": "Scalability advances for SOS via correlative sparsity",
      "relationship_sentence": "Efforts like sparse SOS aim to scale SDP certificates; GloptiNets addresses scalability from a different angle—exploiting spectral decay and GPU-friendly training rather than sparsity patterns—while still producing certified bounds."
    },
    {
      "title": "DSOS and SDSOS Optimization: LP and SOCP-Based Alternatives to Sum of Squares",
      "authors": "A. A. Ahmadi, Anirudha Majumdar",
      "year": 2019,
      "role": "Tractable relaxations trading SOS tightness for LP/SOCP scalability",
      "relationship_sentence": "DSOS/SDSOS exemplify the scalability–tightness tradeoff in certified optimization; GloptiNets proposes a different tractability route by leveraging Fourier smoothness to keep certificates tight yet trainable at scale on GPUs."
    },
    {
      "title": "Signomial and polynomial optimization via SAGE relaxations",
      "authors": "Riley Murray, Venkat Chandrasekaran, Adam Wierman",
      "year": 2019,
      "role": "Alternative non-SOS certificate family using relative entropy/conic programming",
      "relationship_sentence": "SAGE shows that moving beyond SOS can yield practical certified bounds; GloptiNets similarly introduces a new certificate family—spectral/FFT-based—eschewing algebraic SOS in favor of models aligned with function regularity."
    },
    {
      "title": "Positive Trigonometric Polynomials: Applications to Signal Processing",
      "authors": "Bogdan Dumitrescu",
      "year": 2007,
      "role": "Modern treatment of nonnegative trigonometric polynomials and spectral factorizations",
      "relationship_sentence": "GloptiNets relies on Fourier-domain representations on the torus; classical results on nonnegative trigonometric polynomials and their Gram/Toeplitz factorizations underpin the construction of tractable spectral certificates for global bounds."
    },
    {
      "title": "Trigonometric Series (3rd ed.)",
      "authors": "Antoni Zygmund",
      "year": 2002,
      "role": "Harmonic analysis foundation linking smoothness to Fourier coefficient decay",
      "relationship_sentence": "The core insight in GloptiNets—that smooth objectives admit rapidly decaying Fourier spectra enabling accurate truncated models with certificates—rests on classical Fourier decay results synthesized in works like Zygmund."
    }
  ],
  "synthesis_narrative": "GloptiNets reframes certified non-convex optimization by departing from algebraic SOS/moment methods toward spectral modeling matched to function regularity. The classical foundations of certified bounds are Lasserre’s hierarchy and Parrilo’s SOS/SDP framework, which provide general-purpose certificates but struggle with scalability as the number of coefficients grows. Subsequent work on scaling these ideas—such as sparse SOS (Waki et al.) and LP/SOCP surrogates like DSOS/SDSOS (Ahmadi & Majumdar)—highlights the persistent tightness–tractability tradeoff. In parallel, SAGE relaxations (Murray, Chandrasekaran, Wierman) demonstrated that leaving the SOS paradigm can yield practical, certified alternatives tailored to problem structure. GloptiNets advances this line by constructing certificate families in the Fourier domain, leveraging harmonic analysis facts—codified in Zygmund’s treatment—that smoothness implies fast spectral decay. This justifies truncated spectral models whose approximation error can be controlled and quantified, enabling certified bounds without heavy SDPs. Practical implementability draws on the theory of nonnegative trigonometric polynomials (e.g., Dumitrescu), which connects Fourier coefficients with positive semidefinite Gram structures and spectral factorizations, guiding how to enforce nonnegativity/certification within a trainable model. By casting the search for certificates as neural-network optimization over these spectral models, GloptiNets inherits GPU scalability from deep learning toolchains while maintaining provable guarantees. Collectively, these prior works supply the certification philosophy (SOS/moments), the motivation to seek scalable alternatives (sparse SOS, DSOS/SDSOS, SAGE), and the spectral theory enabling GloptiNets’ Fourier-based certified optimization.",
  "analysis_timestamp": "2026-01-07T00:02:04.800912"
}