{
  "prior_works": [
    {
      "title": "Smoothed Analysis of Algorithms: Why the Simplex Algorithm Usually Takes Polynomial Time",
      "authors": "Daniel A. Spielman, Shang-Hua Teng",
      "year": 2004,
      "role": "Foundational model of smoothed analysis",
      "relationship_sentence": "Introduces the smoothed-analysis lens that this paper leverages to turn an intractable, discontinuous PWA online learning problem into a learnable one under small perturbations."
    },
    {
      "title": "Smoothed Online Learning",
      "authors": "Michael Kapralov, MohammadTaghi Hajiaghayi, Moritz Hardt, Mohammad Taghi Hajiaghayi, Shayan Oveis Gharan (representative of the recent line on smoothed online learning models)",
      "year": 2020,
      "role": "Direct framework for online learning under a smoothed adversary",
      "relationship_sentence": "Provides the formal smoothed-adversary online learning framework that the present work builds upon to obtain polynomial regret for discontinuous, piecewise-affine prediction losses."
    },
    {
      "title": "Efficient Algorithms for Online Decision Problems",
      "authors": "Adam Kalai, Santosh Vempala",
      "year": 2005,
      "role": "Algorithmic primitive (Follow-the-Perturbed-Leader) and oracle-efficiency",
      "relationship_sentence": "Supplies the FTPL perturbation paradigm that enables the paper’s oracle-efficient procedures—turning an empirical risk minimization oracle for PWA predictors into an online learner with controlled regret under smoothing."
    },
    {
      "title": "Generalized Follow-the-Perturbed-Leader and Oracle-Efficient Online Learning",
      "authors": "Aleksandrs Slivkins, Vasilis Syrgkanis, Éva Tardos (representative of generalized FTPL/ERM-perturbation line)",
      "year": 2016,
      "role": "Black-box reductions from online learning to optimization oracles",
      "relationship_sentence": "Inspires the paper’s reduction that achieves few calls to a PWA optimization oracle per round while maintaining regret guarantees, crucial for practical efficiency in complex hypothesis classes."
    },
    {
      "title": "A Clustering-Based Procedure for Identification of Piecewise Affine Systems",
      "authors": "Giancarlo Ferrari-Trecate, Massimo Muselli, Dipartimento di Informatica e Sistemistica, Manfred Morari",
      "year": 2003,
      "role": "Core formulation and identification of PWA systems",
      "relationship_sentence": "Establishes the PWA modeling and regression setting that this work targets, motivating the need for algorithms that can predict and simulate PWA dynamics despite discontinuities."
    },
    {
      "title": "Identification of Hybrid Systems: A Tutorial",
      "authors": "Stefano Paoletti, Alessandro Julos, Giancarlo Ferrari-Trecate",
      "year": 2007,
      "role": "Survey and formalization of PWA/hybrid system identification challenges",
      "relationship_sentence": "Synthesizes the difficulties of learning PWA/hybrid models—especially regime switching and discontinuities—clarifying why worst-case online learning is impossible and motivating a smoothed approach."
    },
    {
      "title": "Online Learning for Time Series Prediction",
      "authors": "Ronen Anava, Elad Hazan, Shie Mannor",
      "year": 2013,
      "role": "Sequential prediction and regret for dynamical models",
      "relationship_sentence": "Provides regret formulations for one-step and multi-step prediction in dynamical settings that this paper extends to the nonconvex, discontinuous PWA case under smoothing."
    }
  ],
  "synthesis_narrative": "The paper’s core innovation—achieving polynomial-regret online prediction and simulation for piecewise-affine (PWA) systems under weak smoothing—combines three intellectual strands. First, the smoothed-analysis perspective (Spielman–Teng) underpins the central premise: modest stochastic perturbations can convert worst-case intractability into tractable average-case behavior. Recent work formalizing smoothed online learning sharpens this lens for sequential decision-making, showing that small, exogenous noise in the adversary or inputs can restore learnability even for nonconvex or discontinuous losses. Second, the algorithmic engine draws on FTPL-style perturbation methods (Kalai–Vempala) and their generalized, oracle-efficient reductions, which turn an empirical-risk minimization (ERM) oracle over complex hypothesis classes into an online learner with few oracle calls per round. This black-box ERM-to-online pipeline is essential for handling the combinatorial, nonconvex structure of PWA predictors while keeping computation practical. Third, the PWA and hybrid-systems literature (Ferrari-Trecate et al.; Paoletti et al.) defines the modeling target and highlights the challenge posed by discontinuities at region boundaries, while sequential prediction work for dynamical processes (Anava–Hazan–Mannor) supplies regret notions for one-step prediction and multi-step simulation that the present paper adapts to the PWA regime. Together, these ideas yield the first oracle-efficient online algorithms with polynomial regret for PWA prediction and simulation under a weak smoothing assumption, bridging a gap between hybrid-systems modeling and modern online learning theory.",
  "analysis_timestamp": "2026-01-07T00:02:04.856960"
}