{
  "prior_works": [
    {
      "title": "Subjectivity and Correlation in Randomized Strategies",
      "authors": "Robert J. Aumann",
      "year": 1974,
      "role": "Foundational equilibrium concept (correlated equilibrium and its polyhedral characterization)",
      "relationship_sentence": "The paper’s generalized equilibrium reduces to (and is motivated by) the polyhedral constraints defining correlated equilibria when both players enforce swap/internal regret, anchoring the authors’ polytope-of-feasible-values view."
    },
    {
      "title": "A Simple Adaptive Procedure Leading to Correlated Equilibrium",
      "authors": "Sergiu Hart, Andreu Mas-Colell",
      "year": 2000,
      "role": "Behavioral link from no-internal/swap regret to correlated equilibrium",
      "relationship_sentence": "This work establishes that no-internal/swap-regret learning converges to correlated equilibrium, providing the behavioral foundation for imposing regret constraints as equilibrium-defining conditions in the present paper."
    },
    {
      "title": "From External to Internal Regret",
      "authors": "Avrim Blum, Yishay Mansour",
      "year": 2007,
      "role": "Algorithmic constructions for swap/internal (φ-) regret",
      "relationship_sentence": "By giving efficient reductions and algorithms to ensure swap/internal regret against arbitrary opponents, this paper underwrites the authors’ claim that any generalized equilibrium point is reachable by learners maintaining specified regret guarantees."
    },
    {
      "title": "An Analog of the Minimax Theorem for Vector Payoffs",
      "authors": "David Blackwell",
      "year": 1956,
      "role": "Foundational approachability theory for vector payoffs",
      "relationship_sentence": "Blackwell’s approachability provides the geometric framework for viewing regret/payoff constraints as approachable sets, directly enabling the paper’s polyhedral feasibility and reachability arguments."
    },
    {
      "title": "Blackwell Approachability and No-Regret Learning Are Equivalent",
      "authors": "Jacob Abernethy, Peter L. Bartlett, Elad Hazan",
      "year": 2011,
      "role": "Bridge between approachability and no-regret online learning",
      "relationship_sentence": "The equivalence formalized here lets the authors translate regret constraints into approachability of convex polytopes, supporting their proofs that generalized equilibria are achievable by regret-minimizing algorithms."
    },
    {
      "title": "Computing the Optimal Strategy to Commit To",
      "authors": "Vincent Conitzer, Tuomas Sandholm",
      "year": 2006,
      "role": "Modeling and computation of Stackelberg (commitment) equilibria",
      "relationship_sentence": "This classic Stackelberg formulation underlies the paper’s central example, where an asymmetric regret profile (no-swap vs unconstrained) recovers an extension of Stackelberg equilibria with matching optimal value."
    },
    {
      "title": "Leadership with Commitment to Mixed Strategies",
      "authors": "Bernhard von Stengel, Shmuel Zamir",
      "year": 2010,
      "role": "Theory of leadership/commitment outcomes in mixed strategies",
      "relationship_sentence": "Their characterization of leadership payoffs connects directly to the paper’s identification of generalized equilibria under asymmetric regret as a commitment-like outcome generalizing Stackelberg."
    }
  ],
  "synthesis_narrative": "The paper’s core contribution—generalized equilibria defined by asymmetric regret constraints and characterized as polytopes that are attainable by regret-minimizing algorithms—builds on two intertwined lines: learning-to-equilibrium via regret minimization and commitment/leadership outcomes in games. Aumann’s correlated equilibrium and its linear constraints supply the polyhedral template; when both players enforce swap/internal regret, the generalized equilibrium collapses to the correlated equilibrium set. Hart and Mas-Colell’s result that no-internal/swap-regret dynamics converge to correlated equilibrium provides the behavioral rationale for encoding equilibrium through regret constraints. Blum and Mansour’s constructions for internal/swap (φ-) regret ensure that these constraints can be met efficiently against arbitrary opponents, justifying the reachability claims.\nBlackwell’s approachability theory, together with the Abernethy–Bartlett–Hazan equivalence between approachability and no-regret learning, furnishes the geometric machinery to treat regret targets as approachable convex sets, yielding the paper’s polytope-of-feasible-values characterization and the existence of algorithms that realize any point within it. On the game-theoretic side, Conitzer and Sandholm’s Stackelberg framework and von Stengel–Zamir’s analysis of leadership with mixed strategies ground the paper’s key asymmetric case (one no-swap learner, one unconstrained opponent) as an extension of Stackelberg with matching value. By unifying these strands, the paper shows how altering regret constraints reshapes attainable payoffs, and explains why deviating from standard no-swap learning against a no-swap opponent can strictly improve utility in broad classes of games without pure Nash equilibria.",
  "analysis_timestamp": "2026-01-07T00:02:04.837156"
}