{
  "prior_works": [
    {
      "title": "Adjusting the Outputs of a Classifier to New a Priori Probabilities: A Simple Procedure",
      "authors": "M. Saerens, P. Latinne, C. Decaestecker",
      "year": 2002,
      "role": "Foundational label-shift correction (EM-based) showing how to adapt predictions when class priors change but conditionals are fixed",
      "relationship_sentence": "This paper provides the classical label-shift formulation and EM-style adjustment that the present work generalizes to an online, drifting setting with regret guarantees."
    },
    {
      "title": "Detecting and Correcting for Label Shift with Black Box Predictors",
      "authors": "Zachary C. Lipton, Yu-Xiang Wang, Alexander J. Smola",
      "year": 2018,
      "role": "Black-box shift estimation (BBSE) linking classifier confusion matrices to class-prior estimation from unlabeled data",
      "relationship_sentence": "The core reduction in the NeurIPS 2023 paper—estimating time-varying class proportions via regression/oracles—builds directly on BBSE’s idea of recovering label proportions from predictions, extending it to online drift with dynamic-regret-optimal procedures."
    },
    {
      "title": "Counting positives accurately despite inaccurate classification",
      "authors": "George Forman",
      "year": 2005,
      "role": "Early quantification under prior/label shift via adjusted classify-and-count",
      "relationship_sentence": "Forman’s adjusted-count quantification highlights the practicality of estimating class prevalences from predictions, a principle the paper operationalizes online by bootstrapping regression oracles to track drifting priors."
    },
    {
      "title": "Non-stationary Stochastic Optimization",
      "authors": "Omar Besbes, Yonatan Gur, Assaf Zeevi",
      "year": 2015,
      "role": "Variation-budget framework and optimal dynamic regret rates for nonstationary problems",
      "relationship_sentence": "The target of achieving optimal dynamic regret with respect to the drift magnitude is grounded in this work’s variation-budget theory, which the paper adapts to label-shift tracking without prior knowledge of the drift."
    },
    {
      "title": "Online Convex Programming and Generalized Infinitesimal Gradient Ascent",
      "authors": "Martin Zinkevich",
      "year": 2003,
      "role": "Foundational OCO framework and tracking/static regret baselines",
      "relationship_sentence": "The algorithms’ online optimization backbone and regret analysis build upon OCO principles introduced here, serving as the base upon which dynamic-regret-aware tracking of class proportions is developed."
    },
    {
      "title": "Tracking the Best Expert",
      "authors": "Mark Herbster, Manfred K. Warmuth",
      "year": 1998,
      "role": "Shifting comparator and tracking-regret paradigm",
      "relationship_sentence": "The notion of tracking a changing target (here, drifting class priors) is rooted in this work’s shifting comparator framework, which informs the paper’s design of procedures that adapt to time-varying proportions."
    },
    {
      "title": "Taming the Monster: A Fast and Simple Algorithm for Contextual Bandits",
      "authors": "Alekh Agarwal, Daniel Hsu, Satyen Kale, John Langford, Lihong Li, Robert E. Schapire",
      "year": 2014,
      "role": "Oracle-based reductions to supervised learning/regression in online settings",
      "relationship_sentence": "The paper’s reduction of online adaptation under label shift to calling online regression oracles is directly inspired by oracle-reduction methodology exemplified here, motivating the practical, plug-and-play design."
    }
  ],
  "synthesis_narrative": "The paper’s core innovation—reducing online label-shift adaptation to online regression while attaining optimal dynamic regret without knowing the drift—sits at the intersection of label-shift quantification and nonstationary online optimization. Classical label-shift correction methods (Saerens et al., 2002) establish the problem setting and the feasibility of adapting predictions when only class priors drift. Black-Box Shift Estimation (Lipton et al., 2018) crystallizes a practical route: infer class proportions from black-box predictions via confusion-matrix-based relationships, a key conceptual stepping stone to the paper’s regression-based estimation of time-varying priors from unlabeled streams. Early quantification methods like Forman (2005) underscore the practicality of prevalence estimation from classifier outputs, which the present work operationalizes in an online manner by bootstrapping regression oracles.\nOn the online learning side, the paper’s regret targets rely on the nonstationary optimization literature. Besbes, Gur, and Zeevi (2015) provide the variation-budget lens and optimal dynamic-regret rates that guide the theory here, while Zinkevich (2003) and Herbster & Warmuth (1998) supply the OCO and tracking-comparator foundations for adapting to drifting targets. Finally, the design choice to reduce the adaptation task to online regression oracles is inspired by oracle-based reductions from contextual bandits (Agarwal et al., 2014), enabling practical algorithms with strong guarantees. Together, these strands directly inform both the algorithmic reduction and the dynamic-regret-optimal analysis achieved in the paper.",
  "analysis_timestamp": "2026-01-06T23:33:36.297813"
}