{
  "prior_works": [
    {
      "title": "Bayesian Poisson Tensor Factorization for Inferring Multilateral Relations",
      "authors": "Andrew R. Schein, John Paisley, David M. Blei, Hanna M. Wallach",
      "year": 2015,
      "role": "Probabilistic tensor factorization for sparse multiway count data",
      "relationship_sentence": "Established a principled Poisson CP framework for sparse tensors, motivating DEMOTE’s focus on handling sparse tensor observations while learning latent factors that explain multiway interactions."
    },
    {
      "title": "Dynamic Poisson Factorization",
      "authors": "Laurent Charlin, Rajesh Ranganath, James McInerney, David M. Blei",
      "year": 2015,
      "role": "Dynamic latent factor model for temporally evolving preferences",
      "relationship_sentence": "Showed how temporal state-space priors yield evolving embeddings from sparse, time-stamped data, which DEMOTE generalizes by learning continuous-time entity trajectories with graph-coupled dynamics."
    },
    {
      "title": "Temporal Regularized Matrix Factorization for High-dimensional Time Series Prediction",
      "authors": "Hsiang-Fu Yu, Nikhil Rao, Inderjit S. Dhillon",
      "year": 2016,
      "role": "Time-aware factorization with autoregressive temporal smoothness",
      "relationship_sentence": "Inspired DEMOTE’s core idea of explicitly modeling temporal structure in latent factors, replacing hand-crafted AR regularizers with a learned neural reaction term and diffusion coupling."
    },
    {
      "title": "Graph Convolutional Matrix Completion",
      "authors": "Rianne van den Berg, Thomas N. Kipf, Max Welling",
      "year": 2018,
      "role": "Graph-based propagation on user–item bipartite graphs for sparse observations",
      "relationship_sentence": "Motivated DEMOTE’s construction of a multi-partite graph from observed tensor entries and the use of graph propagation to denoise and share information across sparsely observed entities."
    },
    {
      "title": "Diffusion Improves Graph Learning",
      "authors": "Johannes Klicpera, Aleksandar Bojchevski, Stephan Günnemann",
      "year": 2019,
      "role": "Diffusion-based propagation (e.g., personalized PageRank) for capturing long-range dependencies",
      "relationship_sentence": "Provided the diffusion paradigm that DEMOTE adapts to co-evolve correlated entity embeddings via graph Laplacian-driven smoothing over the multi-partite interaction graph."
    },
    {
      "title": "Neural Ordinary Differential Equations",
      "authors": "Ricky T. Q. Chen, Yulia Rubanova, Jesse Bettencourt, David Duvenaud",
      "year": 2018,
      "role": "Continuous-time neural dynamics",
      "relationship_sentence": "Underpins DEMOTE’s modeling of embedding trajectories as solutions to learned differential equations, enabling continuous-time evolution with data-driven reaction terms."
    },
    {
      "title": "Latent Ordinary Differential Equations for Irregularly-Sampled Time Series",
      "authors": "Yulia Rubanova, Tian Qi Chen, David Duvenaud",
      "year": 2019,
      "role": "Latent ODEs for sparse, irregular temporal observations",
      "relationship_sentence": "Directly motivates DEMOTE’s ability to learn smooth latent trajectories from sparsely and irregularly observed entries, aligning with its neural reaction process per entity."
    }
  ],
  "synthesis_narrative": "DEMOTE’s core contribution—estimating dynamic embeddings for tensor entities via a neural diffusion–reaction process on a multi-partite graph—sits at the intersection of three lines of work. First, probabilistic tensor and matrix factorization for sparse data (Schein et al., 2015; Charlin et al., 2015; Yu et al., 2016) established that temporal structure and appropriate likelihoods are crucial when observations are sparse and time-stamped. These works introduced temporal priors or autoregressive regularization to encourage smooth factor evolution, but relied on hand-crafted dynamics and did not explicitly couple entities through observed interaction structure.\nSecond, graph-based recommendation and diffusion methods (van den Berg et al., 2018; Klicpera et al., 2019) showed that constructing graphs from observations and propagating information over these graphs is an effective remedy for sparsity. DEMOTE generalizes the bipartite user–item graph to a multi-partite graph induced by tensor entries and replaces discrete GCN-style layers with continuous diffusion, allowing correlated entities across modes to co-evolve.\nThird, continuous-time neural dynamics (Chen et al., 2018; Rubanova et al., 2019) provided the machinery to learn trajectories from irregular, sparse temporal signals. DEMOTE instantiates this by using a neural reaction term per entity to capture idiosyncratic evolution, while a graph diffusion term captures shared trends across related entities. By fusing temporal factorization, graph diffusion, and neural ODEs, DEMOTE yields a principled, data-driven dynamic tensor decomposition that captures both commonalities and personalities in entity evolution under extreme sparsity.",
  "analysis_timestamp": "2026-01-06T23:42:48.042313"
}