{
  "prior_works": [
    {
      "title": "Dyna: An Integrated Architecture for Learning, Planning, and Reacting",
      "authors": "Richard S. Sutton",
      "year": 1990,
      "role": "Experience augmentation via model-generated samples",
      "relationship_sentence": "Introduces generating additional training transitions from a (known or learned) dynamics model, which this paper echoes by exploiting pseudo-deterministic transitions to create augmented samples that accelerate learning."
    },
    {
      "title": "Tree-Based Batch Mode Reinforcement Learning (Fitted Q-Iteration)",
      "authors": "Damien Ernst, Pierre Geurts, Louis Wehenkel",
      "year": 2005,
      "role": "Algorithmic foundation (FQI)",
      "relationship_sentence": "Provides the Fitted Q-Iteration framework that the paper instantiates and studies, serving as the backbone for the sample-complexity analysis under augmented sampling."
    },
    {
      "title": "Learning Near-Optimal Policies with Fitted Q-Iteration",
      "authors": "András Antos, Csaba Szepesvári, Rémi Munos",
      "year": 2008,
      "role": "Finite-sample analysis and coverage conditions for FQI",
      "relationship_sentence": "Supplies error-propagation and concentrability tools for batch RL that the paper adapts to show how augmented samples relax coverage requirements to only the stochastic-state component."
    },
    {
      "title": "Efficient Reinforcement Learning in Factored MDPs",
      "authors": "Michael Kearns, Daphne Koller",
      "year": 1999,
      "role": "Structural exploitation of dynamics",
      "relationship_sentence": "Demonstrates how leveraging known conditional structure reduces sample complexity, directly paralleling the paper’s use of mixed systems where pseudo-stochastic states are deterministic given stochastic components."
    },
    {
      "title": "PEGASUS: A Policy Search Method for Large MDPs and POMDPs",
      "authors": "Andrew Y. Ng, Michael I. Jordan",
      "year": 2000,
      "role": "Deterministic simulative models and exogenous randomness",
      "relationship_sentence": "Formalizes viewing transitions as deterministic functions of state, action, and exogenous noise, a lens the paper uses to define mixed systems and generate consistent augmented samples."
    },
    {
      "title": "When to Trust Your Model: Model-Based Policy Optimization (MBPO)",
      "authors": "Michael Janner, Justin Fu, Marvin Zhang, Sergey Levine",
      "year": 2019,
      "role": "Model-based rollouts for sample efficiency",
      "relationship_sentence": "Shows that short, model-consistent rollouts can greatly improve sample efficiency, conceptually motivating the paper’s model-free yet structure-driven augmented sampling strategy."
    },
    {
      "title": "Stability properties of constrained queueing systems and scheduling policies for maximum throughput in multihop radio networks",
      "authors": "Leandros Tassiulas, Anthony Ephremides",
      "year": 1992,
      "role": "Queueing-network dynamics and application backdrop",
      "relationship_sentence": "Establishes queue evolution as deterministic given exogenous arrivals and service, directly inspiring the mixed-system abstraction and providing the application context for the paper’s algorithms."
    }
  ],
  "synthesis_narrative": "The paper’s core contribution—sample-efficient RL in mixed systems by augmenting data through deterministic pseudo-stochastic transitions—sits at the confluence of structural RL, batch RL theory, and queueing-network dynamics. From Sutton’s Dyna, it inherits the central idea that simulated or model-consistent experience can accelerate learning; here, the model is not learned but implicitly available through the deterministic mapping from stochastic to pseudo-stochastic states. PEGASUS crystallizes this perspective by treating transitions as deterministic functions of state, action, and exogenous noise, precisely the viewpoint that enables generating augmented samples consistent with the underlying randomness.\nAlgorithmically and theoretically, the work builds on Fitted Q-Iteration (Ernst et al.), employing a batch approach amenable to analysis. Finite-sample tools and concentrability-style coverage notions from the FQI literature (e.g., Antos–Szepesvári–Munos) are adapted to show that augmentation relaxes the coverage requirement to only the stochastic-state component. This mirrors classic insights from factored MDPs (Kearns–Koller): exploiting known structure can drastically reduce sample complexity.\nModern model-based rollouts (MBPO) reinforce the idea that carefully controlled, short-horizon synthetic samples can boost sample efficiency without full-blown model reliance; the present paper operationalizes an analogous benefit via exact pseudo-deterministic transitions rather than a learned model. Finally, queueing-network fundamentals (Tassiulas–Ephremides) motivate the mixed-system decomposition—exogenous stochastic arrivals with deterministic queue updates—and anchor the practical applications that showcase the method’s gains.",
  "analysis_timestamp": "2026-01-07T00:02:04.778369"
}