{
  "prior_works": [
    {
      "title": "Restless bandits: Activity allocation in a changing world",
      "authors": "Peter Whittle",
      "year": 1988,
      "role": "Foundational model and Lagrangian relaxation (single-armed decomposition) for RMABs",
      "relationship_sentence": "The paper’s Follow-the-Virtual-Advice (FtVA) hinges on simulating any single-armed policy derived from Whittle’s Lagrangian relaxation, then coordinating real actions across N arms—directly leveraging Whittle’s decomposition of the multi-armed problem into tractable single-armed control."
    },
    {
      "title": "Restless Bandits, Linear Programming Relaxations, and a Primal-Dual Index Heuristic",
      "authors": "Dimitris Bertsimas, José Niño-Mora",
      "year": 2000,
      "role": "Methodological development of LP/Lagrangian relaxations and implementable policies from single-armed surrogates",
      "relationship_sentence": "FtVA operationalizes the same relaxation-to-implementable-policy pipeline, but replaces index construction with a simulation-and-steering mechanism that converts any relaxed single-armed policy into a feasible N-armed policy with provable 1/√N optimality gap."
    },
    {
      "title": "Restless bandits, partial conservation laws and indexability",
      "authors": "José Niño-Mora",
      "year": 2001,
      "role": "Structural tools connecting single-armed problems to implementable priority rules via PCLs",
      "relationship_sentence": "By emphasizing how properties of single-armed surrogates yield implementable priority structures, this work underpins the paper’s core idea that one can start from a single-armed controller and systematically lift it to the N-armed system—here achieved through virtual simulation and controlled coupling."
    },
    {
      "title": "A Lagrangian approach to the Restless Bandit Problem",
      "authors": "Jeffrey Hawkins",
      "year": 2003,
      "role": "General Lagrangian decomposition and subsidy-for-passivity framework for constructing single-armed policies",
      "relationship_sentence": "The authors’ FtVA framework assumes access to a single-armed policy obtained via Lagrangian relaxation in Hawkins’ sense, then simulates and synchronizes it across arms, thus directly building on Hawkins’ decomposition while changing the implementation vehicle from index/priorities to simulation-based tracking."
    },
    {
      "title": "On an index policy for restless bandits",
      "authors": "Richard R. Weber, Gideon Weiss",
      "year": 1990,
      "role": "Early asymptotic optimality for many-arm RMABs and mean-field/fluid perspectives that motivate global-attractor-type arguments",
      "relationship_sentence": "The new paper targets the same large-N asymptotic regime studied by Weber–Weiss but replaces the hard-to-verify dynamical assumptions behind prior asymptotic optimality with a simulation-based construction and a weaker synchronization assumption."
    },
    {
      "title": "Asymptotic optimality of priority policies for indexable and nonindexable restless bandits",
      "authors": "I. M. Verloop",
      "year": 2016,
      "role": "Asymptotic optimality under the Uniform Global Attractor Property (UGAP) for RMABs",
      "relationship_sentence": "This work crystallized UGAP as the key assumption ensuring asymptotic optimality of index/priority policies; the NeurIPS 2023 paper’s main contribution is to break that reliance by proving an O(1/√N) gap without UGAP, via FtVA’s simulate-and-steer mechanism."
    }
  ],
  "synthesis_narrative": "The paper departs from the classic RMAB paradigm inaugurated by Whittle (1988), which uses a Lagrangian relaxation to decompose a multi-armed control problem into single-armed subproblems. Subsequent works—Bertsimas and Niño-Mora (2000), Niño-Mora (2001), and Hawkins (2003)—refined this relaxation program, offering linear-programming and partial-conservation-law tools to craft implementable policies (indices or priority rules) from single-armed surrogates. In the large-system regime, Weber and Weiss (1990) pioneered asymptotic optimality arguments for many-arm RMABs, later formalized and extended by Verloop (2016), who established asymptotic optimality under the Uniform Global Attractor Property (UGAP), a demanding dynamical assumption on the fluid/mean-field limit.\n\nThe NeurIPS 2023 paper’s key innovation—Follow-the-Virtual-Advice (FtVA)—sits squarely on this lineage but changes the implementation mechanism. Instead of deriving an index or closed-form priority from the relaxed problem, FtVA simulates any chosen single-armed policy (as enabled by Whittle/Hawkins/Bertsimas–Niño-Mora) for each arm and then carefully steers the real system toward these virtual trajectories. This simulate-and-steer construction yields a policy with an O(1/√N) optimality gap for average-reward RMABs while avoiding UGAP. In discrete time, the authors replace UGAP with a simpler synchronization assumption that still covers instances where UGAP fails. Thus, FtVA preserves the intellectual core of the single-armed relaxation approach but circumvents the traditional global-attractor bottleneck, expanding the class of RMABs admitting provably near-optimal scalable control.",
  "analysis_timestamp": "2026-01-06T23:42:49.068376"
}