{
  "prior_works": [
    {
      "title": "Interpretability Beyond Feature Attribution: Quantitative Testing with Concept Activation Vectors (TCAV)",
      "authors": "Been Kim, Martin Wattenberg, Justin Gilmer, Carrie Cai, James Wexler, Fernanda Viégas, Rory Sayres",
      "year": 2018,
      "role": "Foundational concept-based explanation method linking human concepts to model predictions",
      "relationship_sentence": "TCAV formalized concept importance via directional derivatives of concept activation vectors; the paper generalizes this importance step as a broader attribution problem and uses TCAV as a primary baseline within the unified framework."
    },
    {
      "title": "Towards Automatic Concept-based Explanations",
      "authors": "Amirata Ghorbani, Abubakar Abid, James Zou",
      "year": 2019,
      "role": "Automatic concept discovery pipeline coupled with concept-importance estimation (via TCAV)",
      "relationship_sentence": "ACE’s two-step pipeline—automatic concept extraction followed by TCAV-based importance—directly motivates the paper’s unification, which recasts ACE’s extraction as dictionary learning and its importance estimation as attribution."
    },
    {
      "title": "Network Dissection: Quantifying Interpretability of Deep Visual Representations",
      "authors": "David Bau, Bolei Zhou, Aditya Khosla, Aude Oliva, Antonio Torralba",
      "year": 2017,
      "role": "Benchmarks and metrics for aligning internal units with semantic concepts",
      "relationship_sentence": "Network Dissection introduced quantitative evaluation of concept alignment, informing the paper’s proposal of standardized metrics to assess concept extraction quality across methods."
    },
    {
      "title": "K-SVD: An Algorithm for Designing Overcomplete Dictionaries for Sparse Representation",
      "authors": "Michal Aharon, Michael Elad, Alfred Bruckstein",
      "year": 2006,
      "role": "Core dictionary learning framework",
      "relationship_sentence": "By reframing concept extraction as dictionary learning, the paper builds on K-SVD-style formulations (sparse codes, reconstruction objectives) to formally characterize and compare concept discovery methods."
    },
    {
      "title": "Axiomatic Attribution for Deep Networks (Integrated Gradients)",
      "authors": "Mukund Sundararajan, Ankur Taly, Qiqi Yan",
      "year": 2017,
      "role": "Axiomatic feature attribution method",
      "relationship_sentence": "The paper casts concept importance estimation as attribution and leverages IG’s axioms and scoring perspectives to systematize and evaluate concept-level importance measures."
    },
    {
      "title": "A Unified Approach to Interpreting Model Predictions (SHAP)",
      "authors": "Scott M. Lundberg, Su-In Lee",
      "year": 2017,
      "role": "Shapley-value-based unified attribution framework",
      "relationship_sentence": "SHAP provides a principled attribution lens that the paper’s framework extends to concept space, motivating concept-level importance as cooperative attributions and informing evaluation criteria."
    },
    {
      "title": "Grad-CAM: Visual Explanations from Deep Networks via Gradient-based Localization",
      "authors": "Ramprasaath R. Selvaraju, Michael Cogswell, Abhishek Das, Ramakrishna Vedantam, Devi Parikh, Dhruv Batra",
      "year": 2017,
      "role": "Widely used gradient-based attribution/visualization technique",
      "relationship_sentence": "As a canonical gradient-based attribution, Grad-CAM exemplifies the family of methods that the paper subsumes under its attribution view for concept importance, enabling cross-method comparisons."
    }
  ],
  "synthesis_narrative": "The paper’s core contribution is a unified view of concept-based explanations that (i) casts automatic concept extraction as dictionary learning and (ii) reframes concept importance estimation as an attribution problem. Two lines of prior work directly enable this unification. First, concept-centric methods like TCAV and ACE established the prevailing two-step pipeline: discover concepts and then quantify their influence. TCAV provided the first principled mechanism for measuring concept importance via directional derivatives of concept activation vectors, while ACE demonstrated automatic discovery of concepts with a practical pipeline that coupled clustering-based extraction with TCAV-based scoring. Second, foundational attribution research—Integrated Gradients and SHAP—introduced axiomatic, model-agnostic paradigms for assigning importance that the paper elevates to the concept level, thereby generalizing beyond TCAV to a broader family of attributions and associated evaluation criteria. Complementing these, Grad-CAM exemplifies gradient-based attribution widely used in vision, reinforcing the paper’s argument that concept importance should be treated within the attribution toolbox.\nOn the extraction side, recasting concept discovery as dictionary learning roots the problem in a mature optimization framework exemplified by K-SVD, clarifying objectives (reconstruction, sparsity) and enabling systematic comparisons across methods. Finally, Network Dissection contributed quantitative metrics for aligning internal representations with human concepts, informing the paper’s proposals for standardized evaluation of concept extraction quality. Together, these works directly shape the paper’s holistic framework and its new metrics for fair, extensible evaluation of concept-based explanations.",
  "analysis_timestamp": "2026-01-07T00:02:04.858784"
}