{
  "prior_works": [
    {
      "title": "Gradient Flows: In Metric Spaces and in the Space of Probability Measures",
      "authors": "Luigi Ambrosio, Nicola Gigli, Giuseppe Savaré",
      "year": 2005,
      "role": "Theoretical foundation (generalized Wasserstein geodesics)",
      "relationship_sentence": "The paper’s core link to Wasserstein generalized geodesics with a pivot measure directly builds on AGS’s notion of generalized geodesics; min-SWGG specializes this to pivots supported on a line, enabling their closed-form characterization and theoretical guarantees."
    },
    {
      "title": "A Convexity Principle for Interacting Gases",
      "authors": "Robert J. McCann",
      "year": 1997,
      "role": "Theoretical foundation (displacement interpolation and Monge maps)",
      "relationship_sentence": "McCann’s displacement interpolation underpins the use of transport maps along geodesics; min-SWGG mimics displacement along an optimally chosen one-dimensional projection to induce a transport map and connect the construction to geodesic paths."
    },
    {
      "title": "Sliced and Radon Wasserstein Barycenters of Measures",
      "authors": "Nicolas Bonneel, Gabriel Peyré, Marco Cuturi",
      "year": 2015,
      "role": "Foundational sliced-Wasserstein methodology and algorithms",
      "relationship_sentence": "This work established computing OT via 1D projections and sorting with O(n log n) complexity; min-SWGG leverages the same slicing-and-sorting machinery to retain SW-like complexity while enhancing it with an associated transport plan and an upper-bound relation to WD."
    },
    {
      "title": "Subspace Robust Wasserstein Distances",
      "authors": "Guillaume Paty, Marco Cuturi",
      "year": 2019,
      "role": "Projection optimization in OT",
      "relationship_sentence": "SRW introduced optimizing over linear projections/subspaces in OT; min-SWGG adopts a related projection-optimization paradigm (but minimizing over 1D directions) to obtain a computable proxy that upper-bounds WD and yields a transport plan, contrasting SRW’s lower-bound behavior."
    },
    {
      "title": "Optimal Transport for Applied Mathematicians",
      "authors": "Filippo Santambrogio",
      "year": 2015,
      "role": "Theoretical toolkit (1D OT via monotone rearrangement; geodesic properties)",
      "relationship_sentence": "The 1D OT closed-form via quantile/monotone rearrangement from this text is the key ingredient enabling min-SWGG’s fast computation and the paper’s closed-form result when one distribution is supported on a line."
    },
    {
      "title": "Sinkhorn Distances: Lightspeed Computation of Optimal Transport",
      "authors": "Marco Cuturi",
      "year": 2013,
      "role": "Computational baseline for fast, differentiable OT with transport plans",
      "relationship_sentence": "Sinkhorn provides the prevailing fast method that returns transport plans; min-SWGG positions itself as an alternative with SW-like complexity that still yields a plan, motivating comparisons in speed/accuracy and gradient-based optimization."
    }
  ],
  "synthesis_narrative": "The paper’s central idea—approximating squared Wasserstein distance by transporting along an optimally chosen one-dimensional projection and interpreting the result through generalized geodesics—rests on two pillars: geodesic theory in Wasserstein space and efficient 1D OT computations via slicing. Ambrosio–Gigli–Savaré’s formulation of generalized geodesics provides the exact conceptual scaffold for using a pivot measure; by constraining the pivot to lie on a line, the authors obtain a tractable specialization that explains the geometry of their proxy and justifies an upper-bound relation to the true WD. McCann’s displacement interpolation further legitimizes constructing transport maps along geodesic paths, which min-SWGG emulates by inducing a map after an optimal projection.\nOn the algorithmic side, Bonneel–Peyré–Cuturi’s sliced-Wasserstein machinery established that projecting onto 1D, sorting, and aggregating yields SW with O(n log n) complexity; min-SWGG preserves this efficiency but, unlike standard SW, recovers a transport plan. Santambrogio’s 1D monotone rearrangement formula is pivotal for the paper’s closed-form result when one distribution lies on a line, enabling the fast scheme and differentiability. Projection optimization ideas popularized by Paty–Cuturi’s Subspace Robust Wasserstein distances inspire the search over directions; however, min-SWGG inverts the aim—minimizing to get an upper bound and a plan instead of maximizing for a lower bound. Finally, Cuturi’s Sinkhorn distances serve as the computational and practical benchmark: min-SWGG targets a complementary regime with SW-like speed yet with transport plans, making it suitable for gradient-based learning while tightening the link to true OT through its geodesic interpretation.",
  "analysis_timestamp": "2026-01-06T23:42:49.126720"
}