{
  "prior_works": [
    {
      "title": "On the Sample Complexity of the Linear Quadratic Regulator",
      "authors": "Sarah Dean, Horia Mania, Nikolai Matni, Benjamin Recht, Stephen Tu",
      "year": 2018,
      "role": "Estimation-to-control linkage in LQR",
      "relationship_sentence": "This work precisely relates parameter estimation error to excess control cost in LQR, providing the prototype sensitivity-to-cost pathway that the NeurIPS 2023 paper generalizes from linear-quadratic systems to nonlinear dynamics when defining which parameters are most control-relevant."
    },
    {
      "title": "Certainty Equivalent Control Is Efficient for Linear Quadratic Regulation",
      "authors": "Horia Mania, Stephen Tu, Benjamin Recht",
      "year": 2019,
      "role": "Baseline: uniform model learning then control",
      "relationship_sentence": "By showing that explore-then-certainty-equivalent control can be efficient when a uniformly accurate model is learned, this paper supplies the baseline paradigm that the NeurIPS work contrasts with—arguing for task-focused (control-relevant) exploration rather than uniform accuracy in nonlinear systems."
    },
    {
      "title": "Agnostic System Identification for Model-based Reinforcement Learning",
      "authors": "Stéphane Ross, J. Andrew Bagnell",
      "year": 2012,
      "role": "Task-aware model learning",
      "relationship_sentence": "Introduces the idea of learning models tailored to downstream control performance rather than pure predictive accuracy, a conceptual precursor to the NeurIPS paper’s formalization of parameter relevance via the sensitivity of optimal control cost."
    },
    {
      "title": "Goal-Oriented Optimal Design of Experiments for Large-Scale Bayesian Linear Inverse Problems",
      "authors": "Patrick Alexanderian, Noemi Petra, Georg Stadler, Omar Ghattas",
      "year": 2014,
      "role": "Goal-oriented OED (QoI-focused Fisher information)",
      "relationship_sentence": "Develops optimal experimental design that targets uncertainty reduction in a specific quantity of interest; the NeurIPS paper adopts this goal-oriented perspective by targeting uncertainty in cost-relevant parameter directions when designing exploration for control."
    },
    {
      "title": "Simulation-Based Optimal Bayesian Experimental Design for Nonlinear Systems",
      "authors": "Xun Huan, Youssef M. Marzouk",
      "year": 2013,
      "role": "Nonlinear OED foundations and asymptotics",
      "relationship_sentence": "Provides tools for optimal experimental design in nonlinear dynamical models, including Fisher-information and Laplace approximations, which underlie the NeurIPS paper’s control-aware exploration design and its use of asymptotic variance bounds."
    },
    {
      "title": "Learning an LTI System from a Single Trajectory",
      "authors": "Vasileios Tsiamis, George J. Pappas",
      "year": 2019,
      "role": "Input design and identification under dynamical dependence",
      "relationship_sentence": "Analyzes identification and excitation for dynamical systems from time-correlated data, informing the NeurIPS paper’s design of informative input trajectories to optimize control-relevant Fisher information over finite horizons."
    },
    {
      "title": "Optimal experiment design and some of its applications to identification for control",
      "authors": "Luc Pronzato",
      "year": 2008,
      "role": "Experiment design for control-oriented identification",
      "relationship_sentence": "Surveys and develops optimal input/experiment design with an eye to control performance, directly motivating the NeurIPS paper’s emphasis on exploration policies that minimize uncertainty in parameters that matter most for control cost."
    }
  ],
  "synthesis_narrative": "The NeurIPS 2023 paper’s core idea—designing exploration that minimizes uncertainty specifically in parameters that determine control performance for nonlinear dynamical systems—sits at the intersection of control-aware system identification and goal-oriented optimal experimental design. On the control side, the LQR literature established the template for translating model error into excess control cost: Dean et al. quantify how identification error propagates to regret, while Mania–Tu–Recht show that certainty-equivalent control can be efficient if one learns a uniformly accurate model. These works supply the estimation-to-control sensitivity map and the uniform-model-learning baseline that the new paper challenges. Ross–Bagnell sharpen this direction by advocating task-aware model learning, arguing that models should be judged by downstream control performance rather than pure predictive fidelity—a conceptual stance the NeurIPS paper formalizes for nonlinear systems via cost-sensitivity to parameters.\nFrom the experimental design side, Alexanderian et al. introduced goal-oriented OED, which targets uncertainty reduction in a quantity of interest; Huan–Marzouk provide the nonlinear OED machinery (Fisher information, Laplace approximations) needed to operationalize such goals in nonlinear dynamics. Pronzato’s survey ties OED to control-oriented identification, and Tsiamis–Pappas contribute finite-horizon, time-correlated identification and excitation insights essential for designing informative input trajectories. Integrating these strands, the NeurIPS paper defines a control-relevant sensitivity metric for nonlinear systems and prescribes exploration policies that are information-theoretically optimal for reducing uncertainty in those directions, thereby extending LQR-era estimation-to-control analyses and goal-oriented OED to the nonlinear control setting.",
  "analysis_timestamp": "2026-01-06T23:42:49.083024"
}