{
  "prior_works": [
    {
      "title": "Foundations of the Theory of Probability (Grundbegriffe der Wahrscheinlichkeitsrechnung)",
      "authors": [
        "Andrey N. Kolmogorov"
      ],
      "year": 1933,
      "role": "Foundational probability axioms",
      "relationship_sentence": "The paper explicitly builds its axiomatisation of causality on Kolmogorov’s measure-theoretic foundation, extending a probability space by adding intervention-aware transition kernels to form a “causal space.”"
    },
    {
      "title": "Causality: Models, Reasoning, and Inference (2nd ed.)",
      "authors": [
        "Judea Pearl"
      ],
      "year": 2009,
      "role": "Interventional semantics and SCM framework",
      "relationship_sentence": "Pearl’s do-calculus and structural causal models provide the interventional semantics that the authors generalize by encoding interventions as modifications of measure-theoretic causal kernels rather than deterministic structural equations."
    },
    {
      "title": "Causal inference without counterfactuals",
      "authors": [
        "A. Philip Dawid"
      ],
      "year": 2000,
      "role": "Measure-theoretic, decision-theoretic interventions",
      "relationship_sentence": "Dawid’s regime-based, measure-theoretic treatment of interventions motivates representing interventions via stochastic kernels and regime changes, directly informing the paper’s kernel-centric formalization of interventions."
    },
    {
      "title": "A synthetic approach to Markov kernels, conditional independence, and theorems on sufficient statistics",
      "authors": [
        "Tobias Fritz"
      ],
      "year": 2020,
      "role": "Markov kernels as primitives",
      "relationship_sentence": "Fritz’s axiomatic treatment of probability in terms of Markov kernels underpins the choice of transition probability kernels as the primitive causal objects, enabling a compositional, measure-theoretic causal calculus."
    },
    {
      "title": "Foundations of Structural Causal Models with Cycles and Latent Variables",
      "authors": [
        "Sjoerd Bongers",
        "Patrick Forré",
        "Jonas Peters",
        "Joris M. Mooij"
      ],
      "year": 2021,
      "role": "Generalized SCMs with cycles/latents",
      "relationship_sentence": "By formalizing SCMs beyond acyclic graphs to include cycles and latent variables, this work exposes limitations of classical SCM formalisms that the causal-kernel framework addresses in a unified, measure-theoretic way."
    },
    {
      "title": "Single World Intervention Graphs (SWIGs): A Unification of the Counterfactual and Graphical Approaches to Causality",
      "authors": [
        "Thomas S. Richardson",
        "James M. Robins"
      ],
      "year": 2013,
      "role": "Unified interventional/counterfactual semantics",
      "relationship_sentence": "SWIGs’ explicit handling of interventions and counterfactual variables motivates the paper’s goal of capturing interventional structure within a single probabilistic object via causal kernels and causal spaces."
    },
    {
      "title": "Foundations of Modern Probability (2nd ed.)",
      "authors": [
        "Olav Kallenberg"
      ],
      "year": 2002,
      "role": "Measure-theoretic toolkit (kernels, disintegration, stochastic processes)",
      "relationship_sentence": "Kallenberg’s treatment of transition kernels, regular conditional probabilities, and stochastic processes provides the technical machinery that the authors leverage to define causal kernels and extend causality to processes."
    }
  ],
  "synthesis_narrative": "Park, Buchholz, Schölkopf, and Muandet position causality as an extension of Kolmogorov’s measure-theoretic probability, proposing a causal space that augments a probability space with causal (transition) kernels encoding interventional structure. Kolmogorov’s 1933 axioms supply the foundational blueprint: a rigorous probability space becomes the substrate to which causal structure is added. Kallenberg’s modern probability consolidates the needed machinery—Markov/transition kernels, regular conditional probabilities, and stochastic processes—making kernels the natural vehicle for compositional causal specification. \nPearl’s SCMs and do-calculus provide the interventional semantics to be generalized: rather than deterministic structural equations, interventions become principled kernel modifications within the same probability space. Dawid’s regime-based, measure-theoretic view of interventions further justifies modeling interventions as changes in stochastic kernels, aligning causality with standard probability without counterfactual primitives. \nFritz’s axiomatization of probability via Markov kernels shows that kernels can serve as the primitive arrows of probabilistic reasoning; the present work leverages this perspective to make causal kernels the primitive carriers of causal information. Addressing known limitations of classical frameworks, Bongers–Forré–Peters–Mooij’s generalized SCMs with cycles and latent variables motivate a framework that natively supports feedback and hidden confounding, which the authors achieve by not restricting to acyclic graphical semantics. Finally, Richardson and Robins’ SWIGs highlight the need to unify counterfactual and graphical views under explicit interventions, a goal met here by embedding intervention semantics directly into a measure-theoretic causal space. Together these works converge to a kernel-based axiomatization that unifies interventions, cycles, latents, and stochastic processes.",
  "analysis_timestamp": "2026-01-07T00:02:04.847583"
}