{
  "prior_works": [
    {
      "title": "Stability of Persistence Diagrams",
      "authors": "David Cohen-Steiner, Herbert Edelsbrunner, John Harer",
      "year": 2007,
      "role": "Foundational stability theorem for persistent homology under perturbations of functions/metrics; establishes bottleneck-distance robustness.",
      "relationship_sentence": "Topological Parallax relies on persistence summaries that are stable under small geodesic distortions, and this result provides the formal guarantee that the changes it measures in Rips-based persistence reflect genuine metric distortions rather than noise."
    },
    {
      "title": "Persistence Stability for Geometric Complexes",
      "authors": "Frédéric Chazal, Vin de Silva, Steve Oudot",
      "year": 2014,
      "role": "Shows stability of persistent homology for Vietoris–Rips and Čech filtrations with respect to perturbations of underlying metric spaces.",
      "relationship_sentence": "Because parallax compares Rips filtrations built from the dataset under the original versus model-induced metrics, this theorem underpins the method’s claim that similar geometry implies similar multiscale homology."
    },
    {
      "title": "Gromov–Hausdorff Stable Signatures for Shapes Using Persistence",
      "authors": "Frédéric Chazal, David Cohen-Steiner, Leonidas J. Guibas, Facundo Mémoli, Steve Oudot",
      "year": 2009,
      "role": "Connects persistent homology signatures with Gromov–Hausdorff–stable comparisons of metric spaces.",
      "relationship_sentence": "Parallax’s core idea—comparing the topology induced by two metrics on the same data—mirrors this work’s use of persistence as a GH-stable shape signature, motivating the parallax metric-as-signature perspective."
    },
    {
      "title": "Finding the Homology of Submanifolds with High Confidence",
      "authors": "Partha Niyogi, Stephen Smale, Shmuel Weinberger",
      "year": 2008,
      "role": "Provides statistical guarantees for recovering manifold homology from finite samples via geometric complexes.",
      "relationship_sentence": "Parallax assumes that the dataset’s sampled Rips complex captures the underlying manifold’s features; this inference guarantee legitimizes using sampled data as the reference for geometric and topological comparison."
    },
    {
      "title": "Vietoris–Rips complexes of metric spaces near a closed Riemannian manifold",
      "authors": "Janko Latschev",
      "year": 2001,
      "role": "Establishes when Rips complexes approximate the homotopy type of a manifold at appropriate scales.",
      "relationship_sentence": "The paper’s use of Rips filtrations to probe components, cycles, and voids presumes manifold-approximation properties that Latschev’s result supplies, linking multiscale homology to the data’s intrinsic geometry."
    },
    {
      "title": "A Global Geometric Framework for Nonlinear Dimensionality Reduction (Isomap)",
      "authors": "Joshua B. Tenenbaum, Vin de Silva, John C. Langford",
      "year": 2000,
      "role": "Introduces graph-based estimation of geodesic distances on sampled manifolds.",
      "relationship_sentence": "Parallax operationalizes ‘geodesic distortion’ via distances estimated on the reference dataset; Isomap’s methodology informs the practical approximation of geodesics required to instantiate the parallax comparison."
    },
    {
      "title": "Gromov–Wasserstein distances and the metric approach to object matching",
      "authors": "Facundo Mémoli",
      "year": 2011,
      "role": "Develops a framework for comparing metric-measure spaces through correspondences and distortion.",
      "relationship_sentence": "Viewing the trained model as inducing a new metric on the data, parallax inherits the GW/GH philosophy of comparing spaces by metric distortion, adapting it to topological signatures computed via Rips complexes."
    }
  ],
  "synthesis_narrative": "Topological Parallax positions a trained model and a reference dataset as two closely related metric spaces on the same point cloud: the original data metric and a model-induced, possibly distorted, geodesic metric. Converting these metrics into Vietoris–Rips filtrations and comparing their persistent homology requires two pillars: that Rips captures the manifold’s multiscale topology and that these summaries behave stably under metric perturbations. Latschev’s result justifies using Rips to approximate manifold topology at appropriate scales, while Niyogi–Smale–Weinberger provides statistical assurance that finite samples recover the correct homology. The robustness of the parallax comparison follows from the stability of persistence diagrams (Cohen-Steiner–Edelsbrunner–Harer) and, more specifically for geometric complexes, from Chazal–de Silva–Oudot’s stability theorems, which ensure that small metric distortions yield small changes in Rips-based persistence. Chazal–Cohen-Steiner–Guibas–Mémoli–Oudot further anchor the approach by showing that persistence signatures can be made stable with respect to Gromov–Hausdorff perturbations, aligning directly with parallax’s goal of using topology as a geometry-sensitive specification. Computationally, estimating geodesic distances on sampled data is informed by Isomap’s graph-geodesic framework, enabling a practical proxy for the intrinsic metric whose distortion by the model is under scrutiny. Finally, Mémoli’s Gromov–Wasserstein viewpoint motivates comparing spaces via correspondences and distortion, conceptually framing parallax as a topological, multiscale instantiation of metric-space comparison that tests whether a model preserves the dataset’s intrinsic geometry essential for trustworthy interpolation and perturbation.",
  "analysis_timestamp": "2026-01-06T23:42:49.089016"
}