{
  "prior_works": [
    {
      "title": "Model Class Reliance: Variable Importance Measures for Any Machine Learning Model Class, from the Rashomon Perspective",
      "authors": "Aaron Fisher, Cynthia Rudin, Francesca Dominici",
      "year": 2019,
      "role": "Conceptual and methodological foundation for measuring importance over a set of near-optimal models",
      "relationship_sentence": "RID directly builds on the Rashomon-set view introduced by MCR, generalizing from interval bounds on importance across good models to a full distribution (importance over the entire Rashomon set) and coupling it with data-perturbation stability."
    },
    {
      "title": "Rashomon Curves: Characterizing the Set of Good Models",
      "authors": "Candice Semenova, Cynthia Rudin, Ronald Parr",
      "year": 2022,
      "role": "Computational/geometric characterization of Rashomon sets",
      "relationship_sentence": "RID leverages the notion that many models achieve similar predictive performance; Rashomon Curves provide tools and intuition for enumerating/characterizing these sets, which RID exploits to aggregate variable-importance across them."
    },
    {
      "title": "Random Forests",
      "authors": "Leo Breiman",
      "year": 2001,
      "role": "Canonical single-model variable-importance baseline via permutation",
      "relationship_sentence": "RID is motivated in part by the instability of single-model importances such as permutation importance from Random Forests, and replaces single-model estimates with a distribution over the set of good models."
    },
    {
      "title": "A Unified Approach to Interpreting Model Predictions (SHAP)",
      "authors": "Scott M. Lundberg, Su-In Lee",
      "year": 2017,
      "role": "Widely used model-agnostic/global importance and attribution baseline",
      "relationship_sentence": "RID is designed to wrap around existing global importance metrics like SHAP, transforming a single-model attribution into a Rashomon-set importance distribution that reflects explanatory multiplicity and stability."
    },
    {
      "title": "Stability Selection",
      "authors": "Nicolai Meinshausen, Peter Bühlmann",
      "year": 2010,
      "role": "Framework for stabilizing variable selection under data perturbations",
      "relationship_sentence": "RID adopts the principle that importance should be robust to reasonable data perturbations; it echoes stability selection’s subsampling ethos while extending it to aggregate importance across many comparably accurate models."
    },
    {
      "title": "All Models are Wrong, but Many are Useful: Variable Importance for Black-Box, Proprietary, or Misspecified Prediction Models",
      "authors": "Aaron Fisher, Cynthia Rudin, Francesca Dominici",
      "year": 2018,
      "role": "Model-agnostic permutation-based variable importance formalization",
      "relationship_sentence": "RID generalizes model-agnostic permutation importance beyond a single fitted model by defining an importance distribution across the class of near-optimal models and enforcing stability across data draws."
    }
  ],
  "synthesis_narrative": "The core contribution of the RID paper is to move from single-model variable importance—often unstable and non-generalizable—to a distribution of variable importance values computed across the entire Rashomon set of near-optimal models, while ensuring robustness under data perturbations. This advance sits squarely on the Rashomon perspective established by Fisher, Rudin, and Dominici, whose Model Class Reliance formalized measuring feature importance over classes of equally accurate models. RID extends this idea from interval bounds to a probability distribution that captures how frequently and to what extent features matter across good models. Semenova, Rudin, and Parr’s Rashomon Curves further underpin RID by characterizing and operationalizing the geometry and content of good-model sets, enabling practical aggregation over them. The paper is also a response to limitations in widely used single-model importance methods—permutation importance from Random Forests and SHAP—which RID can wrap to produce set- and data-stable assessments. Finally, the robustness ethos of Meinshausen and Bühlmann’s stability selection informs RID’s emphasis on stability to data perturbations, marrying model-set aggregation with subsampling-style reliability. Together, these works directly enable RID’s central innovation: a flexible, model-agnostic framework that outputs a stable, distributional view of variable importance across many equally valid explanations of the data.",
  "analysis_timestamp": "2026-01-06T23:33:35.591963"
}