{
  "prior_works": [
    {
      "title": "Two-photon activation of channelrhodopsin-2 at cellular resolution",
      "authors": "Christopher M. Rickgauer, William N. Tank",
      "year": 2009,
      "role": "Foundational demonstration of two-photon optogenetic activation and its spatial constraints",
      "relationship_sentence": "By establishing the feasibility and spatial spread characteristics of two-photon optogenetic activation, this work defined the core biophysical constraints that the Bayesian target optimisation model explicitly learns and compensates for to reduce off‑target stimulation."
    },
    {
      "title": "Scanless two-photon excitation of channelrhodopsin-2",
      "authors": "Efthymia Papagiakoumou, Frédéric Anselmi, et al.",
      "year": 2010,
      "role": "Introduced SLM-based scanless two-photon holography and temporal focusing",
      "relationship_sentence": "This paper inaugurated holographic, scanless two-photon photostimulation and axial confinement strategies that create the multi-target, multi-parameter control space (positions, powers) that the present work optimizes computationally."
    },
    {
      "title": "Simultaneous all-optical manipulation and recording of neural circuit activity with cellular resolution in vivo",
      "authors": "Adam M. Packer, Laura E. Russell, Henry W. P. Dalgleish, Michael Häusser",
      "year": 2015,
      "role": "Established all-optical physiology and multi-cell two-photon photostimulation in vivo",
      "relationship_sentence": "By demonstrating ensemble-level, cellular-resolution stimulation alongside imaging—and highlighting cross-talk and off-target effects—this study motivated algorithmic approaches like Bayesian target optimisation to precisely achieve desired activity patterns."
    },
    {
      "title": "Three-dimensional scanless holographic optogenetics with temporal focusing (3D-SHOT)",
      "authors": "Nicolas C. Pégard, Andrew R. Mardinly, Ian A. Oldenburg, S. Sridharan, Laura Waller, Hillel Adesnik",
      "year": 2017,
      "role": "Provided 3D holographic stimulation with independent per-target power control",
      "relationship_sentence": "By enabling flexible 3D targeting and power modulation at many sites, this work supplied the degrees of freedom (target locations and laser powers) that the current paper’s Bayesian optimisation explicitly tunes to minimize off‑target stimulation."
    },
    {
      "title": "Precise multimodal optical control of neural ensemble activity",
      "authors": "Andrew R. Mardinly, Ian A. Oldenburg, Nicolas C. Pégard, et al.",
      "year": 2018,
      "role": "Showed soma-targeted opsins and practical multi-neuron stimulation strategies",
      "relationship_sentence": "This study confronted variability in neuronal sensitivity and off-target activation in multi-cell stimulation, directly motivating a probabilistic, per-neuron response model that the present work formalizes with nonparametric Bayesian inference."
    },
    {
      "title": "Gaussian Processes for Machine Learning",
      "authors": "Carl Edward Rasmussen, Christopher K. I. Williams",
      "year": 2006,
      "role": "Foundational framework for nonparametric Bayesian regression",
      "relationship_sentence": "The paper’s core inference engine—modeling neural responses over spatial location and power with flexible uncertainty quantification—builds directly on Gaussian process methodology introduced and systematized in this monograph."
    },
    {
      "title": "Receptive field inference with localized priors (Gaussian process models)",
      "authors": "Il Memming Park, Jonathan W. Pillow",
      "year": 2011,
      "role": "Applied GP priors to infer smooth neural receptive fields from limited data",
      "relationship_sentence": "The present work adapts GP-based receptive field estimation ideas to an ‘optogenetic response field,’ leveraging smoothness and uncertainty to efficiently learn stimulation–response maps and guide Bayesian optimisation under data constraints."
    }
  ],
  "synthesis_narrative": "The key contribution of Bayesian target optimisation sits at the intersection of optical advances enabling precise multi-site two-photon stimulation and probabilistic modeling that can learn and exploit neural response structure. Early demonstrations of two-photon optogenetics (Rickgauer & Tank) defined the achievable spatial precision and revealed the challenge of light spread and variable sensitivity. Holographic, scanless stimulation and temporal focusing (Papagiakoumou et al.) then created the practical pathway to stimulate many cells simultaneously, while all-optical physiology (Packer et al.) exposed the real-world impact of off-target stimulation during ensemble control. Three-dimensional SHOT (Pégard et al.) further expanded the controllable parameter space—3D positions with per-target power modulation—making the problem of selecting powers and locations a high-dimensional optimisation task. Concurrently, soma-targeted opsins and ensemble protocols (Mardinly et al.) mitigated but did not eliminate off-target effects, underscoring the need for computational calibration that accounts for neuron-specific dose–response heterogeneity. On the modeling side, Gaussian processes (Rasmussen & Williams) provide a principled nonparametric Bayesian framework to learn smooth response surfaces with quantified uncertainty; GP-based receptive field estimation in neuroscience (Park & Pillow) showed how to extract structured neural sensitivity from sparse measurements. Building directly on these threads, the present paper formalizes an ‘optogenetic response field’ learned with GP inference and uses uncertainty-aware Bayesian optimisation to select laser powers and target locations that achieve desired population activity while actively suppressing off-target stimulation, complementing and extending the optical toolkit with a data-driven control layer.",
  "analysis_timestamp": "2026-01-06T23:42:49.075779"
}