{
  "prior_works": [
    {
      "title": "On the Problem of the Most Efficient Tests of Statistical Hypotheses",
      "authors": "Jerzy Neyman, Egon S. Pearson",
      "year": 1933,
      "role": "Statistical foundation (optimality of threshold tests)",
      "relationship_sentence": "The paper’s equivalence between budget-optimal binary contracts and optimal decision rules directly instantiates the Neyman–Pearson lemma, grounding the result that optimal incentive schemes take a likelihood-ratio threshold form."
    },
    {
      "title": "Limited Liability and Incentive Contracting with Ex-Ante Action Choices",
      "authors": "Robert D. Innes",
      "year": 1990,
      "role": "Contract theory result (threshold/option-like optimal contracts under MLRP and limited liability)",
      "relationship_sentence": "Establishes that with MLRP and limited liability, optimal contracts are monotone and often implement simple threshold (“debt/option-like”) pay schemes—precisely the structural form this paper proves for budget-optimal performance-based contracts."
    },
    {
      "title": "Moral Hazard and Observability",
      "authors": "Bengt Holmström",
      "year": 1979,
      "role": "Contract theory foundation (informativeness principle, performance-based pay)",
      "relationship_sentence": "Provides the informativeness principle and moral-hazard framework motivating performance-contingent pay; the paper adapts this logic to ML delegation by tying compensation to predictive performance signals."
    },
    {
      "title": "An Analysis of the Principal-Agent Problem",
      "authors": "Sanford J. Grossman, Oliver D. Hart",
      "year": 1983,
      "role": "General principal–agent optimization framework",
      "relationship_sentence": "Supplies the canonical principal–agent model and techniques for designing optimal contracts under moral hazard, which the paper repurposes to formalize incentive-aware delegation of learning tasks."
    },
    {
      "title": "Deep Learning Scaling is Predictable, Empirically",
      "authors": "Joel Hestness et al.",
      "year": 2017,
      "role": "Empirical scaling laws (learning curves vs. data/compute)",
      "relationship_sentence": "Demonstrates predictable power-law learning curves, enabling the paper’s empirical method of constructing near-optimal contracts from small-scale experiments that extrapolate to production regimes."
    },
    {
      "title": "Scaling Laws for Neural Language Models",
      "authors": "Jared Kaplan et al.",
      "year": 2020,
      "role": "Empirical scaling laws (performance vs. model/data/compute)",
      "relationship_sentence": "Provides robust scaling-law regularities that the paper leverages to estimate agent performance and payments under different training budgets, supporting practical contract construction."
    }
  ],
  "synthesis_narrative": "Delegated Classification fuses classic principal–agent contract theory with statistical decision theory and modern empirical scaling laws to design incentive-aware ML delegation. On the economic side, Holmström’s moral hazard framework and informativeness principle justify tying compensation to observable, performance-related signals, while Grossman and Hart provide the canonical optimization setup for deriving optimal contracts under moral hazard. Innes’s result is pivotal for the paper’s core structural claim: with monotone likelihood ratios and limited liability, optimal contracts collapse to simple threshold schemes—mirroring the debt/option-like payoffs known in incentive contracting. The paper’s most distinctive theoretical bridge connects these contract structures to Neyman–Pearson’s optimal hypothesis testing: in the binary-action case, the budget-constrained, most powerful incentive scheme is isomorphic to a likelihood-ratio test with a threshold, formally linking contract optimality to classic statistical decision rules. This equivalence both clarifies why thresholds arise and provides a principled recipe for constructing them. Practically, the authors exploit contemporary insights on learning curves and scaling laws—empirically documented by Hestness et al. and Kaplan et al.—to estimate model performance from small-scale trials and forecast outcomes at deployment scale. This enables data-efficient contract design: using limited pilot data to set thresholds and payment levels that align incentives while respecting budgets. Together, these strands yield a clean, theoretically grounded, and empirically actionable framework for delegating ML tasks to rational agents.",
  "analysis_timestamp": "2026-01-06T23:42:49.062446"
}