{
  "prior_works": [
    {
      "title": "Robust deep learning–based protein sequence design using ProteinMPNN",
      "authors": "J. Dauparas, V. B. Anishchenko, et al.",
      "year": 2022,
      "role": "Method/baseline for backbone-conditioned sequence design",
      "relationship_sentence": "FAIR generalizes the fixed-backbone inverse folding paradigm of ProteinMPNN by jointly updating both residue identities and backbone coordinates—and doing so under explicit ligand conditioning—rather than designing sequence on a static backbone."
    },
    {
      "title": "Highly accurate protein structure prediction with AlphaFold",
      "authors": "J. Jumper, R. Evans, A. Pritzel, et al.",
      "year": 2021,
      "role": "Architecture/inspiration for full-atom modeling and iterative refinement",
      "relationship_sentence": "AlphaFold’s iterative recycling and full-atom structure outputs (including sidechains) motivate FAIR’s iterative refinement loop and its coarse-to-fine transition from backbone to sidechain-level modeling."
    },
    {
      "title": "RFdiffusion: Generative protein design using diffusion models guided by structure prediction networks",
      "authors": "J. M. Watson, A. Juergens, D. Baker, et al.",
      "year": 2023,
      "role": "Methodological template for iterative denoising/refinement in protein design",
      "relationship_sentence": "RFdiffusion established iterative, denoising-style refinement for protein generation and functional-site scaffolding; FAIR adapts this spirit to pocket design with full-shot global updates and ligand-aware guidance."
    },
    {
      "title": "DiffDock: Diffusion steps, twists, and spins for molecular docking",
      "authors": "G. Corso, H. Stärk, et al.",
      "year": 2023,
      "role": "Ligand–protein 3D context modeling with equivariant diffusion",
      "relationship_sentence": "By showing that SE(3)-equivariant diffusion can capture protein–ligand geometry, DiffDock directly informs FAIR’s ligand-conditioned geometric context and iterative pose-informed refinement of pocket atoms."
    },
    {
      "title": "SE(3)-Transformer: 3D Roto-Translation Equivariant Attention Networks",
      "authors": "F. Fuchs, D. E. Worrall, V. Fischer, M. Welling",
      "year": 2020,
      "role": "Core architectural principle for equivariant 3D learning",
      "relationship_sentence": "FAIR’s joint updates of coordinates and residue features rely on SE(3)-equivariant modeling ideas introduced by SE(3)-Transformer to maintain physical consistency under rigid motions."
    },
    {
      "title": "Computational design of ligand-binding proteins with high affinity and selectivity",
      "authors": "J. L. Tinberg, S. D. Khare, et al.",
      "year": 2013,
      "role": "Foundational problem setup for de novo pocket design with full-atom packing",
      "relationship_sentence": "This Rosetta-based work crystallized the full-atom pocket design task—precise cavity shaping and sidechain packing around a ligand—which FAIR modernizes with learned, end-to-end co-design."
    },
    {
      "title": "Equivariant Diffusion for Molecule Generation in 3D",
      "authors": "E. Hoogeboom, V. Garcia Satorras, C. Vignac, M. Welling",
      "year": 2022,
      "role": "Theoretical/methodological basis for iterative denoising of 3D coordinates",
      "relationship_sentence": "FAIR’s iterative coordinate refinement is conceptually aligned with equivariant diffusion for 3D structures, leveraging denoising-style updates that respect rotational and translational symmetries."
    }
  ],
  "synthesis_narrative": "FAIR’s core innovation—a full-atom, ligand-conditioned iterative refinement framework that co-designs pocket sequence and 3D structure—sits at the intersection of three lines of prior work. First, classical de novo pocket design with Rosetta (Tinberg et al., 2013) defined the challenge of shaping cavities and packing sidechains around small molecules, establishing the need for accurate full-atom modeling. Second, the fixed-backbone inverse folding successes of ProteinMPNN (Dauparas et al., 2022) demonstrated that learned sequence design on given backbones is highly effective but lacks structural adaptability and ligand context; FAIR removes this constraint by jointly updating sequence and backbone in the presence of the ligand. Third, recent advances in structure prediction and generative modeling introduced iterative, geometry-aware refinement: AlphaFold2 (Jumper et al., 2021) validated iterative recycling and full-atom outputs, while RFdiffusion (Watson et al., 2023) showed that denoising-style refinement can generate functional proteins and scaffold sites. In parallel, SE(3)-equivariant architectures (SE(3)-Transformer; Fuchs et al., 2020) and equivariant diffusion for 3D molecules (Hoogeboom et al., 2022) provided the principled machinery to update coordinates consistently under rigid motions. DiffDock (Corso et al., 2023) specifically demonstrated that ligand–protein geometry can be captured by equivariant diffusion, motivating FAIR’s ligand-aware context modeling. Integrating these strands, FAIR adopts a coarse-to-fine, full-shot refinement strategy—from backbone to sidechains—that unifies sequence-structure co-design with explicit ligand conditioning, achieving efficient, end-to-end full-atom pocket generation.",
  "analysis_timestamp": "2026-01-06T23:42:48.043756"
}