{
  "prior_works": [
    {
      "title": "Rates of contraction of posterior distributions based on Gaussian process priors",
      "authors": "A. W. van der Vaart, J. H. van Zanten",
      "year": 2008,
      "role": "Bayesian GP contraction framework",
      "relationship_sentence": "Provides the core posterior contraction machinery for GP priors via RKHS approximation and small-ball probabilities; the present paper adapts this scheme to Matérn GPs defined intrinsically on compact Riemannian manifolds."
    },
    {
      "title": "Information rates of nonparametric Gaussian process regression",
      "authors": "A. W. van der Vaart, J. H. van Zanten",
      "year": 2011,
      "role": "Euclidean Matérn rate benchmark",
      "relationship_sentence": "Establishes sharp contraction rates for Matérn GP regression on Euclidean domains as a function of smoothness and dimension; the manifold results in the NeurIPS paper mirror these rates with intrinsic manifold dimension and matched smoothness, serving as a direct template and benchmark."
    },
    {
      "title": "Matérn Gaussian processes on Riemannian manifolds",
      "authors": "Viacheslav Borovitskiy, Alexander Terenin, Peter Mostowsky, Marc Deisenroth",
      "year": 2020,
      "role": "Intrinsic Matérn construction on manifolds",
      "relationship_sentence": "Introduces and develops the intrinsic Matérn GP on Riemannian manifolds via Laplace–Beltrami spectral/SPDE constructions; the NeurIPS paper builds directly on this definition to analyze posterior contraction rates."
    },
    {
      "title": "An explicit link between Gaussian fields and Gaussian Markov random fields: the SPDE approach",
      "authors": "Finn Lindgren, Håvard Rue, Johan Lindström",
      "year": 2011,
      "role": "SPDE representation of Matérn fields",
      "relationship_sentence": "Connects Matérn fields to fractional powers of elliptic operators; the manifold paper leverages this operator viewpoint (with the Laplace–Beltrami operator) to characterize the intrinsic Matérn prior and its associated Sobolev regularity."
    },
    {
      "title": "Nonlinear Analysis on Manifolds: Sobolev Spaces and Inequalities",
      "authors": "Emmanuel Hebey",
      "year": 1996,
      "role": "Function space groundwork on manifolds",
      "relationship_sentence": "Provides Sobolev/Bessel potential space theory and spectral characterizations on compact Riemannian manifolds; used to identify the RKHS/regularity of intrinsic Matérn priors and to execute entropy and approximation arguments on manifolds."
    },
    {
      "title": "Function spaces on subsets of R^n",
      "authors": "Arne Jonsson, Hans Wallin",
      "year": 1984,
      "role": "Trace/extension theorems for Sobolev spaces",
      "relationship_sentence": "Gives linear, bounded trace and extension operators between ambient Euclidean Sobolev spaces and spaces on lower-dimensional sets (including smooth submanifolds); the paper uses these results to compare extrinsic (restricted Euclidean) and intrinsic processes and to prove the coincidence of rates after matching smoothness."
    },
    {
      "title": "Optimal rates of convergence for nonparametric estimators",
      "authors": "Charles J. Stone",
      "year": 1982,
      "role": "Minimax benchmark for smooth functions",
      "relationship_sentence": "Establishes the n^{-2s/(2s+m)} minimax rates for s-smooth regression in m dimensions; the NeurIPS paper aligns its contraction rates with these intrinsic-dimension minimax rates to claim optimality on manifolds."
    }
  ],
  "synthesis_narrative": "The paper’s core contribution—establishing optimal posterior contraction rates for intrinsic Matérn Gaussian processes on compact Riemannian manifolds and showing that appropriately matched extrinsic Matérn priors achieve the same rate—rests on three intertwined lines of prior work. First, van der Vaart and van Zanten (2008, 2011) provide the general Bayesian GP contraction framework and sharp Euclidean Matérn rate results. Their RKHS/small-ball toolkit and smoothness–dimension trade-offs directly guide the manifold proofs and the rate formulas. Second, the operator/SPDE perspective of Matérn fields (Lindgren–Rue–Lindström, 2011) combined with the intrinsic manifold construction of Matérn GPs (Borovitskiy et al., 2020) furnishes the exact prior family analyzed here: a Laplace–Beltrami–based Matérn whose RKHS and sample path regularity can be expressed via Sobolev/Bessel potential spaces on manifolds. The necessary manifold function-space technology and spectral characterizations are provided by Hebey (1996), enabling a clean identification of the prior smoothness with manifold Sobolev scales. Third, to compare intrinsic and extrinsic priors, the paper leverages trace and extension theorems (Jonsson–Wallin, 1984) that relate Sobolev spaces in the ambient Euclidean space to those on the embedded manifold, showing rate equivalence once smoothness parameters are matched. Finally, optimality is assessed against classical minimax rates (Stone, 1982), confirming that the derived contraction rates achieve the intrinsic-dimension benchmark. Together, these works supply the prior definitions, analytical tools, and statistical benchmarks that directly enable the paper’s main theorems.",
  "analysis_timestamp": "2026-01-07T00:02:04.802388"
}