{
  "prior_works": [
    {
      "title": "NeRF: Representing Scenes as Neural Radiance Fields for View Synthesis",
      "authors": "Ben Mildenhall, Pratul P. Srinivasan, Matthew Tancik, Jonathan T. Barron, Ravi Ramamoorthi, Ren Ng",
      "year": 2020,
      "role": "representation",
      "relationship_sentence": "Introduced coordinate-based implicit fields that can be queried at arbitrary 3D points; Sounding Bodies adopts the same neural-field paradigm to model a continuous 3D sound pressure field that can be rendered at any listener position."
    },
    {
      "title": "D-NeRF: Neural Radiance Fields for Dynamic Scenes",
      "authors": "Albert Pumarola, Enric Corona, Gerard Pons-Moll, Francesc Moreno-Noguer",
      "year": 2021,
      "role": "architecture",
      "relationship_sentence": "Demonstrated conditioning neural fields on time/deformation to model non-rigid, moving subjects; Sounding Bodies analogously conditions its neural acoustic field on human body pose to capture pose-dependent scattering of speech."
    },
    {
      "title": "SMPL: A Skinned Multi-Person Linear Model",
      "authors": "Matthew Loper, Naureen Mahmood, Javier Romero, Gerard Pons-Moll, Michael J. Black",
      "year": 2015,
      "role": "representation",
      "relationship_sentence": "Provides a compact parametric representation of human body pose/shape; Sounding Bodies leverages pose parameters (via SMPL-style kinematics) as explicit conditioning to predict the body-induced 3D sound field."
    },
    {
      "title": "Further Investigations on High Order Ambisonics and Wavefield Synthesis",
      "authors": "Jérôme Daniel, Sébastien Moreau, Rozenn Nicol",
      "year": 2003,
      "role": "theory",
      "relationship_sentence": "Established higher-order ambisonics/spherical harmonic expansions for 3D sound fields; Sounding Bodies relies on this foundation for representing/reconstructing spatial sound and for rendering at arbitrary listener positions."
    },
    {
      "title": "Analysis and Design of Spherical Microphone Arrays",
      "authors": "Ben Rafaely",
      "year": 2005,
      "role": "measurement",
      "relationship_sentence": "Provides theory and practice for sampling/reconstructing sound fields with spherical arrays; directly informs Sounding Bodies’ dataset design using a dense spherical array and the processing of spatial pressure measurements."
    },
    {
      "title": "Mono2Binaural: Learning to Separate and Localize Sounds from Videos",
      "authors": "Ruohan Gao, Kristen Grauman",
      "year": 2019,
      "role": "method",
      "relationship_sentence": "Showed that learned models can infer spatial audio (binaural) from limited input and visual context; Sounding Bodies extends this idea by predicting a full 3D field from sparse headset mics plus pose, not just binaural channels."
    },
    {
      "title": "The CIPIC HRTF Database",
      "authors": "Hugo Z. K. Algazi, Richard O. Duda, Dennis M. Thompson, Carlos Avendano",
      "year": 2001,
      "role": "dataset",
      "relationship_sentence": "Popularized the notion and measurement of head-related transfer functions; Sounding Bodies generalizes from head-only HRTFs to whole-body-induced sound fields (BRTFs), using learning rather than exhaustive per-point measurements."
    }
  ],
  "synthesis_narrative": "Sounding Bodies’ key contribution—a pose-conditioned neural model that reconstructs a full 3D sound field around a speaking human from headset microphones—sits at the intersection of neural implicit representations, human pose modeling, and spatial audio theory/measurement. NeRF established the coordinate-based implicit field paradigm for continuous scene queries, and D-NeRF extended it to dynamic subjects via conditioning on time or deformation. Building on these ideas, Sounding Bodies conditions a neural acoustic field on human pose to capture pose-dependent scattering and diffraction created by limbs and torso during speech. SMPL provides the practical parameterization of human body pose/shape that makes such conditioning tractable.\n\nOn the acoustics side, Higher-Order Ambisonics (Daniel, Moreau, Nicol) and spherical harmonic theory define how 3D sound fields can be represented and rendered at arbitrary listener positions. Rafaely’s work on spherical microphone arrays underpins how to sample and reconstruct these fields in practice, directly informing the paper’s unique dataset built with a dense spherical array surrounding the talker. Prior learning-based spatialization efforts such as Mono2Binaural demonstrated that spatial cues can be inferred from limited audio plus auxiliary context; Sounding Bodies generalizes this concept from binaural outputs to a full volumetric sound field using pose instead of image cues. Finally, the CIPIC HRTF database anchored the community’s understanding of head-related filtering; the present work extends this line from head-only HRTFs to full-body acoustic effects, replacing exhaustive measurements with a learned, pose-aware field.",
  "analysis_timestamp": "2026-01-07T00:02:04.838471"
}