{
  "prior_works": [
    {
      "title": "Robust deep learning–based protein sequence design using ProteinMPNN",
      "authors": "Justas Dauparas et al.",
      "year": 2022,
      "role": "Baseline",
      "relationship_sentence": "ProteinMPNN is the leading structure-conditioned inverse folding model LM-Design directly benchmarks against; its reliance on structure alone motivates LM-Design’s core idea of injecting structural awareness into a pretrained protein language model to combine evolutionary and structural signals."
    },
    {
      "title": "Learning from Protein Structure with Geometric Vector Perceptrons",
      "authors": "Bowen Jing et al.",
      "year": 2021,
      "role": "Baseline",
      "relationship_sentence": "GVP-GNN established strong CATH 4.2/4.3 inverse-folding baselines and a geometric representation for 3D structure; LM-Design targets and surpasses these baselines by implanting a structural adapter into a sequence pLM to achieve structure-aware design."
    },
    {
      "title": "Generative Models for Graph-Based Protein Design",
      "authors": "John Ingraham et al.",
      "year": 2019,
      "role": "Foundation",
      "relationship_sentence": "This work formalized inverse protein folding as graph-based sequence design conditioned on backbone structure, defining the problem setup and training/evaluation protocol that LM-Design adopts and improves upon."
    },
    {
      "title": "Biological structure and function emerge from scaling unsupervised learning to 250 million protein sequences",
      "authors": "Alexander Rives et al.",
      "year": 2021,
      "role": "Foundation",
      "relationship_sentence": "ESM-1b demonstrated that large protein language models encode rich evolutionary and structural priors; LM-Design explicitly reprograms such a pLM (kept largely frozen) by implanting a structural adapter to harness this knowledge for structure-conditioned design."
    },
    {
      "title": "Parameter-Efficient Transfer Learning for NLP",
      "authors": "Neil Houlsby et al.",
      "year": 2019,
      "role": "Extension",
      "relationship_sentence": "LM-Design extends the adapter paradigm—small trainable modules inserted into a frozen transformer—by creating a lightweight structural adapter that injects 3D structural context into a sequence pLM for protein design."
    },
    {
      "title": "ProGen: Language Modeling for Protein Generation",
      "authors": "Ali Madani et al.",
      "year": 2020,
      "role": "Inspiration",
      "relationship_sentence": "ProGen showed that protein language models can generate realistic, functional sequences, directly inspiring LM-Design’s premise that a sequence-trained pLM can be repurposed as a protein designer when augmented with structural conditioning."
    },
    {
      "title": "Design of a novel globular protein fold with atomic-level accuracy",
      "authors": "Brian Kuhlman et al.",
      "year": 2003,
      "role": "Foundation",
      "relationship_sentence": "RosettaDesign established the structure-conditioned protein design paradigm (inverse folding); LM-Design builds in this tradition but replaces hand-crafted energy functions with a structure-informed language model."
    }
  ],
  "synthesis_narrative": "LM-Design’s core innovation is to reprogram a pretrained protein language model with a lightweight structural adapter so it can perform structure-conditioned sequence design. This builds on two complementary lines of work. First, sequence-only protein language models such as ESM-1b established that large-scale pretraining captures evolutionary and structural regularities in sequences, and ProGen demonstrated that such models can generate realistic, functional proteins—suggesting pLMs can act as protein designers. Second, the inverse folding community, from RosettaDesign through graph-based neural approaches, defined the backbone-conditioned design problem and benchmarks (e.g., CATH 4.2/4.3). In particular, Ingraham et al. framed inverse folding as graph-conditioned sequence generation, and GVP-GNN provided strong geometric baselines and canonical evaluation splits. The immediate SOTA at the time, ProteinMPNN, achieved high recovery by relying purely on structural information, exposing a key gap: structure-only models ignore the vast evolutionary knowledge embedded in pLMs. LM-Design closes this gap by importing the adapter concept from parameter-efficient transfer learning—training small modules within an otherwise frozen transformer—and specializing it to inject 3D structural cues into a sequence pLM. By combining the evolutionary priors of pLMs with explicit structural conditioning and adding iterative refinement at inference, LM-Design surpasses GVP-GNN and ProteinMPNN on standard inverse-folding benchmarks and extends effectively to complexes, realizing the long-standing goal of unifying sequence-based evolutionary information with structure-based design.",
  "analysis_timestamp": "2026-01-06T23:09:26.542297"
}