{
  "prior_works": [
    {
      "title": "A Unified Framework for Approximating and Clustering Data",
      "authors": "Dan Feldman et al.",
      "year": 2011,
      "role": "Foundation",
      "relationship_sentence": "This work introduced the modern sensitivity sampling framework and the generic sample complexity bound scaling with total sensitivity S and VC/pseudodimension d, which the present paper directly sharpens for ℓ_p subspace embeddings."
    },
    {
      "title": "Universal ε-Approximators for Integrals",
      "authors": "Michael Langberg et al.",
      "year": 2010,
      "role": "Foundation",
      "relationship_sentence": "It provided the VC-dimension–based uniform convergence machinery underpinning sensitivity sampling guarantees (i.e., the S·d dependence) that the current paper leverages and then surpasses by exploiting ℓ_p structure."
    },
    {
      "title": "New Frameworks for Offline and Streaming Coreset Constructions",
      "authors": "Vladimir Braverman et al.",
      "year": 2016,
      "role": "Gap Identification",
      "relationship_sentence": "By consolidating sensitivity-based coreset bounds and codifying the prevailing S·d barrier, this paper highlights the limitation that the present work explicitly overcomes for ℓ_p subspace embeddings when p ≠ 2."
    },
    {
      "title": "Randomized Algorithms for Least Squares Approximation",
      "authors": "Petros Drineas et al.",
      "year": 2011,
      "role": "Baseline",
      "relationship_sentence": "Leverage-score sampling here yields ℓ2 subspace embeddings with O(d log d) samples (i.e., O(S·polylog) with S=d), the lone setting previously known to beat the generic S·d bound that the current paper generalizes beyond p=2."
    },
    {
      "title": "ℓp Row Sampling by Lewis Weights",
      "authors": "Michael B. Cohen et al.",
      "year": 2015,
      "role": "Inspiration",
      "relationship_sentence": "This paper identified ℓ_p Lewis weights as the right sampling distribution for ℓ_p regression/subspace embeddings—aligning with sensitivities—providing the structural handle on S that the present work uses to derive S^{2/p} and S^{2−2/p} bounds."
    },
    {
      "title": "Low-Rank Approximation and Regression in Input Sparsity Time",
      "authors": "Kenneth L. Clarkson et al.",
      "year": 2013,
      "role": "Related Problem",
      "relationship_sentence": "By formalizing algorithmic constructions for ℓ_p subspace embeddings/regression and their geometric properties, this work set the problem template whose ℓ_p structure is exploited in the present paper’s sharper sensitivity-sampling analysis."
    }
  ],
  "synthesis_narrative": "The core innovation of Sharper Bounds for ℓ_p Sensitivity Sampling is to surpass the generic sensitivity-sampling sample complexity m ≈ S·d by proving strictly better, exponentiated dependence on the total sensitivity S for ℓ_p subspace embeddings (S^{2/p} for 1≤p<2 and S^{2−2/p} for 2<p<∞). This advances the foundational sensitivity framework of Langberg–Schulman (2010) and Feldman–Langberg (2011), which established how VC/pseudodimension converts sensitivities into coreset/sample sizes—yielding the pervasive S·d bound. Braverman–Feldman–Langberg–Schulman (2016) codified these guarantees and, implicitly, the resulting limitation: outside special cases, S·d appeared unavoidable. The present work targets precisely this gap.\nThe one precedent for beating S·d was in ℓ2 subspace embeddings via leverage-score sampling (Drineas–Mahoney–Muthukrishnan, 2011), where S=d and m=O(d log d), demonstrating that structure beyond VC can be exploited. The current paper generalizes this phenomenon to all p≠2 by harnessing ℓ_p geometry. The crucial structural bridge is Cohen–Peng (2015), which identified ℓ_p Lewis weights as the correct sampling distribution for ℓ_p regression/subspace embeddings; these weights align with point sensitivities, letting the authors express and control total sensitivity S in the ℓ_p setting. Finally, the algorithmic and geometric underpinnings of ℓ_p subspace embeddings and regression from Clarkson–Woodruff (2013) supply the problem formulation and properties the analysis leverages. Together, these works directly enable and motivate the new S-exponent bounds and the accompanying tightness results for p<2.",
  "analysis_timestamp": "2026-01-06T23:09:26.569777"
}