{
  "prior_works": [
    {
      "title": "Optimum Monte Carlo sampling using Markov chains",
      "authors": "P. H. Peskun",
      "year": 1973,
      "role": "Foundation",
      "relationship_sentence": "Established variance ordering for MCMC estimators and framed the objective of minimizing asymptotic variance, which SRRW adopts and pursues beyond fixed-kernel chains via history-dependent repellence."
    },
    {
      "title": "A note on Metropolis-Hastings kernels for general state spaces",
      "authors": "Luke Tierney",
      "year": 1998,
      "role": "Foundation",
      "relationship_sentence": "Generalized Peskun’s ordering to broad settings and linked transition kernel comparisons to asymptotic variance; SRRW’s minimal-variance claim explicitly extends this variance-reduction logic to nonlinear, history-dependent dynamics."
    },
    {
      "title": "Central limit theorem for additive functionals of reversible Markov processes and applications to simple exclusions",
      "authors": "C. Kipnis et al.",
      "year": 1986,
      "role": "Foundation",
      "relationship_sentence": "Provided the Poisson-equation/functional-CLT machinery for deriving exact asymptotic covariance of Markov-chain estimators, which SRRW adapts to obtain its explicit covariance matrix under the self-repellent nonlinear dynamics."
    },
    {
      "title": "Vertex-reinforced random walk",
      "authors": "Robin Pemantle",
      "year": 1992,
      "role": "Inspiration",
      "relationship_sentence": "Introduced random walks whose transition probabilities depend on past visit counts; SRRW directly inverts this idea to negative reinforcement (repulsion) and builds a principled, MCMC-consistent variant on general graphs."
    },
    {
      "title": "The true self-repelling motion",
      "authors": "Bálint Tóth et al.",
      "year": 1998,
      "role": "Inspiration",
      "relationship_sentence": "Formalized self-repellent dynamics and their consequences, motivating SRRW’s core mechanism of discouraging returns to frequently visited states while redesigning it to preserve a prescribed stationary distribution."
    },
    {
      "title": "Central limit theorems for adaptive and interacting Markov chains",
      "authors": "Gersende Fort et al.",
      "year": 2015,
      "role": "Extension",
      "relationship_sentence": "Developed LLN/CLT theory for history-dependent (adaptive/interacting) MCMC; SRRW extends this line by proving almost sure convergence and an exact CLT for a specific nonlinear, occupation-measure-driven self-repellent chain."
    },
    {
      "title": "Non-backtracking random walks mix faster",
      "authors": "Noga Alon et al.",
      "year": 2007,
      "role": "Related Problem",
      "relationship_sentence": "Showed that avoiding immediate backtracking reduces correlation and accelerates mixing, highlighting the benefit of anti-recurrence; SRRW generalizes this intuition to global self-repellence while rigorously preserving the target stationary law."
    }
  ],
  "synthesis_narrative": "The SRRW framework crystallizes at the intersection of variance-optimal MCMC and self-interacting random walks. Peskun’s seminal ordering and Tierney’s generalization established asymptotic-variance minimization as the central design goal for MCMC kernels and linked transition rules to estimator variance. Seeking stronger variance reduction than fixed kernels allow, the SRRW embraces a history-dependent mechanism inspired by reinforced/self-repellent walks: Pemantle’s vertex-reinforced random walk pioneered transitions driven by visitation counts, while Tóth and Werner’s self-repelling motion demonstrated how discouraging revisits can dramatically reduce self-intersections and temporal correlation. However, classic self-reinforcement/repulsion lacks guarantees of sampling from a prescribed target distribution. SRRW addresses this gap by embedding repulsion within a nonlinear MCMC construction that provably preserves the stationary distribution of an underlying base kernel. Technically, the work leverages theory for adaptive/interacting MCMC—particularly Fort, Moulines, and Priouret’s LLN/CLT results—to control history-dependent dynamics and to derive limit theorems. For the covariance analysis, SRRW adapts Kipnis–Varadhan’s Poisson-equation/functional-CLT machinery to compute exact asymptotic covariance and to show monotone variance reduction with stronger repellence. Finally, results on non-backtracking random walks by Alon et al. provide corroborating intuition that anti-recurrence reduces dependency, but SRRW advances this idea to a global, principled, variance-minimizing scheme that retains the intended stationary distribution on general graphs.",
  "analysis_timestamp": "2026-01-06T23:09:26.515480"
}