{
  "prior_works": [
    {
      "title": "Dynamic Bidding in Sponsored Search Auctions",
      "authors": "Santiago R. Balseiro et al.",
      "year": 2015,
      "role": "Foundation",
      "relationship_sentence": "Established the repeated second‑price auction model with a budget and showed the optimal shadow‑price/threshold (pacing‑style) policy under known distributions, which is the control structure this paper learns and tracks from data."
    },
    {
      "title": "Learning in Repeated Auctions with Budgets",
      "authors": "Santiago R. Balseiro et al.",
      "year": 2019,
      "role": "Baseline",
      "relationship_sentence": "Analyzed data‑driven bidding/pacing for a budget‑constrained advertiser and provided regret guarantees using a learn‑then‑track approach that requires Θ(T log T) historical samples, the sample complexity this paper compresses to a single sample while retaining O(√T) regret."
    },
    {
      "title": "Pacing Equilibrium in Auction Markets",
      "authors": "Vincent Conitzer et al.",
      "year": 2018,
      "role": "Related Problem",
      "relationship_sentence": "Formalized pacing as a robust mechanism for budget management across auctions and justified controllers that track a target spend, the operational paradigm the present work adopts while focusing on its sample complexity."
    },
    {
      "title": "Bandits with Knapsacks",
      "authors": "Ashwinkumar Badanidiyuru et al.",
      "year": 2013,
      "role": "Foundation",
      "relationship_sentence": "Provided the foundational online‑learning‑with‑budgets framework and the optimal O(√T) regret benchmark that this paper attains, now with drastically reduced data requirements."
    },
    {
      "title": "Revenue Maximization with a Single Sample",
      "authors": "Pinyan Dhangwatnotai et al.",
      "year": 2010,
      "role": "Inspiration",
      "relationship_sentence": "Showed that a single sample can suffice to set near‑optimal threshold prices in auctions, directly inspiring the paper’s core idea that one sample per period can calibrate a robust expenditure plan."
    },
    {
      "title": "Prophet Inequalities with a Single Sample",
      "authors": "Paul Dütting et al.",
      "year": 2017,
      "role": "Inspiration",
      "relationship_sentence": "Demonstrated single‑sample thresholding achieves strong performance guarantees under uncertainty, motivating the paper’s single‑sample construction of spending thresholds that yield O(√T) regret."
    },
    {
      "title": "Fast Algorithms for Online Stochastic Convex Programming",
      "authors": "Shipra Agrawal et al.",
      "year": 2014,
      "role": "Gap Identification",
      "relationship_sentence": "Representative of learn‑then‑commit/track methods in online resource allocation that rely on large training phases (often Θ(T log T) samples) to estimate dual prices; the present work pinpoints and removes this heavy sample requirement for budget pacing."
    }
  ],
  "synthesis_narrative": "The paper’s core contribution—showing that a single historical sample suffices to learn a target expenditure plan that delivers optimal O(√T) regret—rests on two converging lines of work. First, the problem formulation and controller come from the budgeted repeated-auction literature. Balseiro, Besbes, and Weintraub identified the shadow-price/threshold structure as optimal under known distributions, and subsequent work on learning in repeated auctions with budgets adopted a learn-then-track blueprint with regret guarantees but required Θ(T log T) samples to fit stable spending plans. Pacing as a market mechanism further legitimized controllers that track target spend over time (Conitzer et al.), providing the operational context for this paper’s plan-plus-controller architecture. Second, the methodological leap to single-sample learning is inspired by limited-information auction theory: Dhangwatnotai, Roughgarden, and Yan, and later Dütting, Feldman, Kesselheim, and Lucier, showed that single-sample thresholds can be remarkably effective, a principle this work adapts to calibrate spending thresholds robustly from one sample. The regret yardstick and budget-coupled learning backdrop come from Bandits with Knapsacks, which set the O(√T) target the authors match. Finally, by contrasting with sample-heavy learn-then-commit paradigms in online stochastic allocation (e.g., Agrawal and Devanur), the paper crystallizes its gap: prior pacing methods needed Θ(T log T) data to be stable, whereas a carefully designed single-sample estimator suffices, even under time-varying distributions.",
  "analysis_timestamp": "2026-01-06T23:09:26.536398"
}