{
  "prior_works": [
    {
      "title": "A fundamental principle for systems of linear differential equations with constant coefficients, and some of its applications",
      "authors": "Leon Ehrenpreis et al.",
      "year": 1960,
      "role": "Foundation",
      "relationship_sentence": "EPGP directly applies Ehrenpreis’s fundamental principle to represent all solutions of constant-coefficient linear PDE systems as exponential–polynomial superpositions, which it uses to construct GP kernels whose sample paths lie exactly in the solution space."
    },
    {
      "title": "Linear Differential Operators with Constant Coefficients",
      "authors": "Victor P. Palamodov et al.",
      "year": 1970,
      "role": "Foundation",
      "relationship_sentence": "Palamodov’s formulation of the Ehrenpreis–Palamodov fundamental principle provides the explicit nonlinear Fourier–type integral representation that EPGP instantiates to build priors for arbitrary systems of constant-coefficient PDEs."
    },
    {
      "title": "Linearly Constrained Gaussian Processes",
      "authors": "Mårten Jidling et al.",
      "year": 2017,
      "role": "Extension",
      "relationship_sentence": "EPGP extends the linearly constrained GP paradigm by giving a general, algorithmic parametrization of the null space of linear PDE operators via the Ehrenpreis–Palamodov representation, enabling exact satisfaction of broad PDE systems rather than hand-crafted constraints."
    },
    {
      "title": "Latent Force Models",
      "authors": "Mauricio Álvarez et al.",
      "year": 2009,
      "role": "Inspiration",
      "relationship_sentence": "Latent Force Models showed how to construct GP priors through linear differential operators using Green’s functions; EPGP generalizes this operator-centric construction to the homogeneous solution space of arbitrary constant-coefficient PDE systems, enforcing the PDE exactly."
    },
    {
      "title": "Gaussian Process Kernels for Pattern Discovery and Extrapolation",
      "authors": "Andrew G. Wilson et al.",
      "year": 2013,
      "role": "Extension",
      "relationship_sentence": "EPGP’s sparse variant mirrors spectral-mixture kernel learning by selecting discrete spectral components; it adapts this idea by restricting learned frequencies to the PDE’s characteristic variety defined by the operator’s polynomial."
    },
    {
      "title": "Sparse Spectrum Gaussian Process Regression",
      "authors": "Miguel Lázaro-Gredilla et al.",
      "year": 2010,
      "role": "Extension",
      "relationship_sentence": "S-EPGP adopts a finite sparse spectral representation with learned frequencies akin to Sparse Spectrum GPs, but constrains these components to the PDE-induced frequency manifold to guarantee exact feasibility."
    },
    {
      "title": "Numerical Gaussian Processes for Time-dependent and Steady State Partial Differential Equations",
      "authors": "Maziar Raissi et al.",
      "year": 2018,
      "role": "Gap Identification",
      "relationship_sentence": "This work enforces PDEs through likelihood constraints and time stepping rather than encoding the solution space in the prior; EPGP addresses this gap by constructing priors whose realizations satisfy the PDE exactly."
    }
  ],
  "synthesis_narrative": "EPGP’s core innovation—Gaussian process priors whose sample paths are exact solutions of arbitrary linear constant‑coefficient PDE systems—rests on importing the Ehrenpreis–Palamodov fundamental principle into GP kernel design. Ehrenpreis and Palamodov provide the foundational representation of all solutions as superpositions of exponential–polynomial modes governed by the operator’s characteristic set. EPGP instantiates this nonlinear Fourier–type transform as a kernel-building recipe, turning a deep PDE representation theorem into a constructive GP prior. This bridges and extends earlier constrained GP efforts: linearly constrained Gaussian processes demonstrated that exact linear constraints can be enforced by parametrizing the null space, but relied on problem‑specific constructions; EPGP supplies a general, algorithmic parametrization for entire classes of PDE systems. In parallel, latent force models established the operator–kernel connection via Green’s functions, inspiring EPGP’s operator‑centric view while shifting focus to the homogeneous solution space and exact satisfaction. For scalability and modeling flexibility, EPGP’s sparse variant borrows from spectral GP methodology: spectral mixture kernels and sparse spectrum GPs motivate learning discrete spectral components, which EPGP restricts to the PDE’s characteristic variety to maintain exact feasibility while discovering relevant frequencies. Finally, prior GP‑for‑PDE approaches such as numerical Gaussian processes highlighted a practical gap—PDEs enforced via likelihood or time stepping do not guarantee exact solutions—directly motivating EPGP’s prior‑level enforcement. Together, these works form the direct intellectual lineage of EPGP’s theory and algorithms.",
  "analysis_timestamp": "2026-01-06T23:09:26.581666"
}