{
  "prior_works": [
    {
      "title": "Data Shapley: Towards a Data Valuation Framework",
      "authors": "Amirata Ghorbani et al.",
      "year": 2019,
      "role": "Foundation",
      "relationship_sentence": "This work established the core problem of quantifying how much a data contributor adds to a pooled model via marginal contributions; the present paper generalizes that notion into directional outflows (how much an entity’s data helps others) and inflows (how much an entity benefits from others), making Shapley-style valuation the conceptual starting point."
    },
    {
      "title": "Towards Efficient Data Valuation Based on the Shapley Value",
      "authors": "Ruoxi Jia et al.",
      "year": 2019,
      "role": "Extension",
      "relationship_sentence": "Jia et al. operationalize Shapley-based data valuation (e.g., TMC- and KNN-Shapley) and provide practical baselines for marginal contribution; the current paper adapts this machinery from a single scalar payoff to separate, directional measurements of outflow and inflow to study reciprocity."
    },
    {
      "title": "Understanding Black-box Predictions via Influence Functions",
      "authors": "Pang Wei Koh et al.",
      "year": 2017,
      "role": "Inspiration",
      "relationship_sentence": "The influence-function formalism for infinitesimally up-weighting training data to measure its effect on test loss directly motivates the paper’s pairwise view of value exchange between entities and underlies the reciprocity analysis via symmetry of gradients/Hessians."
    },
    {
      "title": "Detection of Influential Observations in Linear Regression",
      "authors": "R. Dennis Cook",
      "year": 1977,
      "role": "Foundation",
      "relationship_sentence": "Classical leave-one-out influence (Cook’s distance) for linear models provides the analytic backbone—through hat-matrix identities—for the paper’s theoretical reciprocity results in linear/quadratic models where the effect of removing one entity’s data on others can be characterized symmetrically."
    },
    {
      "title": "Agnostic Federated Learning",
      "authors": "Mehryar Mohri et al.",
      "year": 2019,
      "role": "Foundation",
      "relationship_sentence": "This work formalizes learning over multiple client/entity distributions and mixtures; the present paper adopts the same entity-as-distribution setting to precisely define each entity’s benefit from pooled data versus its own data, enabling the inflow/outflow/reciprocity framework."
    }
  ],
  "synthesis_narrative": "The paper’s core innovation—decomposing the value exchange in pooled learning into inflows, outflows, and a reciprocity metric—emerges by fusing two lines of prior work: data valuation and influence analysis. Data Shapley framed the foundational question of how much a contributor’s data is “worth” to a learned model by marginal contribution. However, Shapley-style approaches collapse all effects into a single scalar payoff, obscuring who benefits from whom. Jia et al. provided efficient and practical estimators for these marginal contributions, which this paper repurposes to compute directional effects rather than a single aggregate value. The shift from aggregate to directional value is catalyzed by influence-function methodology: Koh and Liang’s infinitesimal up-weighting formalism naturally defines pairwise effects of one entity’s data on another entity’s loss, the building block for inflow and outflow. For the theoretical reciprocity results, the paper leans on classical regression diagnostics—Cook’s distance and the symmetry of the hat matrix—to show that in linear and related models under certain distributional assumptions, these pairwise effects are approximately symmetric, yielding reciprocity. Finally, Agnostic Federated Learning provides the formal setting of multiple entity distributions and their mixtures, which the present work adopts to precisely define benefits from pooled versus local data. Together, these works directly shape the problem formulation, measurement tools, and theoretical underpinnings of inflow, outflow, and reciprocity.",
  "analysis_timestamp": "2026-01-06T23:09:26.523926"
}