{
  "prior_works": [
    {
      "title": "A cost function for similarity-based hierarchical clustering",
      "authors": "Sanjoy Dasgupta",
      "year": 2016,
      "role": "Foundation",
      "relationship_sentence": "This paper introduces the exact objective and rigorous framework (Dasgupta’s cost) that the present work privatizes, proving DP lower bounds and designing approximation algorithms explicitly in this formulation."
    },
    {
      "title": "Hierarchical Clustering: Objective Functions and Algorithms",
      "authors": "Vincent Cohen-Addad et al.",
      "year": 2018,
      "role": "Extension",
      "relationship_sentence": "Provides the key non-private approximation techniques for Dasgupta’s objective that this work adapts to the private setting, serving as the algorithmic template whose structure is modified and analyzed under DP noise."
    },
    {
      "title": "Approximation Guarantees for Hierarchical Clustering",
      "authors": "Benjamin Moseley et al.",
      "year": 2017,
      "role": "Related Problem",
      "relationship_sentence": "Establishes approximation guarantees for hierarchical clustering objectives and standard linkage heuristics, forming the primary non-private baselines that this paper seeks to match while enforcing differential privacy."
    },
    {
      "title": "Mechanism Design via Differential Privacy",
      "authors": "Frank McSherry et al.",
      "year": 2007,
      "role": "Extension",
      "relationship_sentence": "The exponential mechanism directly enables the paper’s exponential-time ε-DP algorithm that achieves the optimal O(|V|^2/ε) additive error by selecting (near) optimal trees from the space of hierarchies."
    },
    {
      "title": "Calibrating Noise to Sensitivity in Private Data Analysis",
      "authors": "Cynthia Dwork et al.",
      "year": 2006,
      "role": "Foundation",
      "relationship_sentence": "Supplies the sensitivity-based noise calibration (Laplace mechanism) that underpins the paper’s additive-error bounds for its polynomial-time private algorithm and informs the scaling of unavoidable DP error."
    },
    {
      "title": "Exact recovery in the stochastic block model",
      "authors": "Emmanuel Abbe et al.",
      "year": 2016,
      "role": "Foundation",
      "relationship_sentence": "Characterizes separation conditions and recovery guarantees in SBM that this paper leverages, showing that under similar separations a DP algorithm can achieve 1+o(1) approximation and exact block recovery."
    },
    {
      "title": "On the Geometry of Differential Privacy",
      "authors": "Moritz Hardt et al.",
      "year": 2010,
      "role": "Gap Identification",
      "relationship_sentence": "Provides general information-theoretic/packing lower bound techniques for DP accuracy that directly motivate and inform the paper’s Ω(|V|^2/ε) lower bound for any ε-DP hierarchical clustering algorithm."
    }
  ],
  "synthesis_narrative": "The paper’s intellectual lineage begins with Dasgupta’s 2016 formulation, which defined the cost-based objective and rigorous benchmark for hierarchical clustering that this work adopts wholesale. Subsequent non-private algorithmic progress—exemplified by Cohen-Addad et al. (2018) and Moseley & Wang (2017)—established approximation strategies and baseline performance for the Dasgupta objective and related hierarchical clustering criteria; these methods provide the concrete algorithmic templates the present paper adapts and analyzes under privacy constraints. On the privacy side, Dwork et al. (2006) furnished the sensitivity-based noise calibration principles that dictate the additive-error scaling in private optimization, while Hardt & Talwar (2010) supplied general lower-bound machinery that the authors leverage to prove Ω(|V|^2/ε) unavoidable error for any ε-DP algorithm in this setting. To match these limits algorithmically, the paper directly applies the exponential mechanism of McSherry & Talwar (2007), yielding an exponential-time ε-DP procedure attaining the optimal additive error. Finally, for the stochastic block model regime, Abbe, Bandeira, and Hall (2016) provide the separation conditions and exact-recovery guarantees that the authors translate into the private domain, showing that—with suitable separation—the proposed ε-DP algorithm achieves 1+o(1) approximation and exact block recovery. Together, these works directly shape the problem formulation, lower-bound methodology, algorithmic constructions, and SBM recovery guarantees that constitute the core contributions.",
  "analysis_timestamp": "2026-01-06T23:09:26.549638"
}