{
  "prior_works": [
    {
      "title": "Distributionally Robust Neural Networks for Group Shifts: On the Importance of Regularization for Worst-Case Generalization",
      "authors": "Shiori Sagawa et al.",
      "year": 2020,
      "role": "Foundation",
      "relationship_sentence": "This work formalized worst-group risk under group shift and popularized GroupDRO, establishing the exact objective (worst-group accuracy) that the present paper analyzes and explains via extreme value theory."
    },
    {
      "title": "Fairness Without Demographics in Repeated Loss Minimization",
      "authors": "Tatsunori B. Hashimoto et al.",
      "year": 2018,
      "role": "Gap Identification",
      "relationship_sentence": "It showed that ERM can systematically harm minority subpopulations, motivating a need to understand mechanisms behind minority/worst-group failures; the current paper provides a concrete mechanism—majority extremes under heavy tails bias linear separators—and shows when balancing mitigates it."
    },
    {
      "title": "WILDS: A Benchmark of in-the-wild distribution shifts",
      "authors": "Pang Wei Koh et al.",
      "year": 2021,
      "role": "Foundation",
      "relationship_sentence": "By standardizing evaluation via worst-group accuracy across real-world group imbalances, WILDS crystallized the problem setting and metric that this paper theoretically analyzes, including the common practice of group-balanced training."
    },
    {
      "title": "The Effect of Class Distribution on Classifier Learning: An Empirical Study",
      "authors": "Gary M. Weiss et al.",
      "year": 2001,
      "role": "Inspiration",
      "relationship_sentence": "This classic empirical study documented that undersampling to equalize class sizes can improve minority performance despite discarding data, directly motivating the paper’s core question and its EVT-based explanation of this counterintuitive effect."
    },
    {
      "title": "Learning from Imbalanced Data",
      "authors": "Haibo He et al.",
      "year": 2009,
      "role": "Gap Identification",
      "relationship_sentence": "This influential survey codified resampling (including random undersampling) as a dominant practice for class imbalance yet lacked a principled theory for worst-group generalization; the present paper supplies such a theory under heavy-tailed features."
    },
    {
      "title": "Heavy-Tail Phenomena: Probabilistic Limit Theorems and Statistical Applications",
      "authors": "Sidney I. Resnick",
      "year": 2007,
      "role": "Foundation",
      "relationship_sentence": "Provides the extreme value theory foundations—especially scaling laws for maxima of heavy-tailed distributions—that the paper leverages to show how larger groups yield more extreme samples that skew linear classifiers and why balancing restores symmetry."
    }
  ],
  "synthesis_narrative": "The paper’s core contribution—an extreme value theory (EVT) explanation for why balancing groups by throwing away data can improve worst-group accuracy—rests on two converging threads. First, the problem formulation and target metric were crystallized by work on subpopulation shift and group robustness: Hashimoto et al. demonstrated that ERM can disproportionately harm minority groups, and Sagawa et al. formalized worst-group risk and GroupDRO as a remedy, while WILDS standardized evaluation around worst-group accuracy on real datasets. Second, a longstanding empirical practice from the imbalanced learning literature—captured by Weiss and Provost as well as He and Garcia—showed that undersampling to equalize group/class sizes often boosts minority performance, yet lacked a principled explanation and even seemed to contradict learning theory’s “more data helps” intuition. This paper resolves that contradiction by importing EVT, as synthesized by Resnick: in heavy-tailed settings, the largest observed samples grow with group size, so majority groups contribute more extreme points that disproportionately shape linear decision boundaries. Balancing groups equalizes the tail extremes across groups, restoring geometric symmetry and thereby improving worst-group generalization. Thus, the present work directly builds on the worst-group formulation and empirical balancing practice, and it supplies the missing theoretical mechanism via EVT’s scaling laws for extremes under heavy-tailed distributions.",
  "analysis_timestamp": "2026-01-06T23:09:26.557793"
}