{
  "prior_works": [
    {
      "title": "The Estimation of Economic Relationships Using Instrumental Variables",
      "authors": "J. D. Sargan et al.",
      "year": 1958,
      "role": "Baseline",
      "relationship_sentence": "The paper’s linear IV setup and two-stage least squares baseline are inherited from Sargan’s classical IV framework, which the authors generalize to the underidentified regime by focusing on projections onto the instrumented subspace and by combining information across experiments."
    },
    {
      "title": "Identification of Causal Effects Using Instrumental Variables",
      "authors": "J. D. Angrist et al.",
      "year": 1996,
      "role": "Foundation",
      "relationship_sentence": "The causal interpretation and core IV assumptions (relevance, exclusion, independence) defining the target effect in this work build directly on Angrist–Imbens–Rubin’s formulation, which the authors adapt to high-dimensional treatments and limited instruments."
    },
    {
      "title": "Large Sample Properties of Generalized Method of Moments Estimators",
      "authors": "L. P. Hansen et al.",
      "year": 1982,
      "role": "Extension",
      "relationship_sentence": "The paper’s key idea of consistently combining partial, experiment-specific IV information is operationalized by stacking moment conditions across experiments within the GMM framework introduced by Hansen."
    },
    {
      "title": "Sparse Models and Methods for Instrumental Variables Regression",
      "authors": "A. Belloni et al.",
      "year": 2012,
      "role": "Gap Identification",
      "relationship_sentence": "High-dimensional IV methods like Belloni–Chernozhukov–Hansen assume sufficient instrument dimension (or sparsity structure) to identify the full parameter, a limitation explicitly addressed here by developing identification and estimation for the underspecified case (fewer instruments than treatments)."
    },
    {
      "title": "Causal Inference by Surrogate Experiments: z-Identifiability",
      "authors": "E. Bareinboim et al.",
      "year": 2012,
      "role": "Related Problem",
      "relationship_sentence": "z-Identifiability formalizes learning causal effects from interventions on surrogate (instrumental) variables; this paper tackles the regime where such interventions do not fully identify the effect, recovering identifiable projections and planning sequential surrogate interventions to build identifiability."
    },
    {
      "title": "Iterative Hessian Sketch: Fast and Accurate Solution Approximation for Constrained Least-Squares",
      "authors": "M. Pilanci et al.",
      "year": 2016,
      "role": "Inspiration",
      "relationship_sentence": "The insight that solving sketched linear systems yields projections of the true solution, and that combining multiple sketches can recover the full parameter, directly inspires the paper’s view of each experiment as revealing a projection of the causal effect that can be consistently combined across experiments."
    },
    {
      "title": "Bayesian Experimental Design: A Review",
      "authors": "K. Chaloner et al.",
      "year": 1995,
      "role": "Foundation",
      "relationship_sentence": "The paper’s sequential instrument selection is cast in the classical optimal experimental design paradigm (e.g., information-based criteria), directly drawing on principles surveyed by Chaloner and Verdinelli to choose instruments that maximally reduce uncertainty over the unlearned subspace."
    }
  ],
  "synthesis_narrative": "The paper’s core innovation—recovering and consistently combining projections of a high-dimensional causal effect when instruments are fewer than treatments, and actively selecting instruments across sequential experiments—sits at the intersection of classical IV identification, GMM, optimal design, and modern insights on projected solutions.\nSargan’s formulation of linear IV and 2SLS, together with Angrist–Imbens–Rubin’s causal interpretation, anchors the problem setting and target estimand. Hansen’s GMM provides the methodological backbone for aggregation: each experiment contributes moment conditions that, while insufficient to identify the full parameter, identify a projection; stacking these moments yields a consistent combined estimator. The paper explicitly responds to limitations in the high-dimensional IV literature (Belloni–Chernozhukov–Hansen), which presumes enough valid instruments (or sparsity enabling recovery of the full vector); the authors instead characterize what is identifiable under rank deficiency and how to accumulate information across experiments. In parallel, the z-identifiability line (Bareinboim–Pearl) motivates situations where one can only intervene on surrogates/instruments; when those surrogates fail to fully identify the effect, the present work recovers the identifiable projections and plans additional surrogate experiments. Conceptually, the view that each experiment reveals a projection of the parameter is inspired by sketching methods (Pilanci–Wainwright), where partial linear systems yield projected solutions that can be combined. Finally, sequential instrument selection is grounded in optimal experimental design (Chaloner–Verdinelli), guiding which instruments to deploy next to maximally expand the instrumented subspace and reduce estimator variance.",
  "analysis_timestamp": "2026-01-06T23:09:26.575118"
}