{
  "prior_works": [
    {
      "title": "URLB: Unsupervised Reinforcement Learning Benchmark",
      "authors": "Michael Laskin et al.",
      "year": 2021,
      "role": "Foundation",
      "relationship_sentence": "This paper adopts URLB’s two-phase protocol (unsupervised pretraining from pixels followed by downstream fine-tuning) and is explicitly designed to address URLB’s finding that existing unsupervised strategies failed to improve visual control generalization."
    },
    {
      "title": "Dream to Control: Learning Behaviors by Latent Imagination (Dreamer)",
      "authors": "Danijar Hafner et al.",
      "year": 2020,
      "role": "Foundation",
      "relationship_sentence": "The proposed method’s unsupervised pretraining relies on a Dreamer-style latent world model learned from pixels, which provides the core model-based RL machinery enabling fast adaptation."
    },
    {
      "title": "Plan2Explore: Cross-Task Transfer by Unsupervised Exploration using World Models",
      "authors": "Shreyas R. Sekar et al.",
      "year": 2020,
      "role": "Gap Identification",
      "relationship_sentence": "Plan2Explore introduced unsupervised world-model pretraining for transfer but underperformed on URLB; this work directly addresses those limitations via task-aware fine-tuning and a stronger hybrid planner (Dyna-MPC)."
    },
    {
      "title": "Temporal Difference Model Predictive Control (TD-MPC): Efficient Learning in the Latent Space",
      "authors": "Nicklas Hansen et al.",
      "year": 2022,
      "role": "Extension",
      "relationship_sentence": "Dyna-MPC builds on TD-MPC’s value-regularized latent-space MPC by augmenting short-horizon CEM planning with bootstrapped value estimates and incorporating Dyna-style model rollouts during fine-tuning."
    },
    {
      "title": "Integrated Architectures for Learning, Planning, and Reacting Based on Approximating Dynamic Programming (Dyna)",
      "authors": "Richard S. Sutton",
      "year": 1990,
      "role": "Foundation",
      "relationship_sentence": "The hybrid Dyna-MPC planner explicitly instantiates the Dyna idea—using imagined model rollouts to update value/policy while planning—providing the conceptual backbone for the paper’s adaptation strategy."
    },
    {
      "title": "Learning Latent Dynamics for Planning from Pixels (PlaNet)",
      "authors": "Danijar Hafner et al.",
      "year": 2019,
      "role": "Inspiration",
      "relationship_sentence": "The MPC component of the proposed approach performs trajectory optimization in a learned latent space as in PlaNet, supplying the planning mechanism that Dyna-MPC refines and integrates with value learning."
    },
    {
      "title": "CIC: Contrastive Intrinsic Control for Unsupervised Reinforcement Learning from Pixels",
      "authors": "Michael Laskin et al.",
      "year": 2022,
      "role": "Baseline",
      "relationship_sentence": "CIC is a primary URLB baseline representing model-free unsupervised RL from pixels that this work directly compares against and substantially surpasses, motivating the shift to model-based pretraining plus planning."
    }
  ],
  "synthesis_narrative": "The core contribution—unsupervised model-based pretraining from pixels coupled with a task-aware fine-tuning strategy using a new hybrid planner, Dyna-MPC—emerges from a convergence of the URLB problem setting and advances in world-model RL and value-regularized planning. URLB defined the exact protocol and exposed that existing unsupervised methods often fail to improve generalization in visual control, setting the target this work aims to solve. Dreamer provided the key capability to learn controllable latent dynamics from pixels, which this paper adopts for unsupervised pretraining. Plan2Explore showed that unsupervised world-model exploration can transfer across tasks but struggled on URLB; that shortfall directly motivates this paper’s stronger adaptation stage. On the planning side, PlaNet established latent-space MPC with learned dynamics, while TD-MPC demonstrated that blending MPC with a learned value function yields robust image-based control; Dyna-MPC extends this idea by integrating Dyna-style model rollouts to update value/policy during fine-tuning. Finally, CIC serves as the principal model-free unsupervised baseline within URLB that this method decisively outperforms, reinforcing the necessity of model-based pretraining and hybrid planning. Together, these works form the direct intellectual lineage that enables mastering URLB from pixels.",
  "analysis_timestamp": "2026-01-06T23:09:26.539778"
}