{
  "prior_works": [
    {
      "title": "Computing Machinery and Intelligence",
      "authors": "Alan M. Turing",
      "year": 1950,
      "role": "Foundation",
      "relationship_sentence": "Introduces the Turing Test as an evaluation of human-like behavior; this paper explicitly reframes that paradigm into a “Turing Experiment” to address the limitation of simulating a single arbitrary individual by instead requiring a representative sample."
    },
    {
      "title": "Out of One, Many: Using Language Models to Simulate Human Samples",
      "authors": "Lisa P. Argyle et al.",
      "year": 2023,
      "role": "Inspiration",
      "relationship_sentence": "Demonstrates that LLMs can be prompted to approximate responses of demographic subgroups in survey research, directly inspiring this paper’s formalization and extension to simulating representative samples for classic behavioral experiments."
    },
    {
      "title": "Personalizing Dialogue Agents: I have a dog, do you have pets too?",
      "authors": "Saizheng Zhang et al.",
      "year": 2018,
      "role": "Extension",
      "relationship_sentence": "Introduces persona-conditioned generation; the current work extends this idea by conditioning LLMs on demographic/persona profiles to instantiate multiple distinct ‘participants’ in Turing Experiments."
    },
    {
      "title": "An experimental analysis of ultimatum bargaining",
      "authors": "Werner Güth et al.",
      "year": 1982,
      "role": "Foundation",
      "relationship_sentence": "Defines the Ultimatum Game and the canonical human behavioral regularities (e.g., rejection of unfair offers) that this paper uses as a Turing Experiment to test whether LLM-simulated samples reproduce known outcomes."
    },
    {
      "title": "Making and correcting errors during sentence comprehension: Eye movements in the analysis of structurally ambiguous sentences",
      "authors": "Lyn Frazier et al.",
      "year": 1982,
      "role": "Foundation",
      "relationship_sentence": "Establishes garden-path effects in human sentence processing; the present work uses these stimuli to assess whether LLM ‘participants’ collectively replicate human difficulty patterns."
    },
    {
      "title": "Behavioral Study of Obedience",
      "authors": "Stanley Milgram",
      "year": 1963,
      "role": "Foundation",
      "relationship_sentence": "Provides the classic human-subject framework on obedience to authority that the paper adapts into a Turing Experiment to test whether simulated samples recover the qualitative obedience effect."
    },
    {
      "title": "Vox Populi",
      "authors": "Francis Galton",
      "year": 1907,
      "role": "Foundation",
      "relationship_sentence": "Introduces the wisdom-of-crowds phenomenon that this paper operationalizes as a Turing Experiment, revealing the LLM-specific ‘hyper-accuracy’ distortion when aggregating simulated participants."
    }
  ],
  "synthesis_narrative": "The paper’s core innovation—the Turing Experiment (TE)—sits at the intersection of classic evaluation of human-likeness and recent demonstrations that language models can emulate population-level patterns. Turing’s foundational proposal of the Turing Test provided the conceptual bedrock for evaluating human-like behavior; the present work directly addresses its limitation (a single arbitrary interlocutor) by elevating evaluation to representative samples via TEs. Argyle et al. showed that LLMs can simulate demographic subgroups for surveys, motivating the authors to formalize a principled methodology for sampling and evaluating simulated ‘participants’ beyond opinion surveys and into controlled behavioral paradigms. Persona-Chat’s persona conditioning is operationally extended here to instantiate many distinct participant profiles, enabling the multi-human simulation central to TEs. To ground and validate the TE methodology, the paper leverages seminal human-subjects paradigms: the Ultimatum Game (Güth et al.) for economic bargaining norms, garden-path sentence processing (Frazier & Rayner) for psycholinguistic processing difficulty, Milgram’s obedience study for social psychology, and Galton’s wisdom-of-crowds for aggregation effects. These canonical studies supply the precise behavioral regularities the TE aims to replicate, while also exposing LLM-specific distortions (e.g., hyper-accuracy in aggregation). Together, these works directly shaped the paper’s problem formulation, methodological design for multi-persona sampling, and the choice of benchmark phenomena that demonstrate both successes and systematic deviations in LLM-based human simulation.",
  "analysis_timestamp": "2026-01-06T23:09:26.514557"
}