{
  "prior_works": [
    {
      "title": "On the Complexity of Best Arm Identification in Multi-Armed Bandit Models",
      "authors": "Emilie Kaufmann et al.",
      "year": 2016,
      "role": "Foundation",
      "relationship_sentence": "The paper’s instance-dependent lower bounds and fixed-confidence pure-exploration framework directly underpin the information-theoretic analysis here, which adapts their change-of-measure methodology to the multi-task monotone-ranking setting."
    },
    {
      "title": "Optimal Best Arm Identification with Fixed Confidence",
      "authors": "Aurélien Garivier et al.",
      "year": 2016,
      "role": "Extension",
      "relationship_sentence": "The Track-and-Stop principle and optimal stopping ideas are extended to the structured setting of ranking experts via expert-task queries, guiding the design of stopping rules and confidence allocations in this work."
    },
    {
      "title": "Best Arm Identification in Linear Bandits",
      "authors": "Marc Z. Soare et al.",
      "year": 2014,
      "role": "Inspiration",
      "relationship_sentence": "Viewing task choices as experimental design, this work’s approach to allocating measurements over design vectors directly inspires the paper’s active selection of expert-task pairs to maximize discrimination between uncertain expert orderings."
    },
    {
      "title": "Optimal Best Arm Identification in Linear Bandits",
      "authors": "Hussam Jedra et al.",
      "year": 2020,
      "role": "Extension",
      "relationship_sentence": "The convex-analytic characterization of optimal sampling distributions for linear pure exploration informs the paper’s instance-dependent allocation over tasks to achieve near-optimal query complexity and matching lower bounds."
    },
    {
      "title": "PAC Subset Selection in Stochastic Multi-armed Bandits",
      "authors": "Shivaram Kalyanakrishnan et al.",
      "year": 2012,
      "role": "Baseline",
      "relationship_sentence": "As a standard baseline for fixed-confidence top-k (and by extension ranking) identification, LUCB-style elimination from this work is the point of comparison that the proposed strategy improves upon by exploiting the many-task monotonicity structure."
    },
    {
      "title": "Noisy Sorting Without Resampling",
      "authors": "Mark Braverman et al.",
      "year": 2008,
      "role": "Gap Identification",
      "relationship_sentence": "This seminal formulation of full ranking under noisy observations highlights the difficulty of ranking via comparisons; the present paper explicitly addresses the gap by leveraging multiple tasks and a monotonicity assumption to actively select more informative evaluations than pairwise comparisons."
    }
  ],
  "synthesis_narrative": "The paper’s core innovation—actively ranking experts from noisy evaluations taken on many tasks under a monotonicity assumption—sits at the intersection of pure-exploration bandits, experimental design, and ranking. Its information-theoretic backbone is directly inherited from fixed-confidence best-arm identification: the change-of-measure methodology and instance-dependent complexity of Kaufmann, Cappé, and Garivier provide the template for deriving matching lower bounds in a new structured setting. Building on that, Garivier and Kaufmann’s Track-and-Stop framework informs the stopping and confidence allocation logic that the authors generalize from single-task BAI to multi-task ranking.\nOn the sampling side, the problem naturally becomes one of experimental design over tasks: which task best separates uncertain expert pairs? This is directly inspired by linear-bandit pure exploration work. Soare, Lazaric, and Munos show how to allocate samples over design vectors to estimate pairwise gaps efficiently, and Jedra and Proutiere’s optimal allocation via convex programs guides the instance-adaptive sampling the authors craft for their monotone multi-task model. Classical top-k/ ranking identification (Kalyanakrishnan et al.) provides the principal baseline logic (LUCB-style elimination), which the present work surpasses by exploiting cross-task monotonicity to reduce queries. Finally, the older noisy-sorting literature (Braverman and Mossel) crystallizes the ranking objective and exposes limits of pairwise-comparison-only approaches; the paper directly addresses this by converting the availability of many tasks into an information gain lever, yielding instance-dependent bounds and near-matching lower bounds tailored to the multi-task monotone structure.",
  "analysis_timestamp": "2026-01-06T23:09:26.515950"
}