{
  "prior_works": [
    {
      "title": "State-Dependent Riccati Equation Techniques: A State Space Approach",
      "authors": "J. L. Cloutier",
      "year": 1997,
      "role": "Foundation",
      "relationship_sentence": "Introduces the SDRE framework and the state-dependent coefficient (SDC) factorization xdot = A(x)x + B(x)u that the present paper generalizes and leverages, providing the core control paradigm that is learned from data here."
    },
    {
      "title": "Survey of state dependent Riccati equation (SDRE) control: theory and applications",
      "authors": "I. Y. Çimen",
      "year": 2012,
      "role": "Baseline",
      "relationship_sentence": "Codifies SDRE practice, including nonlinear regulation/tracking formulations, whose controller structure this paper adopts while removing the need for hand-crafted SDC models by learning the factorization directly from data."
    },
    {
      "title": "On Contraction Analysis for Nonlinear Systems",
      "authors": "W. Lohmiller et al.",
      "year": 1998,
      "role": "Foundation",
      "relationship_sentence": "Provides the contraction-theoretic stability framework that underpins viewing the SDRE-induced Riccati solution as a state-dependent metric for tracking, informing the paper’s stability rationale for the learned controller."
    },
    {
      "title": "Control Contraction Metrics: Convex and Intrinsic Criteria for Nonlinear Feedback Design",
      "authors": "I. R. Manchester et al.",
      "year": 2017,
      "role": "Gap Identification",
      "relationship_sentence": "Offers universal stabilizability conditions via a state-dependent metric but at significant computational cost; the present work addresses this gap by using a Riccati-based metric derived from an SDC factorization that can be learned from data."
    },
    {
      "title": "Research on gain scheduling",
      "authors": "W. J. Rugh et al.",
      "year": 2000,
      "role": "Foundation",
      "relationship_sentence": "Establishes the gain-scheduling viewpoint (with scheduling variable ρ=x) that SDRE instantiates; the current paper builds on this foundation by learning the scheduling (SDC factorization) from data rather than designing it manually."
    },
    {
      "title": "Deep learning for universal linear embeddings of nonlinear dynamics",
      "authors": "N. Lusch et al.",
      "year": 2018,
      "role": "Gap Identification",
      "relationship_sentence": "Proposes learning Koopman-based latent linear models to enable LQR control, whose limitation is that a globally valid linearizing embedding may not exist; this paper instead learns an SDC factorization that always exists under mild smoothness."
    },
    {
      "title": "Discovering governing equations from data by sparse identification of nonlinear dynamical systems",
      "authors": "S. L. Brunton et al.",
      "year": 2016,
      "role": "Related Problem",
      "relationship_sentence": "Shows how to learn explicit dynamics from data (SINDy), highlighting that identification alone does not yield stabilizing feedback; the present work directly addresses this by learning a control-oriented SDC factorization tailored for SDRE synthesis."
    }
  ],
  "synthesis_narrative": "The core innovation of this paper is to operationalize a state-dependent Riccati (SDRE) tracking controller for general nonlinear control-affine systems by learning the required state-dependent coefficient (SDC) factorization directly from data. Cloutier’s seminal SDRE formulation established the foundational idea that nonlinear dynamics can be expressed in SDC form and stabilized via pointwise Riccati solutions; Çimen’s survey consolidated SDRE practice for regulation and tracking, providing the immediate baseline controller structure this work seeks to make data-driven. At the stability level, Lohmiller and Slotine’s contraction analysis and Manchester and Slotine’s control contraction metrics frame feedback design in terms of state-dependent metrics; these works motivate viewing the Riccati solution as a learned, control-oriented metric while identifying a gap: CCM synthesis can be computationally heavy. The present paper addresses this by leveraging the SDRE metric with an always-existing SDC factorization, which it learns from finite data. From a modeling perspective, Rugh and Shamma’s gain scheduling theory contextualizes SDRE as x-scheduled LQR; here, the scheduling map (factorization) is inferred from data rather than hand-crafted. Finally, recent data-driven modeling approaches like Koopman-based deep embeddings (Lusch et al.) and sparse identification (Brunton et al.) demonstrate the promise of learning dynamics but lack guaranteed, readily synthesizable stabilizing feedback for general nonlinear systems—precisely the gap this paper closes by learning a control-oriented SDC factorization for SDRE tracking.",
  "analysis_timestamp": "2026-01-06T23:09:26.521425"
}