{
  "prior_works": [
    {
      "title": "Predictive Inference with the Jackknife+",
      "authors": "Rina Foygel Barber et al.",
      "year": 2021,
      "role": "Baseline",
      "relationship_sentence": "JAWS-FCS directly extends the jackknife+ finite-sample coverage guarantee from exchangeable data to the feedback covariate shift setting, and JAWS-X introduces tunable relaxations to jackknife+ training that retain coverage while reducing computation."
    },
    {
      "title": "Conformal Prediction under Covariate Shift",
      "authors": "Ryan J. Tibshirani et al.",
      "year": 2019,
      "role": "Foundation",
      "relationship_sentence": "This work formalized distribution-free predictive inference under standard covariate shift via importance-weighted conformal calibration; JAWS-X adopts this problem formulation and weighting principle and then marries it with jackknife+-style reuse of labels to improve efficiency and extend to FCS."
    },
    {
      "title": "Distribution-Free Predictive Inference for Regression",
      "authors": "Jing Lei et al.",
      "year": 2018,
      "role": "Gap Identification",
      "relationship_sentence": "Split conformal prediction provides finite-sample coverage but uses a holdout calibration split, leaving labeled data unused; JAWS-X is motivated by this label-inefficiency and replaces split calibration with jackknife+-based reuse while preserving guarantees under shift."
    },
    {
      "title": "Algorithmic Learning in a Random World",
      "authors": "Vladimir Vovk et al.",
      "year": 2005,
      "role": "Foundation",
      "relationship_sentence": "This monograph introduced conformal prediction and its exchangeability-based validity, the theoretical starting point that JAWS-X explicitly relaxes by proving coverage under non-exchangeable feedback covariate shift."
    },
    {
      "title": "Improving predictive inference under covariate shift",
      "authors": "Hidetoshi Shimodaira",
      "year": 2000,
      "role": "Foundation",
      "relationship_sentence": "Shimodaira established the covariate shift framework and importance weighting, which underpin the weighted calibration strategies that JAWS-X leverages for both standard covariate shift and its feedback-induced variant."
    },
    {
      "title": "Counterfactual Reasoning and Learning Systems: The Example of Computational Advertising",
      "authors": "Léon Bottou et al.",
      "year": 2013,
      "role": "Related Problem",
      "relationship_sentence": "By formalizing feedback-induced selection bias and propensity weighting in deployed decision systems, this paper motivates the feedback covariate shift scenario that JAW-FCS targets with distribution-free coverage guarantees."
    }
  ],
  "synthesis_narrative": "JAWS-X sits at the intersection of conformal prediction’s distribution-free guarantees and the realities of data collected under shift and feedback. The conformal framework of Vovk, Gammerman, and Shafer (2005) provides the core validity principle and exchangeability assumption that this work seeks to relax. Split conformal prediction (Lei et al., 2018) made these guarantees practical but at the cost of label efficiency, using only a calibration split—an inefficiency that JAWS-X explicitly addresses. The jackknife+ (Barber et al., 2021) showed how to recover label efficiency with rigorous finite-sample coverage via leave-one-out refits; JAWS-FCS takes this as its baseline and extends its guarantees to a non-exchangeable regime with feedback dependencies, while JAWS-X introduces computationally tractable relaxations that preserve coverage.\n\nOn the shift side, Shimodaira (2000) established the covariate shift paradigm and importance weighting, laying the foundation for weighted calibration. Building directly on this, Tibshirani et al. (2019) formulated conformal prediction under standard covariate shift through importance-weighted calibration; JAWS-X adopts this formulation and integrates it with jackknife+-style reuse of labels to overcome the trade-off between computational and statistical efficiency. Finally, Bottou et al. (2013) articulated how deployed policies create feedback-induced selection bias, motivating the feedback covariate shift setting addressed by JAW-FCS. Together, these works directly shape JAWS-X’s key contribution: computationally practical, finite-sample valid predictive intervals under both standard and feedback covariate shift.",
  "analysis_timestamp": "2026-01-06T23:09:26.513196"
}