{
  "prior_works": [
    {
      "title": "Policy Gradient Methods for Reinforcement Learning with Function Approximation",
      "authors": "Richard S. Sutton et al.",
      "year": 1999,
      "role": "Foundation",
      "relationship_sentence": "Provides the policy-gradient theorem and compatible function-approximation framework that Warm-Start A-C builds on; this paper’s actor/critic update errors are quantified precisely as deviations from Sutton et al.’s idealized (compatible) actor-critic formulation."
    },
    {
      "title": "Actor-Critic Algorithms",
      "authors": "Vijay R. Konda et al.",
      "year": 2000,
      "role": "Foundation",
      "relationship_sentence": "Introduces the two-timescale actor-critic template and its convergence properties that the present work adopts as the algorithmic backbone before analyzing finite-time performance and error propagation with a warm-start policy."
    },
    {
      "title": "A Natural Policy Gradient",
      "authors": "Sham Kakade",
      "year": 2002,
      "role": "Inspiration",
      "relationship_sentence": "Establishes the natural/approximately Newton viewpoint of policy-gradient methods; the present paper directly leverages this perspective by casting Warm-Start Actor-Critic as a Newton method with perturbation to trace how approximation errors translate into a sub-optimality gap."
    },
    {
      "title": "AWAC: Accelerating Online Reinforcement Learning with Offline Datasets",
      "authors": "Ashvin Nair et al.",
      "year": 2020,
      "role": "Baseline",
      "relationship_sentence": "Provides a canonical warm-start (offline-to-online) actor-critic paradigm and empirical evidence of rapid improvements and occasional stagnation; the current paper’s theory explains when and why such warm-start acceleration occurs or stalls."
    },
    {
      "title": "A Finite Time Analysis of Temporal Difference Learning with Linear Function Approximation",
      "authors": "Jalaj Bhandari et al.",
      "year": 2018,
      "role": "Extension",
      "relationship_sentence": "Supplies finite-time critic error bounds and techniques for handling function-approximation error in TD, which are extended to quantify how critic inaccuracies propagate through the actor update into the sub-optimality gap."
    },
    {
      "title": "Stochastic Approximation: A Dynamical Systems Viewpoint",
      "authors": "Vivek S. Borkar",
      "year": 2008,
      "role": "Foundation",
      "relationship_sentence": "Provides the two-timescale stochastic-approximation framework and perturbation tools underpinning the analysis of inexact actor/critic updates and the stability assumptions used in the warm-start finite-time results."
    }
  ],
  "synthesis_narrative": "The core contribution of Warm-Start Actor-Critic is a finite-time characterization of how actor and critic approximation errors, in the presence of a prior (offline) policy, translate into a sub-optimality gap—and when warm-starting accelerates learning. This builds directly on the policy-gradient and compatible function-approximation framework of Sutton et al. (1999) and the two-timescale actor-critic formulation of Konda and Tsitsiklis (2000), which together define the algorithmic structure whose inaccuracies the paper quantifies. Kakade’s natural policy gradient (2002) provides the crucial Newton/Gauss–Newton lens: by explicitly casting warm-start A-C as a perturbed Newton method, the authors connect curvature-informed updates to acceleration conditions and make the role of approximation error transparent. Empirically, AWAC (Nair et al., 2020) crystallized warm-start RL—initializing online training from an offline policy—and documented both rapid gains and occasional stagnation; the present work targets exactly this phenomenon, offering conditions under which warm starts help or hinder. On the technical side, the critic’s finite-time error behavior is handled using ideas from Bhandari et al. (2018) on TD with function approximation, enabling a clean translation from critic inaccuracy to actor update bias. Finally, Borkar’s stochastic-approximation framework (2008) undergirds the two-timescale and perturbation analysis that justifies the finite-time performance guarantees with inexact updates. Together, these works constitute the direct intellectual lineage for the paper’s Newton-with-perturbation view and its error-to-suboptimality theory for warm-start actor-critic.",
  "analysis_timestamp": "2026-01-06T23:09:26.517447"
}