{
  "prior_works": [
    {
      "title": "On algebras which are connected with the semisimple continuous groups",
      "authors": "Richard Brauer",
      "year": 1937,
      "role": "Foundation",
      "relationship_sentence": "Brauer’s centralizer theorem shows that the commutant of O(n) and Sp(n) acting on tensor powers is the Brauer algebra, whose pairing diagrams directly provide the spanning set of linear equivariant maps that this paper instantiates as learnable layers."
    },
    {
      "title": "The Classical Groups: Their Invariants and Representations",
      "authors": "Hermann Weyl",
      "year": 1939,
      "role": "Foundation",
      "relationship_sentence": "Weyl’s first and second fundamental theorems for O(n), SO(n), and Sp(n) establish that invariants/equivariants are generated by index permutations and contractions with the invariant bilinear or symplectic form—exactly the generators used to characterize the paper’s equivariant layers."
    },
    {
      "title": "Über die rationalen Darstellungen der allgemeinen linearen Gruppe",
      "authors": "Issai Schur",
      "year": 1927,
      "role": "Foundation",
      "relationship_sentence": "Schur–Weyl duality for GL(n) provides the template of characterizing intertwiners via a commutant algebra (the symmetric group), which this work mirrors for O(n)/SO(n)/Sp(n) by replacing the commutant with the Brauer algebra."
    },
    {
      "title": "Invariant and Equivariant Graph Networks",
      "authors": "Haggai Maron et al.",
      "year": 2019,
      "role": "Inspiration",
      "relationship_sentence": "Maron et al. constructed explicit bases of S_n-equivariant linear maps between tensor powers via partition-algebra index patterns; this paper adopts that blueprint and extends it from permutation symmetry to O(n)/SO(n)/Sp(n) using Brauer diagrams."
    },
    {
      "title": "Universality of Invariant Networks",
      "authors": "Haggai Maron et al.",
      "year": 2019,
      "role": "Gap Identification",
      "relationship_sentence": "Their universality results hinge on the complete linear characterization for permutation symmetry, highlighting the lack of an analogous, complete characterization for classical continuous groups that this paper provides for O(n), SO(n), and Sp(n)."
    },
    {
      "title": "On the Generalization of Equivariance and Convolution in Neural Networks to the Action of Compact Groups",
      "authors": "Risi Kondor et al.",
      "year": 2018,
      "role": "Foundation",
      "relationship_sentence": "This work formalizes equivariant linear maps as intertwiners between group representations; the present paper computes the full intertwiner spaces for tensor-power representations of O(n), SO(n), and Sp(n) and gives an explicit spanning set."
    },
    {
      "title": "Tensor Field Networks: Rotation- and Translation-Equivariant Neural Networks for 3D Point Clouds",
      "authors": "Nathaniel Thomas et al.",
      "year": 2018,
      "role": "Gap Identification",
      "relationship_sentence": "TFNs build SO(3)-equivariant layers via irreducible representations and Clebsch–Gordan coefficients in 3D, but do not provide a complete spanning characterization for arbitrary tensor powers or for Sp(n); this paper fills that gap with a full basis for O(n), SO(n), and Sp(n)."
    }
  ],
  "synthesis_narrative": "The core innovation of Brauer’s Group Equivariant Neural Networks is an explicit, complete characterization of linear equivariant layers between tensor-power spaces for O(n), SO(n), and Sp(n). Its intellectual lineage tightly couples classical invariant theory with recent machine learning advances on equivariant parameterizations. At the mathematical foundation, Schur (1927) introduced the commutant perspective through Schur–Weyl duality for GL(n), establishing the paradigm of identifying intertwiners via centralizer algebras. Brauer (1937) extended this paradigm to the orthogonal and symplectic groups, proving that their commutants on tensor powers are the Brauer algebras with diagrammatic pairings—precisely the structures this paper turns into a spanning set of learnable linear maps. Weyl’s classical invariant theory further guarantees that permutations and contractions with the invariant bilinear or symplectic form generate all invariants/equivariants, justifying the completeness of the proposed basis.\n\nOn the machine learning side, Maron et al. (2019) demonstrated how to operationalize centralizer algebras for S_n by giving explicit bases (via partition-algebra index patterns) and universality results for permutation symmetries; their limitation to S_n exposed a gap for continuous classical groups. Kondor and Trivedi (2018) supplied the general intertwiners-as-equivariant-layers viewpoint that this work makes concrete for tensor-power representations of O(n), SO(n), and Sp(n). Finally, methods like Tensor Field Networks for SO(3) illustrated practical equivariance but lacked a complete spanning characterization across dimensions and groups—precisely the gap this paper closes by importing Brauer-algebra generators into learnable equivariant layers.",
  "analysis_timestamp": "2026-01-06T23:09:26.583791"
}