{
  "prior_works": [
    {
      "title": "Mechanism Design via Differential Privacy",
      "authors": "Frank McSherry et al.",
      "year": 2007,
      "role": "Baseline",
      "relationship_sentence": "The exponential mechanism introduced here is the canonical baseline for private selection; this paper analyzes EM’s data-access complexity (proving O(√m) expected accesses) and designs an O(√(mk)) top-k procedure that improves on the naïve Θ(mk)-access use of EM."
    },
    {
      "title": "Optimal aggregation algorithms for middleware",
      "authors": "Ronald Fagin et al.",
      "year": 2001,
      "role": "Foundation",
      "relationship_sentence": "The random-vs-sorted access model and the insight that both access types are necessary for sublinear top-k evaluation originate here; the present work adopts this model and proves matching lower bounds in the DP setting, mirroring TA/NRA-style necessities."
    },
    {
      "title": "Private and Continual Release of Statistics",
      "authors": "T.-H. Hubert Chan et al.",
      "year": 2011,
      "role": "Related Problem",
      "relationship_sentence": "This work’s sparse vector/AboveThreshold framework is a standard way to privately identify many large answers (e.g., top-k) but entails scanning queries, implying Ω(m) accesses; the new paper explicitly overcomes this scan cost via mixed random+sorted access with sublinear bounds."
    },
    {
      "title": "The Algorithmic Foundations of Differential Privacy",
      "authors": "Cynthia Dwork et al.",
      "year": 2014,
      "role": "Foundation",
      "relationship_sentence": "This monograph formalizes the private selection toolset (report noisy max/peeling and the exponential mechanism) that constitutes the baseline formulations; the current paper refines these by analyzing and optimizing their data-access complexity."
    },
    {
      "title": "Differentially Private Feature Selection via Stability Arguments",
      "authors": "Abhradeep Thakurta et al.",
      "year": 2013,
      "role": "Gap Identification",
      "relationship_sentence": "As a representative DP top-k application, this paper uses EM-style scoring over all m features, highlighting the prevailing linear-access bottleneck that the new work directly targets with sublinear-access algorithms and lower bounds."
    },
    {
      "title": "Differential Privacy and Robust Statistics",
      "authors": "Cynthia Dwork et al.",
      "year": 2009,
      "role": "Related Problem",
      "relationship_sentence": "Propose-Test-Release and thresholding ideas here exemplify sorted-access–like tests for identifying large values, but still require full scans; the new lower bounds show Ω(m) cost with only sorted (or only random) access, motivating the need for combining both."
    }
  ],
  "synthesis_narrative": "The paper’s core contribution—tight sublinear data-access bounds for differentially private top-k selection—sits at the intersection of DP selection mechanisms and the top‑k access model from classic query processing. The exponential mechanism of McSherry and Talwar is the de facto baseline for private selection; standard implementations score all m candidates, leading to linear access. Building directly on this, the authors prove that EM itself admits O(√m) expected accesses and then craft an O(√(mk)) top‑k algorithm that retains DP while sharply reducing accesses. The model of random versus sorted access, and the insight that both are needed for sublinear top‑k evaluation, trace to Fagin, Lotem, and Naor’s Threshold Algorithm literature; the present work explicitly adopts this model and extends its necessity phenomena to the DP regime via matching lower bounds. On the DP side, Dwork and Roth’s monograph codifies the canonical selection primitives (report‑noisy‑max, peeling, EM) that this paper treats as baselines and refines in terms of access complexity. Prior practical/top‑k‑style applications—such as Thakurta and Smith’s differentially private feature selection via EM and threshold‑based SVT/AboveThreshold methods (Chan, Shi, Song) and PTR (Dwork, Lei)—all implicitly incur Ω(m) scans, exposing a gap: no sublinear‑access guarantees for private top‑k. The new work directly addresses that gap, showing both how to achieve sublinear accesses by combining random and sorted access and why such a combination is provably necessary.",
  "analysis_timestamp": "2026-01-06T23:09:26.555125"
}