{
  "prior_works": [
    {
      "title": "Challenging Common Assumptions in the Unsupervised Learning of Disentangled Representations",
      "authors": "Francesco Locatello et al.",
      "year": 2019,
      "role": "Gap Identification",
      "relationship_sentence": "This impossibility result for unsupervised disentanglement from purely observational data directly motivates our use of interventional data and frames the core gap our paper fills by proving identifiability of causal factors under interventions."
    },
    {
      "title": "Causality: Models, Reasoning, and Inference (2nd ed.)",
      "authors": "Judea Pearl",
      "year": 2009,
      "role": "Foundation",
      "relationship_sentence": "Our identifiability theorems are explicitly stated for perfect do-interventions, adopting Pearl’s do-operator semantics to formalize how manipulating latent variables severs causal dependencies."
    },
    {
      "title": "Variational Autoencoders and Nonlinear ICA: A unifying framework",
      "authors": "Ilyes Khemakhem et al.",
      "year": 2020,
      "role": "Extension",
      "relationship_sentence": "We build on iVAE’s nonlinear-ICA-with-auxiliary-variables identifiability by interpreting interventions as structured auxiliary variables, and extend the theory to causally connected latents, leveraging intervention-induced support geometry to obtain permutation/scaling and block-affine identification."
    },
    {
      "title": "Unsupervised Feature Extraction by Time-Contrastive Learning and Nonlinear ICA",
      "authors": "Aapo Hyvarinen et al.",
      "year": 2016,
      "role": "Inspiration",
      "relationship_sentence": "The key idea that environment-induced distributional shifts can break nonlinear mixing ambiguities inspires our use of intervention-induced shifts whose geometric signatures on support enable identifiability."
    },
    {
      "title": "CITRIS: Causal Identifiability from Temporal Intervened Sequences",
      "authors": "Philipp Lippe et al.",
      "year": 2022,
      "role": "Gap Identification",
      "relationship_sentence": "CITRIS demonstrates learning causal representations from sequential interventions but relies on temporal structure and lacks general identifiability guarantees; our work addresses this gap by proving identifiability from generic perfect interventions via support geometry."
    },
    {
      "title": "Multidimensional Independent Component Analysis",
      "authors": "Jean-François Cardoso",
      "year": 1998,
      "role": "Related Problem",
      "relationship_sentence": "Our block-affine identifiability result mirrors the block recovery guarantees in Independent Subspace Analysis, providing the conceptual template for characterizing the residual entanglement equivalence class under interventions."
    }
  ],
  "synthesis_narrative": "The core advance of Interventional Causal Representation Learning is to prove identifiability of latent causal factors from interventional data by exploiting geometric signatures on the supports of latent variables. This direction is motivated by Locatello et al.’s impossibility result for observational disentanglement, which makes explicit that additional signals—such as interventions—are required. Pearl’s do-calculus provides the foundational semantics of perfect interventions that our theorems assume, specifying how do-operations sever ancestral dependencies in the latent causal graph. Technically, our work connects to the nonlinear ICA line that established identifiability from distributional shifts across environments: Hyvarinen and Morioka’s time-contrastive learning first showed how environment-induced changes can break nonlinear mixing, and Khemakhem et al.’s iVAE formalized identifiability with auxiliary variables. We extend this paradigm by treating interventions as a special, structured auxiliary variable and by focusing on the intervention-induced changes in support geometry, which allow us to prove identification up to permutation and scaling even when latents are causally dependent. Furthermore, our block-affine identifiability result is informed by the ISA perspective (Cardoso), clarifying that remaining ambiguities manifest as block-wise transformations. Relative to empirical interventional CRL methods like CITRIS, which rely on temporal sequences and offer limited general theory, we provide global identifiability guarantees from general perfect interventions without temporal assumptions, thereby closing a key theoretical gap.",
  "analysis_timestamp": "2026-01-06T23:09:26.558239"
}