{
  "prior_works": [
    {
      "title": "Differential Privacy Under Continual Observation",
      "authors": "Cynthia Dwork et al.",
      "year": 2010,
      "role": "Foundation",
      "relationship_sentence": "This paper introduced the continual release/observation model and the binary-tree mechanism, providing the formal framework our work adopts and the canonical O(log T) accuracy guarantees that our lower bounds fundamentally challenge."
    },
    {
      "title": "Private and Continual Release of Statistics",
      "authors": "T.-H. Hubert Chan et al.",
      "year": 2010,
      "role": "Baseline",
      "relationship_sentence": "Chan–Shi–Song developed the standard mechanisms achieving O(log T) error for running sums and related statistics in continual release; their guarantees are the primary baseline we separate from by proving a polynomial (T^{1/3}) gap for richer problems."
    },
    {
      "title": "Private Empirical Risk Minimization: Efficient Algorithms and Tight Bounds",
      "authors": "Raef Bassily et al.",
      "year": 2014,
      "role": "Foundation",
      "relationship_sentence": "This work established tight batch-model accuracy bounds for ERM-style problems; we use these batch-optimal rates as the benchmark to quantify the multiplicative T^{1/3} overhead inherent to continual release."
    },
    {
      "title": "On the Geometry of Differential Privacy",
      "authors": "Moritz Hardt et al.",
      "year": 2010,
      "role": "Foundation",
      "relationship_sentence": "Hardt–Talwar’s geometric lower-bound framework underpins batch lower bounds for linear/convex statistics that we rely on to calibrate our separations and informs aspects of our hard-instance constructions."
    },
    {
      "title": "Interactive Fingerprinting Codes and the Hardness of Releasing Adaptive Statistical Queries",
      "authors": "Thomas Steinke et al.",
      "year": 2015,
      "role": "Inspiration",
      "relationship_sentence": "Their interactive lower-bound methodology for adaptively chosen queries inspired our treatment of adaptively selected inputs in continual release and guides the adversarial structure in our lower-bound proofs."
    },
    {
      "title": "Preserving Statistical Validity in Adaptive Data Analysis",
      "authors": "Cynthia Dwork et al.",
      "year": 2015,
      "role": "Related Problem",
      "relationship_sentence": "By formalizing the challenges of adaptivity and showing how DP controls it, this work motivated our explicit model allowing inputs to depend on prior releases, capturing dependencies central to our accuracy–privacy tradeoffs."
    }
  ],
  "synthesis_narrative": "The core innovation of “The Price of Differential Privacy under Continual Observation” is to prove strong lower bounds—showing a ~T^{1/3} multiplicative accuracy gap—between continual release and batch models for fundamental ERM-related problems, and to formalize continual release with adaptively selected inputs. This line begins with Dwork, Naor, Pitassi, and Rothblum, who defined the continual observation setting and introduced the binary-tree mechanism, establishing O(log T) accuracy as the canonical guarantee. Chan, Shi, and Song broadened this toolkit and cemented O(log T) as the prevailing baseline across streaming statistics, implicitly posing whether larger gaps versus batch were inherent for more complex tasks. To quantify a separation, the present work must anchor batch accuracy: Bassily, Smith, and Thakurta’s tight bounds for private ERM, together with geometric lower-bound techniques of Hardt and Talwar, supply the batch-optimal benchmarks and proof ingredients that our results leverage to demonstrate a polynomial gap. A second thrust of the paper is modeling and analyzing adaptively selected inputs—data streams that react to previously released outputs. Here, two threads directly inform the approach: Steinke and Ullman’s interactive fingerprinting codes provide a blueprint for proving lower bounds under adaptivity, and Dwork et al.’s adaptive data analysis framework motivates capturing such dependencies explicitly. Together these works furnish the problem formulation, baselines, and lower-bound machinery that our paper extends to reveal the intrinsic accuracy cost of privacy under continual observation.",
  "analysis_timestamp": "2026-01-06T23:09:26.517902"
}