{
  "prior_works": [
    {
      "title": "Tilted Empirical Risk Minimization",
      "authors": "Weifeng Liu et al.",
      "year": 2022,
      "role": "Foundation",
      "relationship_sentence": "Introduces the TERM objective that reweights per-example losses via a tilt operator; TSAM directly instantiates this risk formulation within sparse additive modeling to handle robustness, imbalance, and multiobjective goals."
    },
    {
      "title": "Sparse Additive Models",
      "authors": "Pradeep Ravikumar et al.",
      "year": 2009,
      "role": "Baseline",
      "relationship_sentence": "Provides the canonical sparse additive modeling framework under ERM that TSAM explicitly upgrades by replacing ERM with TERM to obtain robustness and class-imbalance adaptivity while retaining sparsity and interpretability."
    },
    {
      "title": "High-dimensional additive modeling",
      "authors": "Lukas Meier et al.",
      "year": 2009,
      "role": "Extension",
      "relationship_sentence": "Develops l1/group-sparsity penalized additive modeling with basis expansions; TSAM adopts this structural/penalization machinery and directly modifies the objective by applying the tilted risk in place of ERM."
    },
    {
      "title": "Minimax-Optimal Rates for Sparse Additive Models over Kernel Classes",
      "authors": "Garvesh Raskutti et al.",
      "year": 2012,
      "role": "Foundation",
      "relationship_sentence": "Establishes theoretical tools and rates for sparse additive RKHS classes that TSAM leverages when deriving generalization and approximation error bounds under the tilted risk."
    },
    {
      "title": "Generalized Additive Models",
      "authors": "Trevor Hastie et al.",
      "year": 1990,
      "role": "Foundation",
      "relationship_sentence": "Introduces the additive modeling paradigm that underlies TSAM’s interpretable component-wise function decomposition."
    },
    {
      "title": "Regression Quantiles",
      "authors": "Roger Koenker et al.",
      "year": 1978,
      "role": "Inspiration",
      "relationship_sentence": "Pioneers tilted (check) loss to target conditional quantiles, directly inspiring the idea of emphasizing specific parts of the loss distribution that TERM systematizes and TSAM exploits in additive modeling."
    },
    {
      "title": "Focal Loss for Dense Object Detection",
      "authors": "Tsung-Yi Lin et al.",
      "year": 2017,
      "role": "Gap Identification",
      "relationship_sentence": "Shows that modulating per-example loss mitigates class imbalance but is task-specific; TSAM, via TERM, addresses this gap by offering a principled, general tilting mechanism applicable to sparse additive models."
    }
  ],
  "synthesis_narrative": "Tilted Sparse Additive Models (TSAM) fuse two mature lines of work—sparse additive modeling and tilted risk—to create a robust, imbalance-aware, yet interpretable learner. The additive modeling foundation originates from Hastie and Tibshirani’s Generalized Additive Models, which established the component-wise function decomposition TSAM retains. In high dimensions, Meier–van de Geer–Bühlmann and Ravikumar et al. advanced sparse additive estimation with l1/group-sparsity penalties and basis expansions; TSAM directly inherits this structure but replaces the standard ERM objective at the heart of these baselines. The theoretical understanding of additive function classes, notably the minimax and RKHS-based analyses of Raskutti–Wainwright–Yu, informs TSAM’s generalization and approximation error bounds under the new risk.\n\nOn the objective side, Koenker and Bassett’s Regression Quantiles introduced tilted (check) losses that explicitly emphasize certain distributional regions, a core inspiration for TERM. Lin et al.’s Focal Loss further demonstrated that per-example loss modulation alleviates class imbalance, but in a task-specific manner, highlighting a gap for a general, principled formulation. Liu et al.’s Tilted Empirical Risk Minimization provides that unifying formulation: a tilt operator over individual losses that yields robustness, imbalance adaptivity, and multiobjective flexibility. TSAM’s key innovation is to embed TERM within the sparse additive framework, thereby marrying interpretability and variable selection with the robustness and flexibility of tilted risk, and extending both methodological practice and theory in additive modeling beyond ERM.",
  "analysis_timestamp": "2026-01-06T23:09:26.576081"
}