{
  "prior_works": [
    {
      "title": "Sum-Product Networks: A New Deep Architecture",
      "authors": "Hoifung Poon, Pedro Domingos",
      "year": 2011,
      "role": "Foundational model introducing tractable probabilistic circuits",
      "relationship_sentence": "Established decomposability/completeness for SPNs and the paradigm of tractable inference via circuit structure, providing the baseline circuit families and properties whose size–expressivity trade-offs this paper analyzes under approximation."
    },
    {
      "title": "A Differential Approach to Inference in Bayesian Networks",
      "authors": "Adnan Darwiche",
      "year": 2003,
      "role": "Introduced arithmetic circuits linking inference complexity to circuit size",
      "relationship_sentence": "Showed that inference cost scales with circuit size, a core premise the present paper leverages when proving that even approximate distributional fit can require large circuits in TPM families."
    },
    {
      "title": "A Knowledge Compilation Map",
      "authors": "Adnan Darwiche, Pierre Marquis",
      "year": 2002,
      "role": "Framework for decomposability, determinism, and succinctness in circuit languages",
      "relationship_sentence": "Provided the structural notions (determinism, decomposability, smoothness) and succinctness lens that the paper uses to formalize TPM classes and extend size lower bounds from exact representation to approximation."
    },
    {
      "title": "Probabilistic Circuits: A Unifying Framework for Tractable Probabilistic Modeling",
      "authors": "YooJung Choi, Antonio Vergari, Guy Van den Broeck",
      "year": 2020,
      "role": "Unified taxonomy of probabilistic circuits and tractable model families",
      "relationship_sentence": "Supplied the formal PC framework and taxonomy across which the new hardness-of-approximation results are stated, comparing structural restrictions and their impact on expressive efficiency."
    },
    {
      "title": "Shallow vs. Deep Sum-Product Networks",
      "authors": "Olivier Delalleau, Yoshua Bengio",
      "year": 2011,
      "role": "Depth separation and expressive efficiency for SPNs (exact representation)",
      "relationship_sentence": "Demonstrated exponential size gaps between shallow and deep SPNs, a template the paper extends by showing that similar separations persist even when only approximate distributional accuracy is required."
    },
    {
      "title": "On the Expressive Power of Sum-Product Networks",
      "authors": "James Martens, Vatsal Medabalimi",
      "year": 2014,
      "role": "Lower bounds for deterministic/decomposable SPNs",
      "relationship_sentence": "Provided techniques and canonical hard distributions for deriving size lower bounds under structural constraints, which the paper adapts to prove hardness under approximation metrics for TPMs."
    },
    {
      "title": "SDDs: A New Canonical Representation of Boolean Functions",
      "authors": "Adnan Darwiche",
      "year": 2011,
      "role": "Structured decomposable circuits and succinctness trade-offs",
      "relationship_sentence": "Introduced structured decomposability (via vtrees) central to many TPMs; the paper exploits these structural restrictions to show that even approximating certain distributions demands large structured circuits."
    }
  ],
  "synthesis_narrative": "The paper’s core contribution—proving hardness-of-approximation results for tractable probabilistic models—rests on the circuit-based view of probabilistic inference and expressivity inaugurated by arithmetic circuits and sum–product networks. Darwiche’s differential inference work established that tractable inference is enabled by circuit structure and that computation scales with circuit size, directly motivating a size-centered analysis under approximation. The Knowledge Compilation Map further distilled the key structural properties—decomposability, determinism, and smoothness—and connected them to succinctness, providing the lens through which many TPM families are defined and compared.\n\nBuilding on this foundation, the SPN line of work (Poon & Domingos; Delalleau & Bengio; Martens & Medabalimi) supplied concrete circuit classes and hard functions used to derive size separations and lower bounds under exact representation. Delalleau & Bengio’s depth separations and Martens & Medabalimi’s lower-bound techniques suggest how structural constraints induce exponential size blowups—insights that this paper transports to the approximate setting, showing that permitting nonzero error in standard statistical distances does not always eliminate these blowups. Finally, the unifying probabilistic circuits framework by Choi, Vergari, and Van den Broeck, together with structured decomposability from SDDs, gives the taxonomy and structural regimes across which the new results are formulated. Together, these works directly shape the paper’s methodology and statements: they define the model families, the structural constraints enabling tractability, and the proof strategies for establishing that even approximating certain distributions requires large circuits.",
  "analysis_timestamp": "2026-01-07T00:21:33.131501"
}