{
  "prior_works": [
    {
      "title": "Zur Theorie der Gesellschaftsspiele (On the Theory of Games of Strategy)",
      "authors": "John von Neumann",
      "year": 1928,
      "role": "Foundational theory (minimax and value of randomization)",
      "relationship_sentence": "MERIT’s maximin randomized selection can be cast as a zero-sum game against Nature over interval uncertainty, and von Neumann’s minimax theorem underpins why allowing mixed (randomized) strategies is essential and can strictly improve worst‑case performance."
    },
    {
      "title": "Maxmin Expected Utility with Non-Unique Priors",
      "authors": "Itzhak Gilboa, David Schmeidler",
      "year": 1989,
      "role": "Decision-theoretic foundation (robust/ambiguity-averse objective)",
      "relationship_sentence": "The paper’s objective—maximize the worst‑case expected number of true top‑k items selected given an uncertainty set—directly instantiates maxmin expected utility with set‑valued beliefs, specialized here to interval uncertainty over item qualities."
    },
    {
      "title": "Robust Optimization",
      "authors": "Aharon Ben‑Tal, Arkadi Nemirovski",
      "year": 2009,
      "role": "Framework for optimization under uncertainty sets",
      "relationship_sentence": "MERIT’s use of intervals as uncertainty sets and its tractable robust counterpart build on the robust optimization paradigm, leveraging convexity/duality insights to obtain polynomial‑time algorithms with interpretable robustness."
    },
    {
      "title": "The Price of Robustness",
      "authors": "Dimitris Bertsimas, Melvyn Sim",
      "year": 2004,
      "role": "Algorithmic technique for interval uncertainty (tractable robust counterparts)",
      "relationship_sentence": "The paper’s practically efficient algorithm for worst‑case guarantees over interval uncertainty echoes Bertsimas–Sim’s approach to constructing scalable robust formulations and quantifying robustness–performance tradeoffs."
    },
    {
      "title": "Robust Discrete Optimization and Its Applications",
      "authors": "Panos Kouvelis, Gang Yu",
      "year": 1997,
      "role": "Foundational robust selection in discrete optimization",
      "relationship_sentence": "MERIT extends robust selection ideas to a top‑k setting with randomized policies and interval‑valued qualities, drawing on structural insights from robust discrete optimization about min–max formulations over combinatorial decision spaces."
    },
    {
      "title": "Funding Science by Lottery",
      "authors": "Stefan Avin",
      "year": 2015,
      "role": "Policy motivation and formal critique of deterministic funding decisions",
      "relationship_sentence": "Avin’s argument for lotteries in research funding motivates randomized selection; MERIT provides the missing formalism by specifying an optimal lottery grounded in a clear worst‑case objective and uncertainty model."
    },
    {
      "title": "Research Funding: The Case for a Modified Lottery",
      "authors": "Ferric C. Fang, Arturo Casadevall",
      "year": 2016,
      "role": "Application impetus for randomized selection in grants",
      "relationship_sentence": "This advocacy for partial lotteries in grant funding highlights the inadequacy of deterministic rules under noisy evaluations, and MERIT directly answers it with a principled, goal‑aligned randomized mechanism with provable guarantees."
    }
  ],
  "synthesis_narrative": "MERIT sits at the intersection of decision theory, robust optimization, and practical policy debates on randomized selection. From decision theory, von Neumann’s minimax theorem legitimizes randomization when facing an adversarial or ambiguous environment, while Gilboa–Schmeidler’s maxmin expected utility provides the precise objective MERIT optimizes: the worst‑case expected hit rate of true top‑k selections under non‑singleton beliefs. Robust optimization, particularly the Ben‑Tal–Nemirovski framework and the Bertsimas–Sim tractable treatments of interval uncertainty, informs MERIT’s modeling of overlapping confidence intervals as uncertainty sets and the derivation of a polynomial‑time, practically efficient algorithm. Classical robust discrete optimization (Kouvelis–Yu) contributes structural insights for handling min–max objectives over combinatorial selection spaces, which MERIT adapts to allow mixed (randomized) policies rather than purely deterministic choices.\n\nOn the application side, the literature advocating lotteries in science funding (Avin; Fang & Casadevall) identifies both the prevalence of evaluation noise and the appeal of randomness but lacks a principled objective and mechanism design. MERIT closes this gap by specifying an interpretable robustness criterion—maximize worst‑case expected inclusion of the true top‑k—and constructing the optimal randomized allocation consistent with interval uncertainty. Together, these strands directly shape MERIT’s core innovation: a principled, axiomatic, and computationally tractable randomized top‑k selection rule that supersedes ad hoc lottery practices.",
  "analysis_timestamp": "2026-01-06T23:42:48.124695"
}