{
  "prior_works": [
    {
      "title": "An Introduction to Random Matrices",
      "authors": "Greg W. Anderson, Alice Guionnet, Ofer Zeitouni",
      "year": 2010,
      "role": "Theoretical foundation (free probability and free compression)",
      "relationship_sentence": "Provides the free-probability toolkit—Cauchy/Blue transforms, subordination, and the effect of compressing by a free projection—that underlies modeling principal-submatrix masking as a free compression, which this paper inverts via “free decompression.”"
    },
    {
      "title": "Rectangular free convolution: linearization, topological support, and atoms",
      "authors": "Florent Benaych-Georges",
      "year": 2009,
      "role": "Core theory of rectangular/free compression transforms",
      "relationship_sentence": "Formalizes rectangular free convolution and the analytic relations for spectra under aspect-ratio compression; the present work leverages these relations and effectively performs the inverse mapping to recover the full spectrum from compressed (masked) blocks."
    },
    {
      "title": "Spectrum estimation: A unified framework for covariance matrix estimation and PCA in large dimensions",
      "authors": "Olivier Ledoit, Michael Wolf",
      "year": 2015,
      "role": "Free deconvolution blueprint for population spectrum estimation (QuEST)",
      "relationship_sentence": "Demonstrates how to invert Marčenko–Pastur (a free multiplicative convolution) to estimate population spectral distributions from sample eigenvalues; this paper adapts that deconvolution paradigm to the free-compression setting induced by masking/subsampling of matrices."
    },
    {
      "title": "Efficient computation of limit spectra of sample covariance matrices",
      "authors": "Edgar Dobriban",
      "year": 2015,
      "role": "Numerical methodology for solving free-convolution fixed-point equations",
      "relationship_sentence": "Introduces fast, stable algorithms (Spectrode-type approaches) to compute spectral densities via Stieltjes-transform fixed points; the present work relies on analogous subordination numerics to stably perform free decompression from masked observations."
    },
    {
      "title": "Revisiting the Nyström method for improved large-scale machine learning",
      "authors": "Alex Gittens, Michael W. Mahoney",
      "year": 2016,
      "role": "Submatrix-based spectral approximation for kernels",
      "relationship_sentence": "Establishes that carefully chosen submatrices/columns can capture global spectral structure of large PSD matrices; the new approach extends this submatrix-access philosophy by using tiny masked principal blocks and a principled decompression map to recover the full spectrum."
    },
    {
      "title": "Fast Estimation of tr(f(A)) via Stochastic Lanczos Quadrature",
      "authors": "S. Ubaru, J. Chen, Y. Saad",
      "year": 2017,
      "role": "Contrasting baseline: matvec-based spectral estimation",
      "relationship_sentence": "SLQ is a leading approach for estimating spectral densities, traces, and log-determinants from matrix–vector products; the limits of SLQ when matvecs are unavailable directly motivate the paper’s alternative access model and its decompression-based estimator."
    }
  ],
  "synthesis_narrative": "The paper’s core contribution—recovering the eigenvalue distribution of a large, impalpable matrix from only tiny masked submatrices—stands on three converging lines of prior work. First, free probability provides the conceptual and analytic backbone. Results summarized in Anderson–Guionnet–Zeitouni and refined in Benaych-Georges establish how spectral laws transform under projection/rectangular operations (free compression), via Stieltjes/Blue transforms and subordination. The present method inverts that map: given the spectrum of compressed (masked) principal blocks, it performs a free decompression to estimate the original global spectrum.\n\nSecond, practical deconvolution of spectral laws has precedents in high-dimensional covariance estimation. Ledoit–Wolf’s QuEST shows how to invert Marčenko–Pastur to estimate population spectra from sample eigenvalues, while Dobriban develops stable numerical solvers for the associated fixed-point/subordination equations. This work adapts those numerical ideas to the compression-induced transforms, yielding a robust pipeline for decompression from limited, blockwise access.\n\nThird, the access model and evaluation targets connect to scalable spectral approximation in ML. Nyström methods demonstrate that small submatrices can retain essential spectral information of kernels, inspiring the use of restricted sub-blocks. Meanwhile, matvec-based estimators like Stochastic Lanczos Quadrature motivate the need for an alternative when even implicit operators are unavailable, while still aiming to compute quantities such as log-determinants and traces of matrix functions. Together, these works directly shape the paper’s theory, algorithms, and problem framing.",
  "analysis_timestamp": "2026-01-06T23:42:48.163468"
}