{
  "prior_works": [
    {
      "title": "Local privacy and statistical minimax rates",
      "authors": "John C. Duchi, Michael I. Jordan, Martin J. Wainwright",
      "year": 2013,
      "role": "Foundational LDP minimax framework and interactive vs. non-interactive protocols",
      "relationship_sentence": "This paper provides the local-DP channel model and minimax lower-bound machinery the authors adapt to the vertically partitioned, two-server setting to derive optimal correlation estimation rates under non-interactive and interactive mechanisms."
    },
    {
      "title": "Extremal mechanisms for local differential privacy",
      "authors": "Peter Kairouz, Sewoong Oh, Pramod Viswanath",
      "year": 2016,
      "role": "Mechanism design under LDP; optimal privatization for simple statistics",
      "relationship_sentence": "The extremal-mechanism characterizations inform the construction of per-server privatizers (e.g., optimal binary/linear mechanisms) that yield rate-optimal estimators of coordinate-wise moments needed for correlation."
    },
    {
      "title": "Inference under information constraints: Lower bounds from chi-square contraction",
      "authors": "Jayadev Acharya, Clément L. Canonne, Himanshu Tyagi",
      "year": 2019,
      "role": "General lower-bound technique for privacy/communication constrained inference (including interactivity)",
      "relationship_sentence": "The chi-square contraction framework directly underpins the paper’s minimax lower bounds comparing interactive and non-interactive protocols under heterogeneous local privacy budgets."
    },
    {
      "title": "Randomized response: A survey technique for eliminating evasive answer bias",
      "authors": "Stanley L. Warner",
      "year": 1965,
      "role": "Primitive LDP mechanism for binary data",
      "relationship_sentence": "Randomized response serves as a building block for privatizing signs/indicators across servers, enabling unbiased and variance-controlled estimation of cross-moments that feed into the correlation estimator."
    },
    {
      "title": "Differentially Private Ordinary Least Squares",
      "authors": "Or Sheffet",
      "year": 2019,
      "role": "Private covariance/linear regression estimation and inference",
      "relationship_sentence": "Techniques for privatizing and debiasing second-order statistics and constructing confidence intervals inform the paper’s development of feasible correlation estimators and valid CIs under privacy noise."
    },
    {
      "title": "Local, Private, Efficient Protocols for Succinct Histograms",
      "authors": "Raef Bassily, Adam Smith",
      "year": 2015,
      "role": "Algorithmic and lower-bound foundations for non-interactive LDP estimation",
      "relationship_sentence": "Results on optimal non-interactive LDP aggregation and variance/sample complexity guide the paper’s design and analysis of non-interactive two-server mechanisms for estimating correlation from privatized marginals."
    }
  ],
  "synthesis_narrative": "The paper’s core advance—minimax-optimal correlation estimation when X and Y are split across two privacy-constrained servers—rests on the modern local differential privacy (LDP) minimax program and information-constrained inference. Duchi, Jordan, and Wainwright established the channel-based LDP framework and separation between interactive and non-interactive protocols, which this work extends to a vertically partitioned two-server model with heterogeneous (ε,δ) budgets, translating their paradigm to cross-moment estimation needed for correlation. Acharya, Canonne, and Tyagi’s chi-square contraction method supplies a flexible lower-bound toolkit that directly supports the paper’s rate-optimality claims and its comparisons of interaction benefits under asymmetric privacy. On the constructive side, Kairouz, Oh, and Viswanath’s extremal-mechanism results inform the choice of per-server privatization for low-order moments (means and second moments), yielding near-optimal noise-accuracy tradeoffs in both non-interactive and interactive designs. At the mechanism level, Warner’s randomized response provides robust primitives for privatizing binary transforms (e.g., signs/thresholded features) that enable unbiased cross-moment estimation when raw pairs cannot be shared. For inference, Sheffet’s techniques for privately estimating covariance/OLS and forming valid confidence intervals guide the development of debiased correlation estimators with quantifiable uncertainty under injected noise. Finally, Bassily and Smith’s results on optimal non-interactive LDP aggregation anchor the analysis of one-shot protocols, clarifying when interaction is necessary. Together, these works directly enable the paper’s unified characterization of minimax rates and practical procedures for correlation across privacy barriers.",
  "analysis_timestamp": "2026-01-07T00:02:04.929273"
}