{
  "prior_works": [
    {
      "title": "A contextual-bandit approach to personalized news article recommendation",
      "authors": "Lihong Li, Wei Chu, John Langford, Robert E. Schapire",
      "year": 2010,
      "role": "Contextual bandit foundation (LinUCB)",
      "relationship_sentence": "CaMVo’s adaptive per-instance selection of which LLMs to query directly instantiates the LinUCB principle, using contextual embeddings to balance exploration and exploitation under uncertainty."
    },
    {
      "title": "Maximum Likelihood Estimation of Observer Error-Rates Using the EM Algorithm",
      "authors": "A. P. Dawid, A. M. Skene",
      "year": 1979,
      "role": "Unsupervised annotator reliability estimation",
      "relationship_sentence": "CaMVo’s Bayesian estimator for per-LLM accuracy lower bounds parallels the Dawid–Skene idea of inferring labeler reliabilities without ground-truth, enabling weighted aggregation in a fully unsupervised manner."
    },
    {
      "title": "Whose vote should count more: Optimal integration of labels from labelers of unknown expertise",
      "authors": "Jacob Whitehill, Paul Ruvolo, Ting-Fan Wu, Jacob Bergsma, Javier R. Movellan",
      "year": 2009,
      "role": "Difficulty-aware weighted voting (GLAD)",
      "relationship_sentence": "CaMVo’s weighted majority voting and instance-conditional reliability estimation echo GLAD’s core insight of weighting annotators by inferred expertise and item difficulty when ground truth is absent."
    },
    {
      "title": "Learning from Crowds",
      "authors": "Vikas C. Raykar, Shipeng Yu, Linda H. Zhao, Gerardo H. Valadez, Charles Florin, Luca Bogoni, Linda Moy",
      "year": 2010,
      "role": "Probabilistic aggregation of noisy annotators",
      "relationship_sentence": "The CaMVo framework builds on probabilistic perspectives of aggregating multiple noisy annotators by modeling per-annotator accuracies, adapting them to LLMs and using Bayesian confidence to guide aggregation."
    },
    {
      "title": "Combinatorial Multi-Armed Bandit: General Framework and Applications",
      "authors": "Wei Chen, Yajun Wang, Yang Yuan",
      "year": 2013,
      "role": "Subset selection under bandit feedback",
      "relationship_sentence": "CaMVo’s instance-wise selection of a subset of LLMs is a combinatorial bandit decision, leveraging contextual information to choose sets of arms (LLMs) to query before performing aggregation."
    },
    {
      "title": "Bandits with Knapsacks",
      "authors": "Ashwinkumar Badanidiyuru, Robert Kleinberg, Aleksandrs Slivkins",
      "year": 2013,
      "role": "Cost/constraint-aware exploration",
      "relationship_sentence": "The explicit balancing of labeling accuracy against per-query cost in CaMVo is grounded in bandits-with-resource-constraints, guiding cost-aware querying policies over LLMs."
    },
    {
      "title": "Self-Consistency Improves Chain of Thought Reasoning in Language Models",
      "authors": "Xuezhi Wang, Jason Wei, Dale Schuurmans, Quoc V. Le, Ed H. Chi",
      "year": 2023,
      "role": "Voting-based reliability gains for LMs",
      "relationship_sentence": "CaMVo’s use of majority/weighted voting across multiple model responses is motivated by self-consistency’s demonstration that aggregating multiple independent signals markedly improves reliability."
    }
  ],
  "synthesis_narrative": "CaMVo’s core innovation—online, cost-aware selection of a subset of LLMs per instance with weighted majority aggregation absent ground truth—sits at the intersection of contextual bandits and crowdsourced label aggregation. LinUCB (Li et al., 2010) is the methodological backbone for CaMVo’s per-instance querying policy: contextual embeddings represent items, and uncertainty-aware upper confidence bounds drive exploration versus exploitation over LLMs. The framework’s explicit budget-conscious querying is informed by Bandits with Knapsacks (Badanidiyuru et al., 2013) and combinatorial bandits (Chen et al., 2013), which formalize selecting sets of arms under resource constraints, closely mirroring CaMVo’s subset-of-LLMs decision under cost. On the aggregation side, CaMVo’s Bayesian estimator that infers (and lower-bounds) per-LLM accuracy without supervision directly descends from classic crowd models. Dawid–Skene (1979) established unsupervised annotator reliability estimation; GLAD (Whitehill et al., 2009) added instance difficulty and expertise-weighted voting; and Raykar et al. (2010) framed probabilistic aggregation for multiple noisy annotators. CaMVo adapts these principles to machine annotators (LLMs), fusing them with online selection to weight votes by inferred reliability. Finally, recent LLM literature shows the efficacy of voting over multiple signals—Self-Consistency (Wang et al., 2023) empirically validates that plurality and aggregation improve accuracy—providing the immediate LLM context and the baseline CaMVo aims to match at lower cost. Together, these works directly enable CaMVo’s design: a contextual-bandit-driven, cost-aware querying strategy coupled with principled, unsupervised reliability-weighted voting for high-quality, economical LLM-based annotation.",
  "analysis_timestamp": "2026-01-07T00:29:42.054058"
}