{
  "prior_works": [
    {
      "title": "Label Enhancement: Recovering Label Distributions from Logical Labels",
      "authors": "Xin Geng et al.",
      "year": 2016,
      "role": "Foundational formulation of label enhancement (LE)",
      "relationship_sentence": "Defines the LE problem of inferring label distributions from logical multi-labels, providing the task setting and motivation that PROM directly addresses with a new probabilistic ranking-based formulation."
    },
    {
      "title": "Label Distribution Learning",
      "authors": "Xin Geng",
      "year": 2016,
      "role": "Conceptual foundation of label distributions",
      "relationship_sentence": "Establishes the notion of label distributions as targets, motivating the need to model principled links between distributions and rankings that PROM formalizes via orderliness and monotonicity."
    },
    {
      "title": "Multilabel Classification via Calibrated Label Ranking",
      "authors": "Johannes Fürnkranz; Eyke Hüllermeier; Eneldo Loza Mencia; Klaus Brinker",
      "year": 2008,
      "role": "Demonstrated benefits of label ranking for multi-label tasks",
      "relationship_sentence": "Shows that learning pairwise label preferences and calibrating them can improve multi-label prediction, directly inspiring PROM’s use of label ranking signals to enhance label distributions."
    },
    {
      "title": "Pairwise Preference Learning and Ranking",
      "authors": "Johannes Fürnkranz; Eyke Hüllermeier",
      "year": 2003,
      "role": "Methodological basis for pairwise label ranking",
      "relationship_sentence": "Introduces the pairwise decomposition framework for ranking, underpinning PROM’s pairwise modeling of inter-label comparisons when inferring distribution-consistent rankings."
    },
    {
      "title": "Rank Analysis of Incomplete Block Designs: The Method of Paired Comparisons",
      "authors": "Ralph Allan Bradley; Milton E. Terry",
      "year": 1952,
      "role": "Probabilistic model for pairwise comparisons",
      "relationship_sentence": "Provides a monotone logistic link between latent scores and pairwise win probabilities, a core probabilistic mechanism mirrored in PROM’s monotonicity assumption relating label intensities to comparison probabilities."
    },
    {
      "title": "On Extending the Bradley–Terry Model to Incorporate Ties in Paired Comparisons",
      "authors": "Roger D. Davidson",
      "year": 1970,
      "role": "Handling ties in pairwise ranking",
      "relationship_sentence": "Extends pairwise probability models to allow ties, directly informing PROM’s treatment of equally important labels within its ranking–distribution linkage."
    },
    {
      "title": "The Analysis of Permutations",
      "authors": "R. L. Plackett",
      "year": 1975,
      "role": "Listwise probabilistic ranking model",
      "relationship_sentence": "Establishes a probability model over rankings that is orderly with respect to latent utilities, influencing PROM’s orderliness assumption connecting consistent rankings to underlying label probabilities."
    }
  ],
  "synthesis_narrative": "PROM’s core contribution—deriving a probabilistic bridge from label distributions to label rankings under explicit orderliness and monotonicity, while accommodating ties—rests on two converging lines of prior work. From the label-distribution side, Geng’s formulations of label distribution learning (LDL) and label enhancement (LE) established the objective of recovering nuanced label intensities from coarse multi-label annotations, but left open how to rigorously exploit ranking information during enhancement. From the ranking side, classical preference-learning and probabilistic ranking models supplied the missing mathematical tools. The pairwise preference framework of Fürnkranz and Hüllermeier provided a scalable decomposition for learning inter-label relations, while calibrated label ranking demonstrated that pairwise rankings can be converted into calibrated signals beneficial for multi-label prediction—motivating their use for reconstructing label distributions. At the probabilistic level, the Bradley–Terry model introduced a monotone link between latent scores and pairwise win probabilities, and Davidson’s extension incorporated ties, directly aligning with PROM’s need to map differences (or equality) in label intensities to probabilities of >, =, and < relations. Finally, the Plackett–Luce family grounded an orderly connection between latent utilities and full rankings, reinforcing PROM’s orderliness assumption. Together, these works enabled PROM to formalize a principled, probabilistic, pairwise mechanism that faithfully encodes how label distributions imply ranking relations—complete with monotonicity and tie handling—and to leverage these constraints for more accurate label enhancement.",
  "analysis_timestamp": "2026-01-07T00:05:12.520832"
}