{
  "prior_works": [
    {
      "title": "Learning Fair Representations",
      "authors": "Rich Zemel, Yu Wu, Kevin Swersky, Toniann Pitassi, Cynthia Dwork",
      "year": 2013,
      "role": "Foundational fair representation framework establishing the fairness–utility trade-off",
      "relationship_sentence": "Introduced the notion of fair representations and the intrinsic accuracy–fairness Pareto trade-off that this paper seeks to compute efficiently, providing the baseline paradigm the new method strategically avoids training."
    },
    {
      "title": "Censoring Representations with an Adversary",
      "authors": "Harrison Edwards, Amos Storkey",
      "year": 2016,
      "role": "Adversarial learning approach to fair representations",
      "relationship_sentence": "Showed how to remove sensitive information via adversarial training, a class of complex fair-representation models that the present work replaces with a discrete reduction grounded in structural theory."
    },
    {
      "title": "Equality of Opportunity in Supervised Learning",
      "authors": "Moritz Hardt, Eric Price, Nati Srebro",
      "year": 2016,
      "role": "Structural characterization of optimal fair classifiers via ROC geometry and randomized thresholding",
      "relationship_sentence": "Characterized optimal solutions for equalized-odds post-processing as group-specific thresholds and randomization on ROC convex hulls, directly informing this paper’s structural properties and discrete reduction for Pareto-front computation."
    },
    {
      "title": "Fairness Beyond Disparate Treatment and Disparate Impact",
      "authors": "Muhammad Bilal Zafar, Isabel Valera, Manuel Gomez-Rodriguez, Krishna P. Gummadi",
      "year": 2017,
      "role": "Convex surrogate formulation of fairness constraints enabling efficient trade-off optimization",
      "relationship_sentence": "Demonstrated that fairness–accuracy trade-offs can be optimized via convex surrogates, motivating the present work’s compact optimization viewpoint and its use of standard optimization machinery."
    },
    {
      "title": "A Reductions Approach to Fair Classification",
      "authors": "Alekh Agarwal, Alina Beygelzimer, Miroslav Dudík, John Langford, Hanna Wallach",
      "year": 2018,
      "role": "Reduction of constrained fair learning to cost-sensitive classification",
      "relationship_sentence": "Provided a principled reduction framework for fair classification, inspiring this paper’s reduction of Pareto-front computation to a compact discrete problem that can be solved efficiently."
    },
    {
      "title": "The Cost of Fairness in Binary Classification",
      "authors": "Aditya Krishna Menon, Robert C. Williamson",
      "year": 2018,
      "role": "Theoretical analysis of accuracy–fairness trade-offs and optimal decision rules",
      "relationship_sentence": "Analyzed the geometry of fairness constraints and showed optimality of threshold-based rules under various notions, supporting this paper’s derivation of structural properties that enable exact Pareto-front computation."
    },
    {
      "title": "The Concave-Convex Procedure (CCCP)",
      "authors": "Alan L. Yuille, Anand Rangarajan",
      "year": 2003,
      "role": "General-purpose algorithm for solving difference-of-convex programs",
      "relationship_sentence": "Provides the off-the-shelf concave–convex optimization method leveraged to efficiently solve the compact approximating problems that arise from the paper’s discrete reduction."
    }
  ],
  "synthesis_narrative": "The paper’s core innovation—computing the optimal fairness–performance Pareto front without training complex models—emerges from unifying structural insights about optimal fair decisions with reductionist optimization techniques. Early representation-learning work by Zemel et al. established the fairness–utility trade-off and popularized fair representations, while adversarial approaches like Edwards and Storkey refined this paradigm but at the cost of heavy modeling. In contrast, Hardt et al. provided a geometric and probabilistic characterization of optimal fair classifiers via ROC convexification and group-specific thresholding, revealing discrete structure (thresholds and randomization) that directly suggests compact representations of the trade-off surface. Menon and Williamson further formalized the “price of fairness,” proving threshold optimality under various constraints and clarifying the geometry of Pareto-optimal solutions. On the algorithmic side, Zafar et al. and Agarwal et al. showed that fairness-constrained learning can be reframed as convex or cost-sensitive optimization, legitimizing reductions that trade modeling complexity for principled optimization. Building on these, the present paper derives structural properties of optimal fair representations and classifiers that reduce Pareto-front computation to a compact discrete problem, then solves the resulting difference-of-convex formulations efficiently using CCCP (Yuille and Rangarajan). The synthesis yields an end-to-end methodology that bypasses training complex fair-representation models while delivering exact, efficiently computable Pareto fronts for both representations and classifiers.",
  "analysis_timestamp": "2026-01-06T23:42:48.133664"
}