{
  "prior_works": [
    {
      "title": "Shortest-Path Kernels on Graphs",
      "authors": "Karsten M. Borgwardt, Hans-Peter Kriegel",
      "year": 2005,
      "role": "Core kernel primitive for path-based structural similarity",
      "relationship_sentence": "HSP-GKN builds directly on the shortest-path kernel’s idea of summarizing graphs via distributions over shortest-path pairs, then extends it into a hierarchical, learnable representation."
    },
    {
      "title": "Weisfeiler-Lehman Graph Kernels",
      "authors": "Nino Shervashidze, Pascal Schweitzer, Erik Jan van Leeuwen, Kurt Mehlhorn, Karsten M. Borgwardt",
      "year": 2011,
      "role": "Hierarchical feature construction on graphs",
      "relationship_sentence": "The paper’s hierarchical feature design is inspired by WL-style multi-level refinement, providing the blueprint for progressively aggregating local-to-global structural semantics before neural matching."
    },
    {
      "title": "Subgraph Matching Kernels for Attributed Graphs",
      "authors": "Nils M. Kriege, Petra Mutzel",
      "year": 2012,
      "role": "Attribute-aware graph similarity via matching",
      "relationship_sentence": "HSP-GKN’s goal of preserving semantic (attribute) information alongside structure echoes subgraph matching kernels, motivating attribute-sensitive comparisons within path-derived features."
    },
    {
      "title": "Deep Graph Kernels",
      "authors": "Pinar Yanardag, S. V. N. Vishwanathan",
      "year": 2015,
      "role": "Learning representations of substructures to enhance kernels",
      "relationship_sentence": "The move from fixed kernel feature spaces to learned substructure embeddings directly informs HSP-GKN’s learnable hidden graph features that adapt similarity to the task."
    },
    {
      "title": "On Valid Optimal Assignment Kernels and Applications to Graph Classification",
      "authors": "Nils M. Kriege, Pierre-L. Giscard, Richard C. Wilson",
      "year": 2016,
      "role": "Set-to-set matching formulation within graph kernels",
      "relationship_sentence": "The learnable matching of hierarchical features in HSP-GKN is conceptually aligned with assignment-based kernels that compare sets of graph features through principled matching."
    },
    {
      "title": "Deep Kernel Learning",
      "authors": "Andrew G. Wilson, Zhiting Hu, Ruslan Salakhutdinov, Eric P. Xing",
      "year": 2016,
      "role": "End-to-end trainable kernel parameterization with neural networks",
      "relationship_sentence": "HSP-GKN’s unified optimization of similarity computation with downstream objectives follows the deep kernel learning paradigm of jointly learning kernel features with task loss."
    },
    {
      "title": "SimGNN: A Neural Network Approach to Fast Graph Similarity Computation",
      "authors": "Yunsheng Bai, Hao Ding, Ken Gu, Yizhou Sun, Wei Wang",
      "year": 2019,
      "role": "Differentiable graph similarity via neural matching",
      "relationship_sentence": "The idea of producing a similarity vector by matching learned graph representations influences HSP-GKN’s end-to-end module that aligns hierarchical kernel features with learnable latent features."
    }
  ],
  "synthesis_narrative": "HSP-GKN’s core innovation—an end-to-end trainable, hierarchical shortest-path kernel network—emerges from two converging lines of work: classical graph kernels that provide strong structural priors, and neural methods that make similarity estimation task-adaptive. Borgwardt and Kriegel’s shortest-path kernel established path-based structural summaries as a robust, efficient primitive. Shervashidze et al.’s Weisfeiler–Lehman kernels contributed the crucial hierarchical viewpoint: multi-level feature refinement that scales and improves expressivity. To preserve semantics alongside structure, HSP-GKN resonates with Kriege and Mutzel’s subgraph matching kernels, which highlight attribute-aware comparisons rather than purely topological counts.\nOn the learnability side, Yanardag and Vishwanathan’s Deep Graph Kernels showed that replacing fixed substructure indicators with learned embeddings improves kernel quality, paving the way for HSP-GKN’s learnable hidden graph features that adapt to downstream objectives. Kriege, Giscard, and Wilson’s optimal assignment kernels further motivate matching-based similarity over sets of features, conceptually aligning with HSP-GKN’s feature–latent matching to form a similarity vector. Finally, Wilson et al.’s Deep Kernel Learning frames kernels as differentiable modules trained end-to-end, a principle HSP-GKN adopts to jointly optimize similarity and task loss, while SimGNN demonstrates practical, differentiable graph–graph similarity via neural matching. Together, these works directly scaffold HSP-GKN’s design: hierarchical shortest-path feature construction, attribute-aware and matching-based comparison, and unified, end-to-end learning of the similarity measure with the downstream task.",
  "analysis_timestamp": "2026-01-07T00:21:32.295981"
}