{
  "prior_works": [
    {
      "title": "Spectra of Some Self-Exciting and Mutually Exciting Point Processes",
      "authors": "A. G. Hawkes et al.",
      "year": 1971,
      "role": "Inspiration",
      "relationship_sentence": "S2P2 explicitly draws on the Hawkes mechanism of exponential decay between events with jump updates at event times, then generalizes it by embedding those jump-and-decay dynamics in a nonlinear deep state-space architecture."
    },
    {
      "title": "Recurrent Marked Temporal Point Processes: Embedding Event History to Predict the Next Event",
      "authors": "Nan Du et al.",
      "year": 2016,
      "role": "Baseline",
      "relationship_sentence": "RMTPP is the primary neural MTPP baseline that parameterizes intensities with RNNs, which S2P2 improves upon by replacing discrete-time recurrence with continuous-time state-space dynamics that better capture inter-event evolution and marks without restrictive parametrics."
    },
    {
      "title": "The Neural Hawkes Process: A Neurally Self-Modulating Multivariate Point Process",
      "authors": "Hongyuan Mei et al.",
      "year": 2017,
      "role": "Extension",
      "relationship_sentence": "S2P2 extends the Neural Hawkes idea of a hidden state that decays between events by instantiating it as a deep state-space system with jump SDE updates and a nonlinear readout, while enabling efficient training via parallel scan rather than fully sequential updates."
    },
    {
      "title": "Transformer Hawkes Process",
      "authors": "Shixiang Zuo et al.",
      "year": 2020,
      "role": "Gap Identification",
      "relationship_sentence": "Attention-based Hawkes models like THP achieve expressivity but incur O(N^2) complexity and weak continuous-time inductive bias, gaps that S2P2 addresses by using SSM-based continuous-time dynamics with linear-time parallel-scan training and inference."
    },
    {
      "title": "Efficiently Modeling Long Sequences with Structured State Spaces",
      "authors": "Albert Gu et al.",
      "year": 2022,
      "role": "Foundation",
      "relationship_sentence": "S2P2 leverages the structured state-space modeling framework and its parallel scan for linear recurrences introduced in S4, adapting these techniques to continuous-time event intensities to obtain linear complexity and hardware-efficient scaling."
    },
    {
      "title": "Neural Jump Stochastic Differential Equations",
      "authors": "Andrew Norcliffe et al.",
      "year": 2020,
      "role": "Extension",
      "relationship_sentence": "S2P2 builds on the neural jump SDE formulation by using jump-driven state updates at event times interleaved with continuous evolution, modifying this machinery to directly parameterize intensity functions for marked temporal point processes."
    }
  ],
  "synthesis_narrative": "The core of S2P2 is a synthesis of Hawkes-style event-driven dynamics with modern deep state-space modeling and efficient scan-based computation. The classical Hawkes process (Hawkes, 1971) provides the key inductive bias—latent states that decay between events and jump at event times—which S2P2 preserves while removing linearity constraints via nonlinear state-space parameterizations. Early neural MTPP work (Du et al., 2016) established the baseline of learning intensities from data with RNNs, but their discrete-time recurrences under-capture continuous inter-event evolution. Neural Hawkes (Mei & Eisner, 2017) moved closer to the Hawkes inductive bias with decaying hidden states; S2P2 directly extends this idea by casting the hidden dynamics as a deep SSM with jump SDE updates and a nonlinear readout for intensities. To realize scalability, S2P2 adopts the structured state-space framework (Gu et al., 2022), using its parallel scan for linear recurrences to achieve linear-time training and sublinear scaling, something attention-based Hawkes variants like the Transformer Hawkes Process (Zuo et al., 2020) struggle with due to quadratic complexity and weaker continuous-time priors. Finally, the jump SDE machinery (Norcliffe et al., 2020) provides a principled way to interleave continuous dynamics with stochastic jumps at events; S2P2 adapts this to directly model marked event intensities. Together, these works form the direct lineage enabling S2P2’s expressive, continuous-time, and scalable MTPP modeling.",
  "analysis_timestamp": "2026-01-06T23:08:23.952130"
}