{
  "prior_works": [
    {
      "title": "DAGs with NO TEARS: Continuous Optimization for Structure Learning",
      "authors": "Xun Zheng, Bryon Aragam, Pradeep Ravikumar, Eric P. Xing",
      "year": 2018,
      "role": "Differentiable structure learning",
      "relationship_sentence": "DCCD-CONF builds on the NOTEARS idea of casting graph search as smooth optimization with a likelihood-based objective, extending the differentiable framework beyond acyclic graphs to handle cyclic structures and latent confounders."
    },
    {
      "title": "DCDI: Differentiable Causal Discovery from Interventions",
      "authors": "Brouillard et al.",
      "year": 2020,
      "role": "Interventional likelihood in differentiable causal discovery",
      "relationship_sentence": "DCDI’s treatment of interventions within a differentiable score directly informs DCCD-CONF’s use of interventional data in the optimization objective, which DCCD-CONF generalizes to nonlinear cyclic graphs and confounders."
    },
    {
      "title": "Foundations of Structural Causal Models with Cycles and Latent Variables",
      "authors": "Sander Bongers, Jonas Peters, Joris M. Mooij",
      "year": 2021,
      "role": "Theory of cyclic SCMs and latent variables",
      "relationship_sentence": "This work provides the formal semantics for feedback (cycles), existence/uniqueness of solutions, and interventions in the presence of latent variables—foundations that DCCD-CONF leverages to define a valid likelihood for nonlinear cyclic models under confounding."
    },
    {
      "title": "A discovery algorithm for directed cyclic graphs (CCD)",
      "authors": "Thomas S. Richardson",
      "year": 1996,
      "role": "Classical causal discovery with feedback",
      "relationship_sentence": "CCD established how to reason about and identify feedback structures, motivating DCCD-CONF’s focus on learning cyclic graphs; DCCD-CONF replaces constraint-based search with an end-to-end differentiable, likelihood-driven approach."
    },
    {
      "title": "Characterization and Greedy Learning of Interventional Markov Equivalence Classes (GIES)",
      "authors": "Alain Hauser, Peter Bühlmann",
      "year": 2012,
      "role": "Using interventional data to disambiguate structure",
      "relationship_sentence": "GIES showed how interventions sharpen identifiability and guide structure search; DCCD-CONF inherits this insight by embedding interventional information directly into its optimization over cyclic, nonlinear, confounded models."
    },
    {
      "title": "Causal Effect Variational Autoencoder (CEVAE)",
      "authors": "Christos Louizos, Uri Shalit, Joris M. Mooij, David Sontag, Richard Zemel, Max Welling",
      "year": 2017,
      "role": "Learning with unobserved confounders via latent-variable likelihoods",
      "relationship_sentence": "CEVAE’s variational treatment of unobserved confounding influences DCCD-CONF’s strategy of estimating a confounder distribution by maximizing (variational) likelihood alongside structural learning."
    },
    {
      "title": "The Bayesian Structural EM Algorithm",
      "authors": "Nir Friedman",
      "year": 1998,
      "role": "Alternating optimization of structure and latent variables",
      "relationship_sentence": "DCCD-CONF’s alternation between optimizing graph structure and estimating the confounder distribution echoes Structural EM’s paradigm of iterating between latent-variable inference and structure updates to maximize data likelihood."
    }
  ],
  "synthesis_narrative": "DCCD-CONF sits at the intersection of differentiable structure learning, interventional causal discovery, cyclic structural causal models, and latent-variable modeling. The differentiable backbone of the method is inspired by NOTEARS, which reframed graph discovery as smooth likelihood maximization; DCCD-CONF preserves this optimization view while moving beyond DAGs. The incorporation of interventional data into a gradient-based objective follows the template of DCDI and the broader lesson from GIES that interventions sharpen identifiability and can guide structure search. To legitimately model feedback and unobserved confounding, DCCD-CONF is grounded in the formal semantics of cyclic SCMs with latent variables articulated by Bongers, Peters, and Mooij, ensuring that the objective corresponds to well-defined interventions and equilibria in nonlinear settings.\n\nA second pillar is the handling of unmeasured confounders. CEVAE demonstrated how to represent unobserved confounding with latent variables and learn their distributions via (variational) likelihood. DCCD-CONF adopts a compatible strategy—estimating a confounder distribution jointly with structural parameters—while targeting graph recovery rather than only effect estimation. The algorithmic structure of alternation between latent-variable inference and graph optimization echoes Friedman’s Structural EM, adapting the classic E/M split to a modern, neural and interventional context. Finally, classical work on feedback discovery such as Richardson’s CCD motivates the pursuit of cyclic structures; DCCD-CONF advances this line by replacing constraint-based reasoning with a scalable differentiable framework. Collectively, these works directly shape DCCD-CONF’s core contribution: a likelihood-driven, differentiable procedure for learning nonlinear cyclic causal graphs under unmeasured confounding from interventional data.",
  "analysis_timestamp": "2026-01-07T00:21:33.135495"
}