{
  "prior_works": [
    {
      "title": "Global Convergence of Gradient Descent for Over-parameterized Tensor Decomposition",
      "authors": "Wang et al.",
      "year": 2020,
      "role": "Baseline",
      "relationship_sentence": "Established the first global guarantee for overparameterized tensor decomposition via a gradient-descent variant with k = O(r^{7.5} log n); the present paper directly targets ALS instead, addressing their open gap by proving global convergence guarantees for the practically dominant ALS method under overparameterization."
    },
    {
      "title": "Guaranteed Non-Orthogonal Tensor Decomposition via Alternating Rank-1 Updates",
      "authors": "Anandkumar et al.",
      "year": 2014,
      "role": "Inspiration",
      "relationship_sentence": "Provided global guarantees for an alternating rank‑1 update scheme under incoherence/non-orthogonality; the new analysis borrows this alternating-update perspective and adapts its identifiability/incoherence machinery to the ALS setting with overparameterization."
    },
    {
      "title": "Foundations of the PARAFAC procedure: Models and conditions for an 'explanatory' multimodal factor analysis",
      "authors": "Harshman et al.",
      "year": 1970,
      "role": "Foundation",
      "relationship_sentence": "Introduced the PARAFAC/CP model and the ALS procedure analyzed in this work; the paper’s guarantees are proved precisely for this classical alternating least squares template."
    },
    {
      "title": "Analysis of Individual Differences in Multidimensional Scaling via an N-Way Generalization of 'Eckart–Young' Decomposition",
      "authors": "Carroll et al.",
      "year": 1970,
      "role": "Foundation",
      "relationship_sentence": "Co-introduced the PARAFAC/CP decomposition that defines the core problem studied; the current work adopts this formulation and analyzes its computation under overparameterization."
    },
    {
      "title": "Three-way arrays: Rank and uniqueness of trilinear decompositions, with application to psychometrics",
      "authors": "Kruskal et al.",
      "year": 1977,
      "role": "Foundation",
      "relationship_sentence": "Provided identifiability conditions (via Kruskal rank) for CP decompositions; the present guarantees rely on analogous identifiability assumptions to link ALS iterates to the true components even when overparameterized."
    },
    {
      "title": "Tensor Decompositions and Applications",
      "authors": "Kolda et al.",
      "year": 2009,
      "role": "Gap Identification",
      "relationship_sentence": "Synthesized CP-ALS as the practical workhorse and emphasized the lack of global convergence guarantees; the new paper directly addresses this long-standing gap by proving global guarantees for ALS under overparameterization."
    },
    {
      "title": "Low-rank matrix completion using alternating minimization",
      "authors": "Jain et al.",
      "year": 2013,
      "role": "Related Problem",
      "relationship_sentence": "Developed modern analyses for alternating minimization in nonconvex low-rank problems using incoherence and leave‑one‑out style arguments; the present work adapts these proof templates to the tensor ALS setting with overparameterization."
    }
  ],
  "synthesis_narrative": "The core innovation of the paper is a first global convergence guarantee for Alternating Least Squares (ALS) in overparameterized tensor decompositions. This advances the emerging line of theory showing that overparameterization can regularize nonconvex tensor objectives. The immediate predecessor is Wang et al. (NeurIPS 2020), who proved global convergence for an overparameterized gradient-descent variant with k = O(r^{7.5} log n). Their result created a clear gap—ALS, the field’s workhorse, still lacked such guarantees—which this paper closes by analyzing ALS directly in the overparameterized regime. The analysis is grounded in the classical CP/PARAFAC formulation introduced by Harshman (1970) and Carroll & Chang (1970), and leverages identifiability insights from Kruskal’s uniqueness theory to relate overparameterized iterates to true components. Methodologically, the work draws inspiration from alternating-update guarantees in tensors—most notably Anandkumar et al. (2014), whose alternating rank‑1 method established global recovery under non-orthogonality—and adapts that alternating perspective to the ALS updates while contending with overparameterization. In shaping the problem’s motivation, Kolda & Bader (2009) codified CP‑ALS’s practical dominance and highlighted the lack of global guarantees that this paper directly addresses. Finally, proof techniques echo successful alternating minimization analyses in related low-rank nonconvex problems (e.g., Jain et al., 2013), importing incoherence conditions and leave‑one‑out style controls to manage interactions among extra components introduced by overparameterization. Together, these works form the direct intellectual lineage enabling ALS guarantees under overparameterization.",
  "analysis_timestamp": "2026-01-06T23:08:23.943453"
}