{
  "prior_works": [
    {
      "title": "Asymptotically Efficient Adaptive Allocation Rules",
      "authors": [
        "T. L. Lai",
        "H. Robbins"
      ],
      "year": 1985,
      "role": "Foundational lower bounds and asymptotic sampling proportions",
      "relationship_sentence": "Established the asymptotic lower bounds and deterministic target allocation proportions that serve as the benchmark for assessing UCB-type algorithms, providing the reference point against which this paper contrasts UCB-V’s potential instability of arm-pulling rates."
    },
    {
      "title": "Optimal Adaptive Policies for Sequential Allocation Problems",
      "authors": [
        "A. N. Burnetas",
        "M. N. Katehakis"
      ],
      "year": 1996,
      "role": "Asymptotically optimal index policies and allocation characterization",
      "relationship_sentence": "Characterized asymptotically optimal allocation rules via KL-based indices, informing the notion of target sampling proportions that the present work leverages when interpreting UCB-V’s asymptotics and refined regret."
    },
    {
      "title": "Finite-time Analysis of the Multiarmed Bandit Problem",
      "authors": [
        "P. Auer",
        "N. Cesa-Bianchi",
        "P. Fischer"
      ],
      "year": 2002,
      "role": "Canonical UCB algorithm and finite-time analysis",
      "relationship_sentence": "Introduced the UCB framework and its finite-time guarantees, forming the canonical baseline whose recent precise asymptotic analyses are extended here to the variance-aware UCB-V setting."
    },
    {
      "title": "Exploration–Exploitation Tradeoff Using Variance Estimates",
      "authors": [
        "J.-Y. Audibert",
        "R. Munos",
        "C. Szepesvári"
      ],
      "year": 2009,
      "role": "Introduced UCB-V and empirical-Bernstein style confidence radii",
      "relationship_sentence": "Proposed the variance-aware UCB-V algorithm studied in this paper; its empirical-variance-based confidence design underpins the non-asymptotic high-probability pull-count bounds and refined regret derived here."
    },
    {
      "title": "Precise Asymptotics for UCB",
      "authors": [
        "I. Kalvit",
        "A. J. Zeevi"
      ],
      "year": 2021,
      "role": "Pathwise characterization of arm-pulling rates for canonical UCB",
      "relationship_sentence": "Provided precise, instance-dependent asymptotics for UCB’s arm-pulling counts; this paper extends that pathwise methodology to the variance-aware case, revealing that UCB-V can exhibit non-deterministic asymptotic pull fractions."
    },
    {
      "title": "Refined Asymptotics and High-Probability Bounds for UCB",
      "authors": [
        "S. Khamaru",
        "T. Zhang"
      ],
      "year": 2024,
      "role": "Refined pull-count asymptotics and high-probability control for UCB",
      "relationship_sentence": "Further sharpened the precise asymptotic and high-probability understanding of canonical UCB; the present work adapts these techniques to derive non-asymptotic pull-count bounds and refined regret for UCB-V."
    },
    {
      "title": "Empirical Bernstein Bounds and Sample Variance Penalization",
      "authors": [
        "A. Maurer",
        "M. Pontil"
      ],
      "year": 2009,
      "role": "Concentration tools using empirical variance",
      "relationship_sentence": "Supplies the empirical-Bernstein concentration machinery that justifies variance-aware confidence widths, enabling the high-probability analysis central to the paper’s refined regret guarantees for UCB-V."
    }
  ],
  "synthesis_narrative": "The paper’s core contribution—precise asymptotics for UCB-V’s arm-pulling rates, the discovery of potential instability (non-deterministic limiting fractions), and refined high-probability regret—rests on three intertwined lines of prior work. First, classical asymptotic theory by Lai and Robbins and its KL-index refinement by Burnetas and Katehakis established the benchmark of deterministic target sampling proportions and asymptotically optimal allocation, which frame what “stable” long-run behavior should look like. Second, the algorithmic lineage from Auer, Cesa-Bianchi, and Fischer’s UCB to Audibert, Munos, and Szepesvári’s UCB-V provides both the canonical baseline and the specific variance-aware index under study; the latter’s empirical-variance radii naturally call for empirical-Bernstein concentration, as formalized by Maurer and Pontil, to secure tight, time-uniform high-probability controls. Third, recent precise analyses of canonical UCB by Kalvit and Zeevi and by Khamaru and Zhang developed pathwise, instance-dependent characterizations of pull counts and refined non-asymptotic bounds. This paper extends that methodological toolkit to the variance-aware regime, showing that the additional stochasticity introduced by variance estimation can disrupt the deterministic sampling proportions seen in canonical UCB, leading to instability. Leveraging empirical-Bernstein-style control, the authors also derive high-probability bounds on pull counts that translate into refined, instance-dependent regret bounds for UCB-V—results that were previously unavailable even for this classic variance-aware algorithm.",
  "analysis_timestamp": "2026-01-07T00:05:12.523539"
}