{
  "prior_works": [
    {
      "title": "The Discrete Fractional Fourier Transform",
      "authors": "Cagatay Candan, M. Alper Kutay, Haldun M. Ozaktas",
      "year": 2000,
      "role": "Mathematical foundation for fractional-order time–frequency analysis",
      "relationship_sentence": "FAPEX’s fractional neural frame operator (FrNFO) builds on the fractional Fourier transform’s ability to rotate the time–frequency plane; by making the fractional order learnable and implementing it via fractional-order convolutions, FAPEX adaptively captures both low- and high-frequency EEG dynamics central to preictal signatures."
    },
    {
      "title": "On the Spectral Bias of Neural Networks",
      "authors": "Nasim Rahaman, Devansh Arpit, Aristide Baratin, Felix Draxler, Min Lin, Fred A. Hamprecht, Yoshua Bengio, Aaron Courville",
      "year": 2019,
      "role": "Theoretical insight on neural nets’ low-frequency bias",
      "relationship_sentence": "This work motivates FAPEX’s core design choice: a fractional, phase-aware front-end that explicitly targets high-frequency components to counter the low-frequency spectral bias typical of conventional architectures, improving cross-subject generalization."
    },
    {
      "title": "Deep Convolutional Framelets: A General Deep Learning Framework for Inverse Problems",
      "authors": "Kyong Hwan Jin, Dongwook Lee, Jong Chul Ye",
      "year": 2017,
      "role": "Neural frame/operator perspective linking CNNs to frame theory",
      "relationship_sentence": "By viewing convolutional networks through the lens of frame theory, this work underpins FAPEX’s formulation of a learnable neural frame operator; FrNFO extends this perspective to adaptive, fractional time–frequency frames that yield stable amplitude/phase representations."
    },
    {
      "title": "SincNet: A Neural Architecture for Raw Audio Signal Processing",
      "authors": "Mirco Ravanelli, Yoshua Bengio",
      "year": 2018,
      "role": "Learnable filterbank front-end for raw signals",
      "relationship_sentence": "SincNet demonstrated that learning structured, interpretable bandpass filters at the input improves robustness; FAPEX generalizes this idea with fractional-order, analytically grounded filters that emit instantaneous phase and amplitude, tailored to EEG seizure prediction."
    },
    {
      "title": "Efficiently Modeling Long Sequences with Structured State Spaces",
      "authors": "Albert Gu, Karan Goel, Christopher Ré",
      "year": 2022,
      "role": "Sequence modeling with structured state-space models (SSMs)",
      "relationship_sentence": "FAPEX incorporates structural SSM blocks inspired by S4 to capture long-range temporal dependencies in preictal windows, complementing the FrNFO’s spectral adaptivity with strong temporal modeling."
    },
    {
      "title": "Measuring phase–amplitude coupling between neuronal oscillations of different frequencies",
      "authors": "Adriano B. L. Tort, Filippo Komorowski, Howard Eichenbaum, Nancy Kopell",
      "year": 2010,
      "role": "Neuroscience methodology for PAC biomarkers",
      "relationship_sentence": "By showing that phase–amplitude coupling is a salient neural signature, this work directly motivates FAPEX’s explicit instantaneous phase and amplitude outputs, enabling robust PAC-like biomarker extraction for seizure prediction and better OOD generalization."
    },
    {
      "title": "Anticipation of epileptic seizures from standard EEG recordings",
      "authors": "Michel Le Van Quyen, Pierre Martinerie, Michel Baulac, Francisco J. Varela",
      "year": 2001,
      "role": "Foundational evidence for phase-based preictal biomarkers",
      "relationship_sentence": "This seminal demonstration that preictal phase synchronization can anticipate seizures informs FAPEX’s focus on phase-resolved representations, aligning its FrNFO-driven features with established cross-subject-relevant biomarkers."
    }
  ],
  "synthesis_narrative": "FAPEX’s key contribution—a learnable fractional neural frame operator (FrNFO) that yields instantaneous amplitude and phase for robust, cross-subject seizure prediction—emerges at the intersection of fractional time–frequency analysis, neural frame theory, and phase-based neuro-biomarkers. The discrete fractional Fourier transform (Candan et al., 2000) furnishes the mathematical backbone for fractional-order representations, enabling rotations in the time–frequency plane that FAPEX renders learnable via fractional-order convolutions. Deep Convolutional Framelets (Jin, Lee, Ye, 2017) casts CNNs as frame operators, a perspective FAPEX extends to a neural frame with fractional adaptivity, producing stable, interpretable amplitude–phase features.\nCrucially, Rahaman et al. (2019) document neural networks’ spectral bias toward low frequencies; FAPEX directly counters this by designing a fractional front-end that captures high-frequency preictal dynamics often missed by conventional models. Prior successes with structured, learnable front-ends from raw waveforms (Ravanelli & Bengio, 2018) further support FAPEX’s decision to learn the front-end rather than rely on fixed transforms. To model long-range preictal temporal structure, FAPEX integrates structured state-space modules inspired by S4 (Gu et al., 2022), complementing spectral adaptivity with efficient sequence modeling.\nOn the neuroscience side, evidence that preictal phase synchronization and cross-frequency phase–amplitude coupling are informative (Le Van Quyen et al., 2001; Tort et al., 2010) motivates FAPEX’s explicit instantaneous phase and amplitude outputs, facilitating biomarker discovery and enhancing out-of-distribution generalization across subjects and modalities. Together, these works directly scaffold FAPEX’s FrNFO design and its integration with temporal SSMs, yielding a principled, phase-aware, spectrally balanced architecture for SASP.",
  "analysis_timestamp": "2026-01-06T23:42:48.129339"
}