{
  "prior_works": [
    {
      "title": "Denoising Diffusion Probabilistic Models",
      "authors": "Jonathan Ho, Ajay Jain, Pieter Abbeel",
      "year": 2020,
      "role": "Foundational diffusion modeling framework",
      "relationship_sentence": "TimeWak’s detection pipeline relies on inverting the diffusion trajectory defined in DDPM, making Ho et al.’s forward–reverse noise parameterization the base mechanism upon which its ε-exact inversion and watermark recovery are built."
    },
    {
      "title": "Denoising Diffusion Implicit Models (DDIM)",
      "authors": "Jiaming Song, Chenlin Meng, Stefano Ermon",
      "year": 2020,
      "role": "Deterministic, approximately invertible diffusion trajectories",
      "relationship_sentence": "TimeWak’s need for reliable inversion without retracing the full stochastic process is directly enabled by DDIM’s non-Markovian deterministic paths, which inform the design of its controlled (ε-exact) inversion for watermark detection."
    },
    {
      "title": "Score-Based Generative Modeling through Stochastic Differential Equations",
      "authors": "Yang Song et al.",
      "year": 2021,
      "role": "SDE/ODE view enabling principled inversion and error control",
      "relationship_sentence": "TimeWak’s ε-exact inversion leverages the SDE/ODE formulation of diffusion, using the probability-flow ODE perspective to reason about reconstruction error and devise feature-aware tolerance during inversion."
    },
    {
      "title": "DiffWave: A Versatile Diffusion Model for Audio Synthesis",
      "authors": "Kong et al.",
      "year": 2021,
      "role": "Demonstrates diffusion models operating directly in data space for time-domain signals",
      "relationship_sentence": "By showing successful diffusion on raw waveforms (data space), DiffWave motivates TimeWak’s decision to embed watermarks directly in the temporal-feature space rather than relying on latent spaces."
    },
    {
      "title": "CSDI: Conditional Score-based Diffusion Models for Probabilistic Time Series Imputation",
      "authors": "Tashiro et al.",
      "year": 2021,
      "role": "State-of-the-art time series diffusion operating in heterogeneous data space",
      "relationship_sentence": "CSDI’s multivariate, heterogeneous time series setting directly motivates TimeWak’s spatial-temporal watermark embedding and its handling of non-uniform feature scales during diffusion inversion."
    },
    {
      "title": "Tree-Ring Watermarks: Invisible Fingerprints for Diffusion Models",
      "authors": "Kuditipudi et al.",
      "year": 2023,
      "role": "Diffusion watermarking via noise-space modulation and inversion-based detection",
      "relationship_sentence": "TimeWak extends the core idea of inversion-based watermark detection from Tree-Rings but departs by embedding in data space and introducing temporal chained-hashing and ε-exact, feature-aware inversion for multivariate time series."
    },
    {
      "title": "Password Authentication with Insecure Communication (hash chains)",
      "authors": "Leslie Lamport",
      "year": 1981,
      "role": "Foundational hash-chain construction for sequential integrity",
      "relationship_sentence": "TimeWak’s temporal chained-hashing watermark adopts the hash-chain principle to sequentially bind adjacent time steps, enabling robust, tamper-evident linkage across a multivariate temporal signal."
    }
  ],
  "synthesis_narrative": "TimeWak tackles watermarking for multivariate time series generated by diffusion models that operate in data space, delivering two key advances: a temporal chained-hashing watermark embedded directly in temporal–feature space, and an ε-exact inversion procedure that accounts for non-uniform reconstruction errors across features. Foundationally, DDPM defines the forward–reverse noise process that TimeWak must invert, while DDIM provides deterministic, approximately invertible trajectories that make practical inversion feasible without retracing full stochastic paths. The SDE/ODE formulation of score-based generative modeling further grounds TimeWak’s inversion, enabling principled error control and informing the feature-aware ε tolerance in detection.\n\nThe need to embed watermarks in data space rather than a homogeneous latent stems from time series diffusion practice: DiffWave demonstrated effective diffusion directly on raw temporal signals, and CSDI extended this to heterogeneous, multivariate time series for imputation, highlighting feature-scale disparities and temporal dependencies that TimeWak explicitly addresses. On the watermarking side, Tree-Ring Watermarks established a diffusion-era paradigm of embedding signals detectable through model inversion; TimeWak generalizes this to time series by abandoning noise/latent-only modulation, introducing temporal chained-hashing to encode cross-step dependencies and provenance in the observable domain. Finally, Lamport’s hash-chain concept directly inspires TimeWak’s sequential binding of watermark components across time, delivering tamper-evident linkage that is robust to temporal structure while remaining detectable under ε-exact, feature-aware diffusion inversion.",
  "analysis_timestamp": "2026-01-07T00:05:12.522228"
}