{
  "prior_works": [
    {
      "title": "Restless bandits: Activity allocation in a changing world",
      "authors": "Peter Whittle",
      "year": 1988,
      "role": "Foundational formulation",
      "relationship_sentence": "Introduced the weakly-coupled structure and the Lagrangian relaxation that decomposes a multi-arm problem into per-arm subproblems, the mathematical backbone that the paper leverages to define an optimal reward–cost region under constraints."
    },
    {
      "title": "A Lagrangian decomposition approach to weakly coupled dynamic optimization problems",
      "authors": "John P. Hawkins",
      "year": 2003,
      "role": "WCMDP relaxation and bounds",
      "relationship_sentence": "Formalized Lagrangian decomposition for WCMDPs and provided performance bounds, directly informing the paper’s use of dual relaxations to characterize the optimal region that the projection-based Lyapunov function targets."
    },
    {
      "title": "Relaxations of weakly coupled stochastic dynamic programs",
      "authors": "Daniel Adelman, Adam J. Mersereau",
      "year": 2008,
      "role": "Decomposition and performance guarantees",
      "relationship_sentence": "Developed tractable relaxations and near-optimal policies for WCMDPs, supplying the decomposition-and-bounding framework that the new method strengthens with Lyapunov certification in the fully heterogeneous regime."
    },
    {
      "title": "On an index policy for restless bandits",
      "authors": "Richard R. Weber, Gideon Weiss",
      "year": 1990,
      "role": "Large-system asymptotics (homogeneous/finite types)",
      "relationship_sentence": "Established asymptotic optimality of index-type policies in large systems with (mostly) homogeneous or finitely-many types, providing the asymptotic benchmark that this paper extends to fully heterogeneous average-reward WCMDPs."
    },
    {
      "title": "Stability properties of constrained queueing systems and scheduling policies for maximum throughput",
      "authors": "Leandros Tassiulas, Anthony Ephremides",
      "year": 1992,
      "role": "Lyapunov drift for constrained systems",
      "relationship_sentence": "Pioneered Lyapunov-drift methods to enforce constraints via dynamic control, a core analytic tool the paper adapts to drive reward and costs toward the optimal region in WCMDPs."
    },
    {
      "title": "MaxWeight scheduling in a generalized switch: State space collapse and workload minimization in heavy traffic",
      "authors": "Alexander L. Stolyar",
      "year": 2004,
      "role": "Projection-based Lyapunov methodology",
      "relationship_sentence": "Used Lyapunov functions based on squared distance (via projection) to a capacity/workload region; this projection paradigm directly inspires the paper’s projection-based Lyapunov function for certifying convergence to the optimal reward–cost region under heterogeneity."
    },
    {
      "title": "Stochastic Network Optimization with Application to Communication and Queueing Systems",
      "authors": "Michael J. Neely",
      "year": 2010,
      "role": "Drift-plus-penalty optimality framework",
      "relationship_sentence": "Developed drift-plus-penalty to trade off performance and constraint violations, a template the paper echoes by shaping Lyapunov drifts that yield an O(1/√N) optimality gap while controlling costs in fully heterogeneous WCMDPs."
    }
  ],
  "synthesis_narrative": "The paper’s core contribution—projection-based Lyapunov functions that guarantee convergence of aggregate rewards and costs to an optimal region in fully heterogeneous weakly coupled MDPs—sits at the intersection of two lines of work: decomposition-based relaxations for WCMDPs and Lyapunov methods for constrained stochastic systems. Whittle (1988) initiated the weakly coupled paradigm via a Lagrangian relaxation, decomposing multi-arm control into tractable per-arm subproblems. Hawkins (2003) and Adelman–Mersereau (2008) developed this relaxation program for WCMDPs, yielding dual bounds and implementable heuristics—precisely the structure needed to define the optimal reward–cost region that the present paper targets. On the asymptotic side, Weber–Weiss (1990) established that in large systems with homogeneous (or finitely many) types, index policies are asymptotically optimal, providing a benchmark the current work advances by proving the first asymptotic optimality in the fully heterogeneous average-reward regime.\nConcurrently, the constrained-queueing literature forged Lyapunov-based control. Tassiulas–Ephremides (1992) introduced Lyapunov drift to ensure stability under constraints, while Stolyar (2004) showcased projection-based Lyapunov functions—squared distances to a capacity/workload region via orthogonal projection—to certify convergence and state-space collapse. Neely (2010) unified drift-plus-penalty approaches, linking utility optimality with constraint satisfaction. The present paper fuses these threads: it uses WCMDP Lagrangian/relaxation structure to define an optimal region and imports projection-based Lyapunov ideas to drive the (heterogeneous) system state toward that region, yielding an O(1/√N) optimality gap that generalizes large-system guarantees beyond homogeneous settings.",
  "analysis_timestamp": "2026-01-07T00:21:32.288641"
}