{
  "prior_works": [
    {
      "title": "DeepSite: protein-binding site predictor using 3D-convolutional neural networks",
      "authors": "José Jiménez et al.",
      "year": 2017,
      "role": "Foundation",
      "relationship_sentence": "DeepSite established the now-standard grid-based, binary segmentation plus post hoc clustering formulation for pocket detection that UniSite replaces with an end-to-end instance-level detector."
    },
    {
      "title": "Development and evaluation of a deep learning model for protein ligand-binding site prediction (Kalasanty)",
      "authors": "Joanna Stepniewska-Dziubińska et al.",
      "year": 2020,
      "role": "Gap Identification",
      "relationship_sentence": "Kalasanty’s 3D U-Net pocket segmentation demonstrates the discontinuous workflow (segmentation then thresholding/clustering) whose sensitivity and fragmentation issues UniSite explicitly addresses with unified, end-to-end site detection."
    },
    {
      "title": "P2Rank: machine learning-based tool for ligand binding site prediction",
      "authors": "David Krivák et al.",
      "year": 2018,
      "role": "Baseline",
      "relationship_sentence": "P2Rank’s rank-then-cluster pipeline and its Top-n/DCA evaluation became de facto standards; UniSite directly improves upon this baseline and revises these metrics to a UniProt-centric, multi-site setting."
    },
    {
      "title": "DeepPocket: Ligand Binding Site Detection and Segmentation using 3D Convolutional Neural Networks",
      "authors": "Abhishek Aggarwal et al.",
      "year": 2021,
      "role": "Baseline",
      "relationship_sentence": "DeepPocket’s fpocket-proposal plus CNN rescoring and per-candidate segmentation exemplifies the two-stage paradigm UniSite replaces with a single, end-to-end learnable detector that does not rely on external proposal generators."
    },
    {
      "title": "fpocket: An open source platform for ligand pocket detection",
      "authors": "Adrien S. Guilloux et al.",
      "year": 2009,
      "role": "Related Problem",
      "relationship_sentence": "Because many modern methods (e.g., DeepPocket) depend on fpocket for cavity proposals, UniSite is designed to obviate such handcrafted pre-processing by directly learning pocket instances from structure."
    },
    {
      "title": "COACH: a meta-server approach to protein–ligand binding site prediction",
      "authors": "J. Yang et al.",
      "year": 2013,
      "role": "Foundation",
      "relationship_sentence": "COACH and its COACH420 benchmark entrenched per-complex, top-n success metrics and data organization; UniSite reformulates both dataset construction and evaluation to be UniProt-centric and multi-site aware."
    },
    {
      "title": "Three-Dimensional Convolutional Neural Networks and a CrossDocked Dataset for Structure-Based Drug Design",
      "authors": "Jean-François Francoeur et al.",
      "year": 2020,
      "role": "Inspiration",
      "relationship_sentence": "CrossDocked’s protein-centric aggregation across multiple receptor conformations directly inspired UniSite-DS’s UniProt-centric, cross-structure dataset design and strict protein-level splits to reduce leakage."
    }
  ],
  "synthesis_narrative": "UniSite’s core innovation—recasting ligand binding site prediction as an end-to-end instance detection problem on a UniProt-centric, cross-structure dataset—emerges from clear limitations in dominant pipelines and datasets. DeepSite introduced the deep learning formulation for pocket detection but entrenched grid-based binary segmentation followed by clustering, a discontinuous workflow subsequently exemplified and refined by Kalasanty’s 3D U-Net segmentation and DeepPocket’s fpocket-proposal plus CNN rescoring and per-candidate segmentation. These methods, along with the widely used P2Rank rank-then-cluster approach, also cemented evaluation conventions such as Top-n success and DCA measured per complex, which can mask failures on proteins with multiple distinct sites and enable structure-level leakage in training/testing. COACH and its COACH420 benchmark further standardized per-complex data organization and metrics, reinforcing these biases. At the same time, the community’s reliance on fpocket for cavity proposals highlighted a fragility to handcrafted preprocessing. UniSite directly addresses these intertwined issues: inspired by the protein-centric organization of CrossDocked, it constructs UniSite-DS by aggregating all structures under each UniProt ID to expose multi-site reality and enforce protein-level splits. Methodologically, it abandons the segmentation-plus-clustering paradigm, learning pocket instances end-to-end without external proposal generators. Finally, it redefines evaluation to be protein-centric and multi-site aware, enabling fair, leakage-resistant comparisons and revealing gains specifically where earlier methods struggled—proteins with multiple, diverse binding sites.",
  "analysis_timestamp": "2026-01-06T23:08:23.970694"
}