{
  "prior_works": [
    {
      "title": "SWE-agent: Agent-Computer Interfaces Enable LLMs to Solve Real-World Software Engineering Tasks",
      "authors": [
        "SWE-agent authors et al."
      ],
      "year": 2024,
      "role": "baseline/contrast",
      "relationship_sentence": "RepoMaster targets the same real-world, repository-grounded SWE tasks as SWE-agent but addresses its difficulty leveraging entire repos by adding autonomous repository exploration and dependency disentanglement beyond issue/README-centric prompting."
    },
    {
      "title": "OpenHands: An Open Platform for Developing and Evaluating Autonomous Software Engineering Agents",
      "authors": [
        "OpenHands team et al."
      ],
      "year": 2024,
      "role": "platform/baseline",
      "relationship_sentence": "OpenHands provides the general agentic coding platform RepoMaster builds upon, with RepoMaster extending it via a structured pipeline for crawling, summarizing, and reusing third-party GitHub repositories rather than relying on shallow README guidance."
    },
    {
      "title": "SWE-bench: Can Language Models Resolve Real-World GitHub Issues?",
      "authors": [
        "SWE-bench authors et al."
      ],
      "year": 2023,
      "role": "benchmark/problem framing",
      "relationship_sentence": "By formalizing repository-level issue resolution and evaluation, SWE-bench crystallized the need for agents to reason over large, interdependent codebases—precisely the pain points RepoMaster tackles with repo-scale exploration and context management."
    },
    {
      "title": "ReAct: Synergizing Reasoning and Acting in Language Models",
      "authors": [
        "Shunyu Yao et al."
      ],
      "year": 2023,
      "role": "methodological inspiration (reasoning + tool use)",
      "relationship_sentence": "RepoMaster’s loop of planning, repository probing (file I/O, build, tests), and reflection is a direct application of ReAct-style interleaving of chain-of-thought with tool execution for targeted repo exploration."
    },
    {
      "title": "Retrieval-Augmented Generation for Knowledge-Intensive NLP",
      "authors": [
        "Patrick Lewis et al."
      ],
      "year": 2020,
      "role": "methodological inspiration (retrieval to overcome context limits)",
      "relationship_sentence": "RepoMaster adopts the core RAG principle to mitigate LLM context limits, retrieving and summarizing only dependency-relevant repository slices rather than streaming full repos into the prompt."
    },
    {
      "title": "GraphCodeBERT: Pre-Training Code Representations with Data Flow",
      "authors": [
        "Daya Guo et al."
      ],
      "year": 2021,
      "role": "representation/insight on code graphs",
      "relationship_sentence": "The success of incorporating code structure (e.g., data-flow/AST) in GraphCodeBERT motivates RepoMaster’s use of dependency and call graphs to untangle modules and guide focused retrieval across tangled repos."
    },
    {
      "title": "Voyager: An Open-Ended Embodied Agent with Large Language Models",
      "authors": [
        "Guanzhi Wang et al."
      ],
      "year": 2023,
      "role": "agentic autonomy and skill reuse",
      "relationship_sentence": "Voyager’s autonomous exploration and iterative skill library inspired RepoMaster’s iterative repository exploration and reuse of existing components as modular building blocks for complex tasks."
    }
  ],
  "synthesis_narrative": "RepoMaster’s core contribution is an autonomous agent that can explore, understand, and reuse third-party GitHub repositories to solve complex tasks despite overwhelming code volume, tangled dependencies, and limited LLM context. This advances the SWE-agent and OpenHands lines of work, which established agentic interfaces and workflows for real-world software tasks but remained constrained by coarse repository grounding (often issue/README centric) and weak strategies for disentangling inter-module dependencies. The problem framing and evaluation urgency came from SWE-bench, which made clear that success on real GitHub issues requires repository-scale reasoning rather than file-level prompting.\nMethodologically, RepoMaster draws on ReAct’s interleaving of reasoning and acting to structure iterative planning, repository probing (filesystem navigation, builds, tests), and reflection. To overcome context limits, it applies Retrieval-Augmented Generation principles, retrieving and summarizing only the dependency-critical slices of a repository instead of dumping entire codebases into prompts. Its focus on constructing and traversing repository dependency and call graphs is motivated by evidence from GraphCodeBERT that structural program representations materially improve code understanding. Finally, the agent’s autonomous, iterative exploration and reuse of components are inspired by Voyager’s skill acquisition loop, repurposed here to acquire and chain repository modules as reusable capabilities. Together, these threads yield a framework that moves beyond README-driven heuristics by systematically mapping, retrieving, and operationalizing the minimum working subset of a repository needed to accomplish complex tasks.",
  "analysis_timestamp": "2026-01-07T00:21:32.295463"
}