{
  "prior_works": [
    {
      "title": "Tree of Thoughts: Deliberate Problem Solving with Large Language Models",
      "authors": "Shunyu Yao et al.",
      "year": 2023,
      "role": "Search-based reasoning framework",
      "relationship_sentence": "Introduced branching and evaluation over intermediate thoughts; MAoP generalizes this idea from depth-wise exploration to breadth-wise, aspect-centric pre-planning where a strategist enumerates parallel constraints and options before detailed planning."
    },
    {
      "title": "Graph of Thoughts: Solving Many Tasks with One Method",
      "authors": "Maciej Besta et al.",
      "year": 2024,
      "role": "Parallel/structured thought composition",
      "relationship_sentence": "Demonstrated organizing LLM reasoning as graphs with parallel sub-traces and later composition; MAoP’s multi-aspect blueprint mirrors this by structuring planning along orthogonal facets that are later integrated into a coherent plan."
    },
    {
      "title": "Least-to-Most Prompting Enables Complex Reasoning in Language Models",
      "authors": "Denny Zhou et al.",
      "year": 2022,
      "role": "Decomposition prompting",
      "relationship_sentence": "Showed that explicitly decomposing problems improves performance; MAoP extends this by decomposing along multiple concurrent aspects (preferences, budget, logistics) rather than a single linear subproblem chain."
    },
    {
      "title": "ReAct: Synergizing Reasoning and Acting in Language Models",
      "authors": "Shunyu Yao et al.",
      "year": 2022,
      "role": "Reasoning-with-actions/tool use",
      "relationship_sentence": "Provided a template to interleave reasoning with tool use and environment interaction; MAoP’s planners leverage ReAct-style steps to fetch real-world information needed to satisfy multifaceted constraints during plan instantiation."
    },
    {
      "title": "Reflexion: Language Agents with Verbal Reinforcement Learning",
      "authors": "Noah Shinn et al.",
      "year": 2023,
      "role": "Feedback-driven refinement",
      "relationship_sentence": "Showed how agents can use outcome feedback to iteratively refine decisions; MAoP’s simulation-based evaluator similarly supplies feedback signals that guide revising aspect-level blueprints toward feasible, higher-quality plans."
    },
    {
      "title": "WebArena: A Realistic Web Environment for Building Autonomous Agents",
      "authors": "Xiaogeng (Tony) Zhou et al.",
      "year": 2023,
      "role": "Simulation-based evaluation environment",
      "relationship_sentence": "Established realistic simulation for web tasks and agent evaluation; the paper adopts this paradigm by designing simulation-based evaluation tailored to multi-constraint real-world planning (e.g., travel), enabling objective, reproducible assessment."
    }
  ],
  "synthesis_narrative": "MAoP’s core advance—wide-horizon, aspect-centric planning coupled with simulation-based evaluation—rests on three intertwined lines of prior work. First, Tree of Thoughts and Graph of Thoughts recast single-chain reasoning into structured exploration over multiple candidate thoughts and parallel subtraces. MAoP internalizes these ideas but pivots from depth-first solution search to breadth-oriented pre-planning: a strategist enumerates orthogonal aspects (budget, preferences, timing, logistics) to build a high-level blueprint that can be scaled in width to cover more constraints.\nSecond, decomposition prompting (Least-to-Most) established that explicit subproblem factoring improves LLM performance. MAoP generalizes this beyond linear decomposition by distributing constraints across concurrent aspects, then composing them, which is critical for real-world planning where constraints interact rather than line up sequentially. At the execution layer, ReAct informs the planner’s interleaving of reasoning with tool calls and information gathering, making the aspect plans concrete and grounded in up-to-date external data.\nThird, Reflexion motivates using outcome feedback to refine decisions. MAoP operationalizes this with a simulation-based evaluator that stress-tests candidate plans against multifaceted constraints and feeds signals back to revise the blueprint. Finally, the evaluation methodology draws on WebArena’s principle of realistic, simulator-backed assessment, adapting it to planning-specific, multi-criteria scoring. Together these works directly shape MAoP’s strategist–planner separation, breadth-scalable aspect generation, and feedback-driven selection under real-world constraints.",
  "analysis_timestamp": "2026-01-06T23:42:48.158067"
}