{
  "prior_works": [
    {
      "title": "Über die Umkehrung der Naturgesetze",
      "authors": "Erwin Schrödinger",
      "year": 1931,
      "role": "Foundational formulation of the Schrödinger bridge problem as an entropic regularization of stochastic dynamics between fixed marginals.",
      "relationship_sentence": "The paper’s core objective—steering an initial distribution to a final one via minimal-cost diffusion—directly builds on Schrödinger’s original bridge formulation."
    },
    {
      "title": "A survey of the Schrödinger problem and some of its connections with optimal transport",
      "authors": "Christian Léonard",
      "year": 2014,
      "role": "Comprehensive theoretical link between Schrödinger bridges, entropic optimal transport, and stochastic control.",
      "relationship_sentence": "The authors’ linear-program viewpoint over mixture couplings relies on the entropic OT interpretation of Schrödinger bridges systematized by Léonard."
    },
    {
      "title": "Optimal steering of a linear stochastic system to a final probability distribution, Part I",
      "authors": "Yongxin Chen, Tryphon T. Georgiou, Michele Pavon",
      "year": 2017,
      "role": "Explicit Gaussian-to-Gaussian Schrödinger bridge for (time-varying) linear dynamics, with optimal control laws and costs.",
      "relationship_sentence": "This work provides the analytic Gaussian-bridge building blocks (control and cost) that the present paper aggregates across mixture components."
    },
    {
      "title": "On the relation between optimal transport and Schrödinger bridges: A stochastic control viewpoint",
      "authors": "Yongxin Chen, Tryphon T. Georgiou, Michele Pavon",
      "year": 2016,
      "role": "Shows SB as a stochastic control problem connected to OT, clarifying objectives and structure of optimal policies.",
      "relationship_sentence": "The paper’s feasible policy parametrization and reduction to tractable objectives follow this control-theoretic framing of SBs."
    },
    {
      "title": "A transport distance between Gaussians and Gaussian mixture models",
      "authors": "Jean-François Delon, Agnès Desolneux",
      "year": 2020,
      "role": "Introduces discrete OT on mixture weights with ground cost given by Gaussian-to-Gaussian transport, solved by a low-dimensional linear program.",
      "relationship_sentence": "The present paper mirrors this component-wise OT structure, replacing the ground cost by Gaussian SB costs under dynamics, yielding the proposed LP over mixture couplings."
    },
    {
      "title": "Iterative Bregman Projections for Regularized Optimal Transport Problems",
      "authors": "Jean-David Benamou, Guillaume Carlier, Marco Cuturi, Luca Nenna, Gabriel Peyré",
      "year": 2015,
      "role": "Canonical scalable solver for entropic OT/SB via Sinkhorn/IPF-style iterations.",
      "relationship_sentence": "By contrasting with Sinkhorn/IPF-based solvers, this work motivates the paper’s shift to an analytic component-wise cost and a single LP, avoiding heavy iterative training."
    },
    {
      "title": "Diffusion Schrödinger Bridge with Score Matching",
      "authors": "Mathieu De Bortoli, James Thornton, Jeremy Heng",
      "year": 2021,
      "role": "Data-driven SB methodology using score estimation and stochastic simulation; accurate but computationally expensive.",
      "relationship_sentence": "The proposed fast GMM-to-GMM bridge is positioned as an analytic, far cheaper alternative to score-based SB training exemplified by this work."
    }
  ],
  "synthesis_narrative": "The paper’s key contribution—an analytic parametrization of feasible policies that steer Gaussian mixture models under linear dynamics, reducing the problem to a small linear program over mixture couplings—rests on two complementary strands of prior work. The first is the Schrödinger bridge (SB) lineage from Schrödinger’s original formulation to Léonard’s synthesis with entropic optimal transport (OT). This theory legitimizes casting distribution steering as an entropic control problem and clarifies why coupling across mixture components can be organized via an OT-like program.\nThe second strand provides the computational primitives for the proposed decomposition. Chen–Georgiou–Pavon develop explicit SB solutions for linear (including time-varying) dynamics between Gaussian marginals, supplying closed-form optimal controls and costs. These Gaussian bridges become the ground costs in the present paper. Delon–Desolneux show that distances between GMMs can be computed by solving a discrete OT problem over component weights with Gaussian-to-Gaussian ground costs; the current work adopts this structural idea but substitutes ground costs derived from Gaussian SBs, yielding a linear program whose size grows linearly with mixture components.\nAgainst the prevailing computational approaches—Sinkhorn/IPF-style solvers and data-driven score-based SB methods (Benamou et al.; De Bortoli et al.)—the paper offers an analytic alternative that avoids heavy training and scales favorably. Together, these prior works directly inform the paper’s decomposition (mixture-level LP) and its inner analytic blocks (Gaussian SB under linear dynamics), enabling efficient extensions to controllable linear time-varying systems and multi-marginal settings.",
  "analysis_timestamp": "2026-01-07T00:02:04.923205"
}