{
  "prior_works": [
    {
      "title": "CLEVR: A Diagnostic Dataset for Compositional Language and Elementary Visual Reasoning",
      "authors": "Justin Johnson, Bharath Hariharan, Laurens van der Maaten, Li Fei-Fei, C. Lawrence Zitnick, Ross Girshick",
      "year": 2017,
      "role": "diagnostic benchmark precursor",
      "relationship_sentence": "Inspired the paper’s controlled, synthetic evaluation philosophy by showing how carefully designed visual tasks can isolate specific reasoning competencies."
    },
    {
      "title": "A Corpus for Reasoning about Natural Language Grounded in Photographs (NLVR2)",
      "authors": "Alane Suhr et al.",
      "year": 2019,
      "role": "two‑image comparative reasoning precursor",
      "relationship_sentence": "Provided precedent for requiring models to hold and compare information across two images, directly informing the paper’s ‘comparative perception’ task design."
    },
    {
      "title": "Long Range Arena: A Benchmark for Efficient Transformers",
      "authors": "Yi Tay et al.",
      "year": 2021,
      "role": "long‑range vision dependency benchmark",
      "relationship_sentence": "Its Pathfinder/PathfinderX tasks operationalized long‑range contour tracing, motivating the paper’s ‘smooth visual search’ evaluation of non‑local integration."
    },
    {
      "title": "Recurrent Models of Visual Attention",
      "authors": "Volodymyr Mnih, Nicolas Heess, Alex Graves, Koray Kavukcuoglu",
      "year": 2014,
      "role": "saccadic attention modeling",
      "relationship_sentence": "Established discrete, sequential ‘glimpse’-based attention, directly underpinning the paper’s ‘saccadic search’ paradigm that tests evidence‑driven jumps across an image."
    },
    {
      "title": "Approximating CNNs with Bag-of-Local Features for Image Recognition",
      "authors": "Wieland Brendel, Matthias Bethge",
      "year": 2019,
      "role": "evidence for local‑feature reliance",
      "relationship_sentence": "Showed high performance from models using mostly local evidence, motivating the paper’s ‘tunnel vision’ hypothesis and tests that require non‑local integration."
    },
    {
      "title": "ImageNet-trained CNNs are biased towards texture; increasing shape bias improves accuracy and robustness",
      "authors": "Robert Geirhos et al.",
      "year": 2019,
      "role": "local‑over‑global bias evidence",
      "relationship_sentence": "Demonstrated a pervasive texture (local) bias in modern vision encoders, directly motivating evaluations that demand global/long‑range visual reasoning in VLMs."
    },
    {
      "title": "Contour integration by the human visual system: Evidence for a local ‘association field’",
      "authors": "David J. Field, Anthony Hayes, Robin F. Hess",
      "year": 1993,
      "role": "vision‑science foundation for contour integration",
      "relationship_sentence": "Provided the perceptual basis for smooth contour tracking, informing the design and interpretation of the paper’s ‘smooth visual search’ tasks."
    }
  ],
  "synthesis_narrative": "The paper’s core contribution—a structured evaluation of non‑local visual reasoning in VLMs via comparative perception, saccadic search, and smooth visual search—draws from two converging lines of prior work. From the ML side, CLEVR established how synthetic, controlled tasks can precisely isolate reasoning skills, a design ethos this paper adopts to ensure diagnostic clarity. NLVR2 specifically operationalized multi‑image comparison, directly informing the comparative perception suite that requires holding two images in working memory. Long Range Arena’s Pathfinder tasks crystallized the challenge of long‑range contour tracing, motivating the paper’s smooth visual search tests that demand integrating distant, sequential evidence.\nAt the same time, foundational insights about attention and locality shaped the hypotheses tested. Mnih et al.’s recurrent attention model formalized discrete, sequential ‘saccades’ in machine vision, providing a conceptual and methodological template for the paper’s saccadic search evaluations. Brendel & Bethge’s BagNets and Geirhos et al.’s texture‑bias results offered strong evidence that modern vision backbones often rely on local cues, directly seeding the paper’s ‘tunnel vision’ hypothesis that VLMs fail when tasks require non‑local integration. Finally, Field, Hayes & Hess grounded the smooth contour tasks in classic vision science on contour integration, ensuring the evaluation probes authentically human‑salient non‑local perception. Together, these works directly shaped both the construction of task families and the central claim that today’s high‑performing VLMs underperform when vision requires chaining evidence across distant regions.",
  "analysis_timestamp": "2026-01-07T00:05:12.551726"
}