{
  "prior_works": [
    {
      "title": "Autoformer: Decomposition Transformers with Auto-Correlation for Long-Term Series Forecasting",
      "authors": "Haixu Wu; Jiehui Xu; Jianmin Wang; Mingsheng Long",
      "year": 2021,
      "role": "Algorithmic precursor for multi-frequency/decomposition-based temporal modeling",
      "relationship_sentence": "FactoST’s multi-frequency reconstruction objective builds directly on Autoformer’s series-decomposition and auto-correlation ideas to capture periodic/seasonal regularities in a space-agnostic temporal backbone."
    },
    {
      "title": "Informer: Beyond Efficient Transformer for Long Sequence Time-Series Forecasting",
      "authors": "Haoyi Zhou et al.",
      "year": 2021,
      "role": "Efficiency mechanism via sparse/probabilistic attention for long sequences",
      "relationship_sentence": "The sparsification of interactions in FactoST’s adapter is informed by Informer’s ProbSparse principle, enabling scalable attention while preserving salient dependencies."
    },
    {
      "title": "Graph WaveNet for Deep Spatial-Temporal Graph Modeling",
      "authors": "Zonghan Wu; Shirui Pan; Guodong Long; Jing Jiang; Chengqi Zhang",
      "year": 2019,
      "role": "Spatial graph learning with adaptive (learned) sparse adjacency",
      "relationship_sentence": "FactoST’s spatial adapter that fuses metadata and learns sparse cross-node interactions echoes Graph WaveNet’s adaptive adjacency mechanism for discovering effective, parsimonious spatial links."
    },
    {
      "title": "Parameter-Efficient Transfer Learning for NLP (Adapter Tuning)",
      "authors": "Neil Houlsby et al.",
      "year": 2019,
      "role": "Parameter-efficient adaptation via lightweight adapters on frozen backbones",
      "relationship_sentence": "The second-stage design of freezing a universal backbone and attaching a small adapter in FactoST directly follows the adapter-tuning paradigm for efficient transfer."
    },
    {
      "title": "ST-Adapter: Parameter-Efficient Image-to-Video Transfer Learning",
      "authors": "Pan et al.",
      "year": 2022,
      "role": "Decoupled backbone + temporal/spatiotemporal adapters for foundation model transfer",
      "relationship_sentence": "FactoST mirrors ST-Adapter’s strategy of preserving a pretrained backbone while injecting task-specific spatiotemporal capacity via lightweight adapters, here tailored to spatial fusion in forecasting."
    },
    {
      "title": "Prefix-Tuning: Optimizing Continuous Prompts for Generation",
      "authors": "Xiang Lisa Li; Percy Liang",
      "year": 2021,
      "role": "Prompt-based conditioning for domain/task adaptation",
      "relationship_sentence": "FactoST’s domain-aware prompting for universal temporal pretraining is conceptually grounded in prefix/prompt tuning, conditioning a shared model on domain cues without full finetuning."
    },
    {
      "title": "PatchTST: Transformer for Time Series with Patch Representation",
      "authors": "Nie et al.",
      "year": 2023,
      "role": "Strong space-agnostic temporal backbone for multivariate forecasting",
      "relationship_sentence": "PatchTST’s success with a purely temporal, channel-wise Transformer supports FactoST’s premise that universal temporal regularities can be learned independently of spatial structure."
    },
    {
      "title": "iCaRL: Incremental Classifier and Representation Learning",
      "authors": "Sylvestre-Alvise Rebuffi; Alexander Kolesnikov; Georg Sperl; Christoph H. Lampert",
      "year": 2017,
      "role": "Continual learning with rehearsal/memory replay",
      "relationship_sentence": "FactoST’s continual memory replay for cross-domain alignment derives from rehearsal-based continual learning methods exemplified by iCaRL."
    }
  ],
  "synthesis_narrative": "FactoST’s central idea—factorizing spatio-temporal foundation modeling by decoupling universal temporal pretraining from spatial adaptation—sits at the intersection of three influential lines of work. First, Autoformer introduced decomposition/autocorrelation mechanisms that make temporal regularities (trend/seasonality) explicit, directly motivating FactoST’s multi-frequency reconstruction objective to capture cross-domain time patterns in a space-agnostic backbone. Complementarily, Informer’s ProbSparse attention and Graph WaveNet’s adaptive adjacency both argue for parsimony: retain only the most salient interactions. FactoST operationalizes this in its spatial adapter, which fuses metadata while learning sparse cross-node links, achieving both efficiency and robustness.\nSecond, parameter-efficient transfer catalyzed by adapter tuning (Houlsby et al.) and its video counterpart ST-Adapter demonstrated that large, frozen backbones can be specialized to new modalities or tasks via small plug-in modules. FactoST adopts this recipe verbatim: freeze or lightly finetune a universal temporal core and attach a lightweight spatial adapter that injects domain and topology awareness without bloating parameters.\nThird, adaptation signals are injected through prompts and stabilized over shifts with rehearsal. Prefix-tuning provides the tooling for domain-aware prompting during temporal pretraining, while iCaRL’s memory replay informs FactoST’s continual replay to maintain alignment across evolving domains. Finally, PatchTST’s strong results with a purely temporal Transformer reinforce the paper’s thesis that temporal structure can be learned independently of spatial correlations, enabling the proposed factorization. Together, these works directly scaffold FactoST’s design choices in objective, architecture, efficiency, and adaptation.",
  "analysis_timestamp": "2026-01-07T00:21:32.328753"
}