{
  "prior_works": [
    {
      "title": "Efficient Reinforcement Learning in Factored MDPs",
      "authors": "Michael Kearns, Daphne Koller",
      "year": 1999,
      "role": "Foundational framework for scalability via local structure",
      "relationship_sentence": "GSAC’s sparse causal masks and approximately compact representations operationalize the core idea from factored MDPs that dynamics and value functions depend on small local scopes, enabling tractable learning on large graphs."
    },
    {
      "title": "Multiagent Planning with Factored MDPs",
      "authors": "Carlos Guestrin, Daphne Koller, Ronald Parr",
      "year": 2002,
      "role": "Algorithmic blueprint for local decomposition on graphs",
      "relationship_sentence": "The k-hop truncation and graph-local value estimation in GSAC echoes coordination/value decomposition in factored multiagent planning, but GSAC augments it with causal identification and domain-generalization guarantees."
    },
    {
      "title": "Towards a Unified Theory of State Abstraction for MDPs",
      "authors": "Lihong Li, Thomas J. Walsh, Michael L. Littman",
      "year": 2006,
      "role": "Theoretical tool for abstraction with error bounds",
      "relationship_sentence": "GSAC’s approximately compact representations act as causal state abstractions; its truncation-error guarantees build on the abstraction-error perspective established by Li–Walsh–Littman."
    },
    {
      "title": "Invariant Risk Minimization",
      "authors": "Martin Arjovsky, Léon Bottou, Ishaan Gulrajani, David Lopez-Paz",
      "year": 2019,
      "role": "Principle for domain generalization via invariance",
      "relationship_sentence": "GSAC’s meta actor-critic seeks policies that are invariant across environments by conditioning on domain factors, directly instantiating IRM’s invariance principle in the RL setting with explicit causal conditioning."
    },
    {
      "title": "PEARL: Probabilistic Embeddings for Actor-Critic Reinforcement Learning",
      "authors": "Kate Rakelly, Aurick Zhou, Deirdre Quillen, Chelsea Finn, Sergey Levine",
      "year": 2019,
      "role": "Methodological precedent for few-shot context inference in actor-critic",
      "relationship_sentence": "GSAC’s meta actor-critic trains a shared policy while inferring latent domain factors from a few trajectories, paralleling PEARL’s context inference but grounding the context in causally identified domain variables."
    },
    {
      "title": "Regularized Estimation in High-Dimensional Vector Autoregressive Models",
      "authors": "Sabyasachi Basu, George Michailidis",
      "year": 2015,
      "role": "Identification of sparse local dependencies in dynamical networks",
      "relationship_sentence": "GSAC’s provable recovery of minimal neighborhood variables from time series is informed by sparse VAR estimation theory, which shows how to recover local causal neighborhoods under regularization."
    },
    {
      "title": "System Level Synthesis: Theory, Interpretations, and Applications to Robust Control",
      "authors": "James Anderson, Nikolai Matni, John C. Doyle",
      "year": 2019,
      "role": "Locality principle and truncation with performance guarantees in networked control",
      "relationship_sentence": "GSAC’s bounds for truncating value functions to k-hop neighborhoods extend the SLS locality paradigm—spatially localized responses with controlled approximation error—to the RL value-learning setting."
    }
  ],
  "synthesis_narrative": "GSAC unifies three influential threads—graph-structured scalability, causal invariance for domain generalization, and locality guarantees in networked dynamics—into a single provable RL framework. From factored MDPs, Kearns–Koller and Guestrin–Koller–Parr established that large systems can be tackled by exploiting sparse local scopes and decomposed value functions. GSAC inherits this structural prior but strengthens it by learning a sparse local causal mask, ensuring that only variables with genuine dynamical influence constitute the representation. The abstraction perspective of Li–Walsh–Littman provides the lens to view these masks as causal abstractions and to quantify the error induced by compressing state and domain factors. On the identification side, sparse VAR theory (Basu–Michailidis) motivates provable recovery of minimal neighborhoods from time-series data, turning structural locality into a learnable and certifiable component. For performance guarantees, GSAC’s k-hop value truncation bounds mirror the locality results of System Level Synthesis, transferring the idea that distant nodes have exponentially decaying influence from control design to value approximation. Finally, to achieve cross-domain generalization, GSAC aligns with IRM’s invariance principle, seeking policies stable across environments, and operationalizes it with a meta actor-critic akin to PEARL—inferring domain factors from a few trajectories—while grounding these factors in causally identified mechanisms. Together, these works directly scaffold GSAC’s core contribution: provably generalizable and scalable policy learning on large networked systems.",
  "analysis_timestamp": "2026-01-07T00:02:04.927541"
}