{
  "prior_works": [
    {
      "title": "Interpretability Beyond Feature Attribution: Quantitative Testing with Concept Activation Vectors (TCAV)",
      "authors": "Been Kim, Martin Wattenberg, Justin Gilmer, Carrie Cai, James Wexler, Fernanda Viégas, Rory Sayres",
      "year": 2018,
      "role": "Conceptual foundation for representing behaviors as directions in activation space",
      "relationship_sentence": "Angular Steering builds directly on TCAV’s idea of encoding a target behavior as a linear direction in a model’s activation space, but replaces directional derivatives/addition with controlled geometric rotation for finer behavior modulation."
    },
    {
      "title": "Man is to Computer Programmer as Woman is to Homemaker? Debiasing Word Embeddings",
      "authors": "Tolga Bolukbasi, Kai-Wei Chang, James Zou, Venkatesh Saligrama, Adam Kalai",
      "year": 2016,
      "role": "Early geometric intervention via projection/ablation along a concept direction",
      "relationship_sentence": "The paper’s directional ablation (projecting out a concept component) is a direct precursor to Angular Steering, which generalizes beyond full projection or addition by rotating within the activation–feature 2D subspace to tune suppression or amplification continuously."
    },
    {
      "title": "INLP: Iterative Nullspace Projection: Removing Protected Attributes by Iteratively Learning to Predict Them",
      "authors": "Shauli Ravfogel, Yanai Elazar, Hila Gonen, Michael Elhadad, Yoav Goldberg",
      "year": 2020,
      "role": "Methodological baseline for linear debiasing in contextual representations",
      "relationship_sentence": "Angular Steering is motivated by INLP-style linear debiasing but replaces aggressive nullspace projection with a parameterized rotation that can partially suppress a behavior while preserving unrelated features."
    },
    {
      "title": "GANSpace: Discovering Interpretable GAN Controls via Principal Component Analysis",
      "authors": "Erik Härkönen, Aaron Hertzmann, Jaakko Lehtinen, Sylvain Paris",
      "year": 2020,
      "role": "Evidence that latent directions permit smooth, controllable manipulation of behaviors",
      "relationship_sentence": "Similar to GANSpace’s controllable traversals along latent directions, Angular Steering operates on explicit behavior directions but proposes rotation as a more stable, continuous control primitive in language-model activation space."
    },
    {
      "title": "Toy Models of Superposition in Neural Networks",
      "authors": "Nelson Elhage, Neel Nanda, Catherine Olsson, Tom Henighan, Chris Olah",
      "year": 2022,
      "role": "Theoretical grounding for features as directions and interference in activation space",
      "relationship_sentence": "By highlighting superposition and feature interference, this work motivates Angular Steering’s design choice to confine interventions to a fixed 2D subspace and use angle as the control knob to reduce unintended interactions."
    },
    {
      "title": "Locating and Editing Factual Associations in GPT (ROME)",
      "authors": "Kevin Meng, David Bau, Alex Andonian, Yonatan Belinkov",
      "year": 2022,
      "role": "Activation-level, layer-localized interventions and localization methodology",
      "relationship_sentence": "ROME’s precise, layer-targeted edits inform Adaptive Angular Steering’s strategy of selecting where (layers/tokens) to rotate activations to maximize desired behavioral change while minimizing collateral effects."
    },
    {
      "title": "Editing Models with Task Vectors",
      "authors": "Gabriele Ilharco, Mitchell Wortsman, Ali Farhadi, Ludwig Schmidt",
      "year": 2023,
      "role": "Vector arithmetic as a control mechanism for model behavior",
      "relationship_sentence": "Angular Steering inherits the notion that behaviors correspond to linear directions (as in task vectors), but introduces rotation in activation space as a more stable and fine-grained alternative to simple vector addition."
    }
  ],
  "synthesis_narrative": "Angular Steering reframes behavior control in language models as a geometric rotation within the 2D subspace spanned by the current activation and a target behavior direction. This view directly builds on the concept-direction paradigm introduced by TCAV, which established that human-meaningful concepts can be represented as linear directions in intermediate representations. Earlier geometric interventions like Bolukbasi et al.’s hard debiasing and the NLP-focused INLP demonstrated that projecting out or nulling such directions can suppress unwanted attributes, but these approaches can be brittle and over-suppressive. In parallel, work on GAN latent spaces (GANSpace) showed that traversing interpretable directions affords smooth, continuous control—an intuition Angular Steering adopts for LMs, but implements via rotation rather than translation.\n\nTheoretical groundwork from Toy Models of Superposition highlighted that features cohabit activation subspaces and interfere, motivating Angular Steering’s design to constrain edits to a fixed plane and control magnitude via angle to mitigate collateral interactions. Practical insights from ROME’s layer-localized activation edits inform the adaptive variant of Angular Steering, guiding where rotations are most effective with minimal side effects. Finally, the task-vector literature demonstrated that linear directions can capture complex behaviors and be composed algebraically; Angular Steering operates in the same spirit but provides a more stable, continuous knob than raw addition. Together, these strands converge on a principled, geometry-first intervention that preserves model competence while enabling fine-grained control over behaviors such as refusal and compliance.",
  "analysis_timestamp": "2026-01-07T00:21:32.237821"
}