{
  "prior_works": [
    {
      "title": "Efficient global optimization of expensive black-box functions",
      "authors": "Donald R. Jones, Matthias Schonlau, William J. Welch",
      "year": 1998,
      "role": "Foundational EI/GP-based Bayesian optimization algorithm",
      "relationship_sentence": "The paper’s analysis of constrained expected improvement (CEI) builds directly on the EI framework introduced by EGO, inheriting its improvement-based sampling logic and GP surrogate assumptions."
    },
    {
      "title": "Convergence properties of the expected improvement algorithm with fixed mean and covariance functions",
      "authors": "Emmanuel Vazquez, Julien Bect",
      "year": 2010,
      "role": "Baseline convergence theory for EI",
      "relationship_sentence": "This work established foundational convergence properties of EI, providing techniques and assumptions that the present paper adapts to argue global convergence of CEI before deriving explicit rates."
    },
    {
      "title": "Convergence rates of efficient global optimization algorithms",
      "authors": "Adam D. Bull",
      "year": 2011,
      "role": "Rate guarantees for EI under RKHS/Matérn smoothness",
      "relationship_sentence": "Bull’s rate analysis for unconstrained EI under RKHS/Matérn kernels is the primary technical template the current paper extends to the constrained setting to obtain O(t^{-ν/(2ν+d)})-type simple regret rates and logarithmic factors."
    },
    {
      "title": "Gaussian Process Optimization in the Bandit Setting: No Regret Algorithms and Experimental Design",
      "authors": "Niranjan Srinivas, Andreas Krause, Sham Kakade, Matthias Seeger",
      "year": 2010,
      "role": "GP-based regret bounds and concentration tools in RKHS/GP models",
      "relationship_sentence": "The information-theoretic concentration and posterior variance control techniques from GP-UCB inform the CEI analysis, particularly for GP-sampled functions and kernel-dependent log factors."
    },
    {
      "title": "Bayesian Optimization with Unknown Constraints",
      "authors": "Michael A. Gelbart, Jasper Snoek, Ryan P. Adams",
      "year": 2014,
      "role": "Introduced the practical CEI acquisition (EI times probability of feasibility)",
      "relationship_sentence": "This paper formalized CEI as EI multiplied by the probability of feasibility, providing the exact acquisition rule whose convergence rate the present work analyzes."
    },
    {
      "title": "Bayesian Optimization with Inequality Constraints",
      "authors": "Jacob R. Gardner, Matt J. Kusner, Zhixiang Eddie Xu, Kilian Q. Weinberger",
      "year": 2014,
      "role": "General CBO framework with GP constraint models",
      "relationship_sentence": "Gardner et al. established GP modeling and acquisition formulations for inequality constraints, which the current paper treats theoretically by proving simple regret rates for their CEI-type strategies."
    }
  ],
  "synthesis_narrative": "The paper’s core contribution—deriving explicit convergence rates for constrained expected improvement (CEI)—sits at the intersection of three strands of prior work. First, Jones et al. (1998) introduced expected improvement within GP-based Bayesian optimization, establishing the improvement-based sampling principle and surrogate modeling assumptions that CEI inherits. The constrained analogue of this principle was operationalized a decade later: Gelbart et al. (2014) proposed CEI as EI scaled by the probability of feasibility, and Gardner et al. (2014) provided a broader CBO framework with GP models per constraint, solidifying the acquisition structure and independence assumptions that the present analysis adopts.\nSecond, the methodology for proving rates traces directly to the unconstrained EI literature. Vazquez and Bect (2010) supplied baseline global convergence arguments for EI, while Bull (2011) delivered sharp simple-regret rates under RKHS/Matérn smoothness via interpolation error bounds and fill-distance arguments. The current paper generalizes Bull’s blueprint to the constrained setting, controlling the interaction between the EI term and feasibility probabilities to recover Matérn-dependent O(t^{-ν/(2ν+d)}) rates and to quantify the logarithmic factors.\nThird, for the GP-sampled function regime and the squared exponential kernel, the analysis leverages information-theoretic and concentration tools from GP bandits (Srinivas et al., 2010), which provide posterior variance control and kernel-dependent complexity measures. Combining these ingredients yields the stated O(t^{-1/2} log^{(d+1)/2} t) rate for the SE kernel and extends rate guarantees to the CEI setting that previously lacked theoretical characterization.",
  "analysis_timestamp": "2026-01-07T00:02:04.983184"
}