{
  "prior_works": [
    {
      "title": "Constrained Markov Decision Processes",
      "authors": "Eitan Altman",
      "year": 1999,
      "role": "Foundational theory",
      "relationship_sentence": "SafeVLA’s core formulation explicitly treats safety as cumulative cost constraints within a CMDP, directly inheriting the theoretical framework of Altman’s CMDP to define and optimize safety-performance trade-offs."
    },
    {
      "title": "Constrained Policy Optimization",
      "authors": "Joshua Achiam, David Held, Aviv Tamar, Pieter Abbeel",
      "year": 2017,
      "role": "Optimization method for CMDPs",
      "relationship_sentence": "SafeVLA operationalizes constraint satisfaction during policy learning by leveraging the CPO paradigm’s primal–dual optimization of reward subject to safety costs, adapting it to vision-language-action policy fine-tuning."
    },
    {
      "title": "Robust Adversarial Reinforcement Learning",
      "authors": "Lerrel Pinto, James Davidson, Rahul Sukthankar, Abhinav Gupta",
      "year": 2017,
      "role": "Adversarial risk elicitation / min–max training",
      "relationship_sentence": "SafeVLA’s min–max optimization against elicited safety risks is directly inspired by RARL’s adversarial training, using adversarially generated hazards to stress and harden policies."
    },
    {
      "title": "Safe Reinforcement Learning via Shielding",
      "authors": "Mohammad Alshiekh, Roderick Bloem, Christian Ehlers, Bettina Könighofer, Scott Niekum, Ufuk Topcu",
      "year": 2018,
      "role": "Safety specification and enforcement",
      "relationship_sentence": "SafeVLA’s ISA starts by modeling explicit safety requirements and constraining behaviors, echoing shielding’s formal-specification approach to encode and enforce safety constraints during learning and execution."
    },
    {
      "title": "Benchmarking Safe Exploration in Deep Reinforcement Learning (Safety Gym)",
      "authors": "Alex Ray, Joshua Achiam, Dario Amodei",
      "year": 2019,
      "role": "Benchmark and metrics for safety costs",
      "relationship_sentence": "SafeVLA adopts Safety Gym’s notion of cumulative safety cost and evaluation protocols to quantify safety–performance trade-offs and measure violation reductions."
    },
    {
      "title": "RT-2: Vision-Language-Action Models Transfer Web Knowledge to Robotic Control",
      "authors": "Anthony Brohan et al.",
      "year": 2023,
      "role": "VLA foundation",
      "relationship_sentence": "SafeVLA targets the RT-2-style VLA setting—policies mapping vision and language to actions—providing the base model class that SafeVLA safety-aligns via constrained learning."
    },
    {
      "title": "Red Teaming Language Models with Language Models",
      "authors": "Ethan Perez et al.",
      "year": 2022,
      "role": "Automated unsafe-behavior elicitation",
      "relationship_sentence": "SafeVLA’s active elicitation of diverse unsafe behaviors mirrors LLM red-teaming to systematically surface failure modes that then drive the min–max constrained optimization."
    }
  ],
  "synthesis_narrative": "SafeVLA’s key contribution—safety alignment of vision-language-action policies via constrained learning—sits at the intersection of CMDP-based safe RL, adversarial risk elicitation, and modern VLA architectures. Altman’s CMDP formalism provides the foundational lens to treat safety as explicit cost constraints, enabling principled optimization over safety–performance trade-offs. Building on this, Constrained Policy Optimization offers a practical primal–dual route to enforce constraints during policy improvement; SafeVLA adapts this machinery to high-capacity VLA policies. To proactively surface and reduce safety risks, the method adopts a min–max stance reminiscent of Robust Adversarial RL, where adversarially generated hazards or prompts elicit failure modes that guide robustification. Complementing this, ideas from shielding inform SafeVLA’s explicit safety requirement modeling and constraint enforcement, structuring what constitutes a violation and how to guard against it. Safety Gym shapes evaluation and cost accounting, standardizing how cumulative safety costs are measured and compared against task performance. Finally, RT-2 anchors the application domain by defining the VLA policy class that maps multimodal inputs to actions, while automated red teaming for LLMs motivates SafeVLA’s active elicitation of unsafe behaviors to drive targeted constrained optimization. Together, these threads directly converge in SafeVLA’s Integrated Safety Approach: model risks, elicit failures, constrain via CMDPs, and assure through focused evaluation.",
  "analysis_timestamp": "2026-01-06T23:42:48.155079"
}