{
  "prior_works": [
    {
      "title": "Empowerment: A Universal Agent-Centric Measure of Control",
      "authors": "Alexander S. Klyubin, Daniel Polani, Chrystopher L. Nehaniv",
      "year": 2005,
      "role": "Foundational concept of empowerment in agent-centric AI",
      "relationship_sentence": "Established empowerment as mutual information/channel capacity from an agent’s actions to future observations, providing the exact ‘mirror’ notion that this paper complements with plasticity (information flow from observations to actions)."
    },
    {
      "title": "Causality, Feedback and Directed Information",
      "authors": "James L. Massey",
      "year": 1990,
      "role": "Foundational theory of directed information",
      "relationship_sentence": "Introduced directed information to capture causal information flow with feedback, which the paper explicitly generalizes via the proposed generalized directed information used to define plasticity."
    },
    {
      "title": "Directed Information for Channels with Feedback (PhD Thesis)",
      "authors": "Gerhard Kramer",
      "year": 1998,
      "role": "Key properties and causal conditioning for directed information",
      "relationship_sentence": "Developed causal conditioning, data-processing inequalities, and operational interpretations for directed information in feedback systems, properties the new generalized directed information is designed to preserve."
    },
    {
      "title": "The Capacity of Channels With Feedback",
      "authors": "Sekhar Tatikonda, Sanjoy Mitter",
      "year": 2009,
      "role": "Bridge between directed information and feedback/control",
      "relationship_sentence": "Linked directed information to feedback channel capacity and sequential decision-making, shaping the agent–environment loop formalization that underlies both empowerment and the paper’s plasticity construct."
    },
    {
      "title": "Measuring Information Transfer",
      "authors": "Thomas Schreiber",
      "year": 2000,
      "role": "Precursor directional information-flow measure (transfer entropy)",
      "relationship_sentence": "Introduced transfer entropy as an asymmetric, time-directed measure of information flow, motivating desiderata for causal directionality that the paper’s generalized directed information satisfies and subsumes in interactive settings."
    },
    {
      "title": "Information Theory of Decisions and Actions",
      "authors": "Naftali Tishby, Daniel Polani",
      "year": 2011,
      "role": "Information-theoretic framing of action and perception",
      "relationship_sentence": "Articulated an agent-centric information-theoretic view of perception–action, reinforcing the mutual-information framing that this paper makes symmetric by pairing empowerment (action→future) with plasticity (past observations→action)."
    }
  ],
  "synthesis_narrative": "The core contribution of “Plasticity as the Mirror of Empowerment” is to formalize an agent’s susceptibility to observations—plasticity—via a generalized directed information (GDI) that retains the operational strengths of directed information while extending it to the fully interactive, agent-centric setting. This builds directly on the empowerment program of Klyubin, Polani, and Nehaniv, which cast an agent’s capacity to influence its future as mutual information/channel capacity from actions to future observations. To construct the mirror concept, the authors require a principled, causal, and time-aware measure of information flowing in the opposite direction—from past observations to actions.\nMassey’s directed information provides precisely the formal machinery for causal information flow with feedback. Kramer’s development of causal conditioning, data-processing inequalities, and other structural properties supplies the desiderata that the new GDI must preserve to be a sound generalization. Tatikonda and Mitter’s linkage between directed information and feedback channel capacity situates these quantities within sequential decision and control, aligning with the agent–environment loop that empowerment originally leveraged. Schreiber’s transfer entropy contributes an influential asymmetric notion of information transfer in time series, highlighting the importance of directionality and causality; GDI can be seen as encompassing such directional measures within a unified, agent-centric framework. Finally, Tishby and Polani’s information-theoretic perspective on decisions and actions motivates treating both influence (empowerment) and susceptibility (plasticity) as two sides of the same perception–action coin. Together, these works directly scaffold the paper’s central idea: plasticity as the empowerment mirror, instantiated through a generalized directed information that strictly extends classical directed information while preserving its desirable properties.",
  "analysis_timestamp": "2026-01-07T00:05:12.543196"
}