{
  "prior_works": [
    {
      "title": "3D Gaussian Splatting for Real-Time Radiance Field Rendering",
      "authors": "Kerbl et al.",
      "year": 2023,
      "role": "Baseline explicit representation and problem framing",
      "relationship_sentence": "GeoSVR directly positions itself against 3D Gaussian Splatting’s representational bottlenecks for geometry and completeness, motivating a shift to an explicit sparse-voxel carrier while keeping fast, differentiable rendering supervision."
    },
    {
      "title": "PlenOctrees for Real-time Rendering of Neural Radiance Fields",
      "authors": "Yu et al.",
      "year": 2021,
      "role": "Sparse voxel/octree radiance field representation",
      "relationship_sentence": "PlenOctrees demonstrated that sparse octree voxels with view-dependent features can render NeRFs efficiently, informing GeoSVR’s choice of a sparse voxel structure as a scalable, explicit carrier for scene coverage and local surface refinement."
    },
    {
      "title": "Neural Sparse Voxel Fields",
      "authors": "Liu et al.",
      "year": 2020,
      "role": "Occupancy-guided sparse voxelization for NeRF",
      "relationship_sentence": "NSVF’s pruning and occupancy-aware sampling in sparse voxel grids inspired GeoSVR to concentrate optimization on occupied regions, extending the concept from fast rendering toward geometrically accurate and complete surface reconstruction."
    },
    {
      "title": "Plenoxels: Radiance Fields without Neural Networks",
      "authors": "Fridovich-Keil et al.",
      "year": 2022,
      "role": "Explicit voxel grid optimization",
      "relationship_sentence": "Plenoxels showed that direct optimization of per-voxel coefficients (e.g., SH) can match neural renderers, supporting GeoSVR’s fully explicit optimization paradigm while highlighting the need for additional constraints to achieve clean, accurate surfaces."
    },
    {
      "title": "DS-NeRF: Learning Neural Radiance Fields using Depth Supervision",
      "authors": "Deng et al.",
      "year": 2022,
      "role": "Depth-prior integration with uncertainty for NeRF training",
      "relationship_sentence": "GeoSVR’s Voxel-Uncertainty Depth Constraint builds on the idea of supervising radiance fields with monocular depth cues under uncertainty, adapting it to voxel space to impose robust global scene constraints without harming fine geometry."
    },
    {
      "title": "What Uncertainties Do We Need in Bayesian Deep Learning for Computer Vision?",
      "authors": "Kendall and Gal",
      "year": 2017,
      "role": "Aleatoric uncertainty-weighted loss formulation",
      "relationship_sentence": "GeoSVR’s voxel-oriented uncertainty weighting for depth supervision is grounded in Kendall & Gal’s heteroscedastic uncertainty framework, enabling data-driven attenuation of unreliable depth cues during voxel optimization."
    },
    {
      "title": "Real-time 3D Reconstruction at Scale Using Voxel Hashing",
      "authors": "Nießner et al.",
      "year": 2013,
      "role": "Memory-efficient sparse voxel data structures",
      "relationship_sentence": "The hashed sparse-voxel design from Voxel Hashing informs GeoSVR’s choice of efficient sparse volumetric storage and access, which is crucial for preserving coverage completeness while enabling local surface refinement at scale."
    }
  ],
  "synthesis_narrative": "GeoSVR’s core innovation—an explicit sparse-voxel framework for accurate, detailed, and complete surface reconstruction—arises from unifying two lines of prior work: explicit voxel radiance fields and uncertainty-aware geometric supervision. On the representation side, PlenOctrees and NSVF established that sparse voxel/octree carriers can efficiently model radiance fields by focusing computation on occupied space, while Plenoxels showed that direct optimization of per-voxel coefficients can rival neural networks. GeoSVR leverages these insights but redirects them from rendering speed to geometric fidelity, exploiting sparse voxels’ topology to preserve coverage and enable localized surface refinement. In parallel, the rise of Gaussian Splatting delivered fast, high-quality rendering yet revealed structural limitations for watertightness and geometric clarity; this directly motivates GeoSVR’s move away from point/ellipsoid primitives toward volumetric sparsity with stronger geometric priors. To ensure correct scene convergence, GeoSVR adapts DS-NeRF’s principle of supervising with monocular depth while explicitly modeling uncertainty, grounding its voxel-uncertainty depth constraint in Kendall & Gal’s heteroscedastic formulation to attenuate unreliable cues. Finally, large-scale, memory-efficient sparse volumetric structures—pioneered by Voxel Hashing—inform GeoSVR’s practical design, enabling scalable storage and neighborhood-aware refinement within sparse voxel grids. Together, these works directly shape GeoSVR’s key contribution: a sparse-voxel, uncertainty-regularized reconstruction pipeline that combines the completeness and locality of voxels with robust depth-driven constraints to achieve geometrically accurate surfaces.",
  "analysis_timestamp": "2026-01-07T00:29:42.068619"
}