{
  "prior_works": [
    {
      "title": "3D Gaussian Splatting for Real-Time Radiance Field Rendering",
      "authors": "Thomas Kerbl, Georgios Kopanas, Thomas Leimkühler, Markus Steinberger",
      "year": 2023,
      "role": "Foundational representation and rendering",
      "relationship_sentence": "TGA builds directly on 3DGS’s ellipsoidal scene representation and differentiable affine projection, explicitly identifying and correcting the affine projection’s lack of perspective awareness that degrades fine-scale geometry on near-skin regions."
    },
    {
      "title": "4D Gaussian Splatting for Real-Time Dynamic Scene Rendering",
      "authors": "Wu et al.",
      "year": 2023,
      "role": "Temporal extension of Gaussians (dynamic/4D)",
      "relationship_sentence": "TGA inherits the 4D/temporal modeling of Gaussians and advances it by jointly modeling temporal deformation with perspective-correct projection, rather than treating projection as a fixed affine approximation per frame."
    },
    {
      "title": "HUGS: Human Gaussian Splatting for Animatable Avatars",
      "authors": "Liu et al.",
      "year": 2024,
      "role": "Avatar-specific Gaussian pipelines",
      "relationship_sentence": "By exposing limitations of Gaussian-based human avatars under subtle facial appearance changes, HUGS motivates TGA’s color-sensitive, geometry-consistent formulation tailored to human skin chromatic similarity."
    },
    {
      "title": "Deformable 3D Gaussians for High-Fidelity Dynamic Scene Reconstruction",
      "authors": "Yang et al.",
      "year": 2023,
      "role": "Deformation-field Gaussians",
      "relationship_sentence": "TGA adopts the idea of learning deformation fields on Gaussians and extends it with Jacobian-guided adaptive deformation that is explicitly integrated with the projection model in homogeneous coordinates."
    },
    {
      "title": "Nerfies: Deformable Neural Radiance Fields",
      "authors": "Keunhong Park, Utkarsh Sinha, Jonathan T. Barron, Sofien Bouaziz, Dan B. Goldman, Steven M. Seitz, Ricardo Martin-Brualla",
      "year": 2021,
      "role": "Jacobian-aware canonical warping and regularization",
      "relationship_sentence": "TGA’s Jacobian-guided adaptive deformation echoes Nerfies’ use of Jacobian-based constraints to preserve geometry under motion, but instantiates it for Gaussian splats and couples it with perspective-aware projection."
    },
    {
      "title": "Surface Splatting (EWA Splatting)",
      "authors": "Matthias Zwicker, Hanspeter Pfister, Jeroen van Baar, Markus Gross",
      "year": 2001,
      "role": "Perspective-aware splat footprint via differential projection",
      "relationship_sentence": "TGA draws on the EWA tradition of using the projection Jacobian to obtain perspective-correct elliptical footprints, adapting this principle to 3D Gaussians and unifying it with dynamic deformations."
    }
  ],
  "synthesis_narrative": "TGA’s core insight—making dynamic Gaussian avatars perspective-aware while keeping deformations geometry-consistent—emerges from the confluence of advances in Gaussian splatting, dynamic warping, and classic splat rendering theory. 3D Gaussian Splatting established the high-fidelity, real-time ellipsoidal representation but relies on a local affine projection that is not strictly perspective-correct, which can blur fine geometry when color cues are ambiguous. 4D Gaussian Splatting showed how to extend Gaussians to dynamic scenes, yet continued to treat projection largely as an affine approximation detached from the deformation model. Human-centric pipelines such as HUGS exposed this shortcoming most acutely: subtle facial motions and skin-tone similarity demand higher geometric sensitivity than standard Gaussian pipelines provide.\n\nTGA bridges these gaps by combining deformation-field Gaussians with Jacobian-aware guidance, inspired by Nerfies’ use of Jacobian regularization to preserve structure under motion. Crucially, TGA integrates both temporal deformation and spatial projection in a homogeneous, perspective-aware formulation, aligning the deformation Jacobian with the camera projection Jacobian. This echoes the EWA surface splatting principle of using differential projection for perspective-correct footprints, but recast for 3D Gaussian radiance fields and coupled to time-varying deformations. The result is a color-sensitive, geometry-faithful 4D Gaussian avatar representation that captures fine facial variations under subtle appearance changes where prior Gaussian and avatar methods falter.",
  "analysis_timestamp": "2026-01-07T00:29:41.028219"
}