{
  "prior_works": [
    {
      "title": "The Approximation of One Matrix by Another of Lower Rank",
      "authors": "Carl Eckart, Gale Young",
      "year": 1936,
      "role": "Foundational optimality result for low-rank approximation",
      "relationship_sentence": "The paper explicitly refines the Eckart–Young–Mirsky framework by deriving spectral-norm perturbation bounds that quantify how the optimal rank-p approximation changes under additive noise, going beyond the baseline statement of optimality."
    },
    {
      "title": "The Rotation of Eigenvectors by a Perturbation",
      "authors": "Chandler Davis, William M. Kahan",
      "year": 1970,
      "role": "Classical eigenspace perturbation (sin θ) bounds",
      "relationship_sentence": "The new bounds build on Davis–Kahan’s gap-dependent control of subspace rotation, translating and sharpening these ideas to directly bound ||(A+E)_p − A_p|| in the spectral norm with interaction terms between A and E."
    },
    {
      "title": "Perturbation Bounds in Connection with Singular Value Decomposition",
      "authors": "Per-Åke Wedin",
      "year": 1972,
      "role": "Singular subspace perturbation theory (SVD)",
      "relationship_sentence": "Wedin’s sin θ results for singular subspaces underpin analyses of low-rank structure under noise; the present work sharpens such perturbation guarantees for symmetric matrices by yielding spectral-norm bounds on the difference of best rank-p approximations."
    },
    {
      "title": "Matrix Perturbation Theory",
      "authors": "G. W. Stewart, Ji-Guang Sun",
      "year": 1990,
      "role": "Comprehensive reference for deterministic perturbation analysis",
      "relationship_sentence": "The authors refine and extend classical deterministic perturbation inequalities cataloged by Stewart and Sun, providing sharper, matrix-dependent spectral-norm bounds under mild eigengap and norm conditions."
    },
    {
      "title": "Near-Optimal Differentially Private Principal Components",
      "authors": "Kamalika Chaudhuri, Anand D. Sarwate, Kaushik Sinha",
      "year": 2012,
      "role": "Core algorithmic and utility framework for private PCA",
      "relationship_sentence": "This work motivated rigorous utility guarantees for private PCA, often in Frobenius or variance terms; the new bounds deliver stronger spectral-norm utility guarantees directly aligned with worst-case subspace distortion central to DP LRA."
    },
    {
      "title": "The Noisy Power Method: A Meta Algorithm with Applications",
      "authors": "Moritz Hardt, Eric Price",
      "year": 2014,
      "role": "Analysis of iterative spectral methods under noise with DP applications",
      "relationship_sentence": "By analyzing subspace iteration with injected noise, this work highlighted the need for tight, gap-aware spectral guarantees; the current paper’s bounds provide sharper spectral-norm perturbation control that can strengthen analyses of noisy power methods in DP settings."
    },
    {
      "title": "User-Friendly Tail Bounds for Sums of Random Matrices",
      "authors": "Joel A. Tropp",
      "year": 2012,
      "role": "Matrix concentration tools for high-probability spectral norm control",
      "relationship_sentence": "The paper’s high-probability guarantees for random perturbations leverage matrix concentration techniques à la Tropp to convert deterministic interaction-sensitive bounds into probabilistic spectral-norm estimates for DP noise models."
    }
  ],
  "synthesis_narrative": "The paper synthesizes classical matrix approximation and perturbation theory with modern probabilistic tools and differential privacy motivations. Eckart–Young (and Mirsky’s extension) provides the optimality baseline for rank-p approximations, but it does not quantify how optimal solutions drift under perturbations. Davis–Kahan and Wedin supply gap-dependent control of eigenvector and singular subspace rotations, forming the deterministic backbone for understanding subspace stability. Stewart and Sun’s monograph consolidates these inequalities and their regimes of validity, offering a starting point the authors explicitly refine: rather than bounding angles alone or relying on Frobenius metrics, they deliver sharp spectral-norm bounds on the difference between best rank-p approximations that depend on the interaction of A and E and mild eigengap conditions.\nOn the application side, differentially private PCA and low-rank approximation works, notably Chaudhuri–Sarwate–Sinha and Hardt–Price’s noisy power method, established algorithmic paradigms and utility analyses—often in reconstruction or Frobenius norms or subspace angles. These results underscore the need for worst-case, spectral-norm guarantees that certify minimal directional distortion of the top-p structure under privacy noise. Finally, Tropp’s matrix concentration inequalities enable translating the new deterministic, interaction-sensitive perturbation bounds into high-probability statements for common DP noise models (e.g., Gaussian/Wigner-type perturbations). Together, these strands directly inform the paper’s core contribution: high-probability, gap-aware spectral-norm perturbation bounds for low-rank approximations, tailored to both deterministic and randomized (privacy) perturbations.",
  "analysis_timestamp": "2026-01-07T00:21:32.238374"
}