{
  "prior_works": [
    {
      "title": "Formalizing the Low-Degree Conjecture for High-Dimensional Inference",
      "authors": "Ankur Moitra et al.",
      "year": 2023,
      "role": "Foundational assumption/framework",
      "relationship_sentence": "This work rigorously formalizes the (extended) low-degree conjecture that the present paper assumes, providing the precise hypothesis under which their computational lower bounds for weak recovery in SBM are derived."
    },
    {
      "title": "Computational Barriers for High-Dimensional Statistics from the Low-Degree Likelihood Ratio",
      "authors": "Tselil Schramm, Alexander S. Wein",
      "year": 2022,
      "role": "Technique/methodology (low-degree LR)",
      "relationship_sentence": "Provides the low-degree likelihood ratio framework that the paper leverages to translate low-degree indistinguishability into concrete polynomial-time lower bounds, enabling rate-sensitive impossibility below KS."
    },
    {
      "title": "Broadcasting on Trees and the Ising Model",
      "authors": "William Evans, Claire Kenyon, Yuval Peres, Leonard J. Schulman",
      "year": 2000,
      "role": "Theoretical threshold (KS) on trees",
      "relationship_sentence": "Establishes the Kesten–Stigum reconstruction threshold on trees, the fundamental information-theoretic barrier that underlies the SBM detectability transition analyzed in this paper."
    },
    {
      "title": "Asymptotic analysis of the stochastic block model reveals the detectability threshold",
      "authors": "Florent Decelle, Cristopher Moore, Aurélien Decelle, Lenka Zdeborová",
      "year": 2011,
      "role": "Nonrigorous prediction of KS and algorithmic landscape",
      "relationship_sentence": "Predicts the KS threshold and sharp transitions in community detection via cavity methods, motivating the search for rigorous computational evidence at KS that this paper supplies under the low-degree conjecture."
    },
    {
      "title": "Community Detection Thresholds and the Weak Detection Problem in Sparse Graphs",
      "authors": "Laurent Massoulié",
      "year": 2014,
      "role": "Algorithm achieving detection above KS",
      "relationship_sentence": "Shows polynomial-time algorithms attain positive correlation above KS, providing the upper-bound side that the new lower bounds complement to argue a sharp algorithmic transition at KS."
    },
    {
      "title": "Reconstruction and Estimation in the Planted Partition Model",
      "authors": "Elchanan Mossel, Joe Neeman, Allan Sly",
      "year": 2015,
      "role": "Rigorous thresholds/algorithms around KS",
      "relationship_sentence": "Gives rigorous results on reconstruction thresholds and belief propagation performance in SBM, grounding the KS frontier that the present work targets with computational lower bounds."
    },
    {
      "title": "Exact Recovery in the Stochastic Block Model via Semidefinite Programming",
      "authors": "Emmanuel Abbe, Afonso S. Bandeira, Georgina Hall",
      "year": 2015,
      "role": "Polynomial-time success regimes",
      "relationship_sentence": "Establishes polynomial-time recovery guarantees in regimes above critical thresholds, reinforcing the narrative that efficient algorithms succeed above KS while the present paper rules out even vanishing correlation below."
    }
  ],
  "synthesis_narrative": "The paper’s core contribution is a computational lower bound for weak recovery in the symmetric stochastic block model (SBM) that is sensitive to recovery rate and aligns sharply with the Kesten–Stigum (KS) threshold. Two strands of prior work directly feed into this result. First, the KS frontier itself—developed for broadcasting on trees (Evans–Kenyon–Peres–Schulman) and predicted for SBMs via cavity methods (Decelle–Krzakala–Moore–Zdeborová)—established the information-theoretic transition governing detectability. Rigorous algorithmic and threshold analyses around KS (Massoulié; Mossel–Neeman–Sly) showed that polynomial-time methods can achieve positive (constant) correlation above KS, shaping the upper-bound side of the transition this paper seeks to match from below.\nSecond, the computational lower-bound machinery comes from the low-degree program. The low-degree likelihood ratio framework (Schramm–Wein) ties the failure of low-degree polynomials to the failure of all polynomial-time algorithms under the low-degree conjecture. The present work crucially relies on Moitra et al.’s 2023 formalization of the (extended) low-degree conjecture, which provides a clear assumption under which indistinguishability results can be lifted to unconditional algorithmic limitations. Building on these, the authors show that below KS no polynomial-time algorithm can even achieve n^{-0.49} correlation—offering the first rigorous evidence (under this assumption) of a sharp recovery-rate transition at KS. Moreover, by invoking a stronger variant of the conjecture, they extend the lower bound to settings with a diverging number of blocks, pushing beyond classical fixed-q analyses and aligning computational lower bounds with known algorithmic successes above KS.",
  "analysis_timestamp": "2026-01-07T00:21:32.289150"
}