{
  "prior_works": [
    {
      "title": "A Multiscale Approach to Optimal Transport",
      "authors": "Quentin Mérigot",
      "year": 2011,
      "role": "Foundational semi-discrete OT formulation and geometry",
      "relationship_sentence": "This paper established the semi-discrete dual formulation via power/Laguerre diagrams and the link between dual potentials and transport cells, providing the exact objective and map parameterization that the present work optimizes with SGD."
    },
    {
      "title": "Convergence of a Newton algorithm for semi-discrete optimal transport",
      "authors": "Jun Kitagawa, Quentin Mérigot, Boris Thibert",
      "year": 2019,
      "role": "Deterministic optimization and regularity properties of the semi-discrete dual",
      "relationship_sentence": "By analyzing convexity, differentiability, and uniqueness of dual potentials and the stability of Laguerre cells, this work supplies the structural assumptions the current paper leverages to define a projection set containing a minimizer and to justify gradient-based convergence."
    },
    {
      "title": "Stochastic Optimization for Large-scale Optimal Transport",
      "authors": "Aude Genevay, Gabriel Peyré, Marco Cuturi",
      "year": 2016,
      "role": "Stochastic gradient framework for OT via dual objectives",
      "relationship_sentence": "Introducing stochastic gradients on OT duals (with entropic regularization), this work is the direct algorithmic antecedent for using SGD on OT potentials and motivates the present paper’s analysis of unregularized semi-discrete SGD and its statistical accuracy."
    },
    {
      "title": "Acceleration of Stochastic Approximation by Averaging",
      "authors": "Boris T. Polyak, Anatoli B. Juditsky",
      "year": 1992,
      "role": "Averaged SGD for optimal statistical rates",
      "relationship_sentence": "Polyak–Ruppert averaging underpins the paper’s use of averaged projected SGD to achieve the optimal O(1/√n) statistical rate for estimating the OT map from samples."
    },
    {
      "title": "Robust Stochastic Approximation Approach to Stochastic Programming",
      "authors": "Arkadi Nemirovski, Anatoli Juditsky, Guanghui Lan, Alexander Shapiro",
      "year": 2009,
      "role": "Projected stochastic (mirror) gradient methods with convergence guarantees",
      "relationship_sentence": "This work provides the core convergence analysis tools for projected stochastic approximation in convex settings, directly informing the paper’s design of a projection set and its finite-sample O(1/√n) performance guarantees."
    },
    {
      "title": "Plug-in Estimation of Optimal Transport Maps",
      "authors": "Vladislav Manole, Jonathan Niles-Weed, Philippe Rigollet",
      "year": 2021,
      "role": "Statistical framework and rates for OT map estimation",
      "relationship_sentence": "By formalizing statistical risk for estimating Monge maps and deriving rates/lower bounds in the fully continuous case, this work provides the blueprint the paper adapts to the semi-discrete setting to establish minimax O(1/√n) rates."
    }
  ],
  "synthesis_narrative": "The paper’s core contribution—proving that averaged projected SGD estimates the semi-discrete OT map at the minimax O(1/√n) rate and identifying a projection set that contains an optimizer even with non-compact source support—rests on two pillars: the semi-discrete OT geometry and modern stochastic approximation theory. Mérigot (2011) supplied the essential semi-discrete dual formulation, expressing the objective in terms of Kantorovich potentials and Laguerre (power) diagrams; this precise structure makes unbiased stochastic gradients from samples readily available. Building on that foundation, Kitagawa–Mérigot–Thibert (2019) analyzed differentiability, convexity, and stability of the semi-discrete dual and its cells, providing the regularity needed to assert existence/uniqueness of minimizers and to motivate boundedness properties that justify projection even when the source measure is not compact.\nOn the algorithmic side, Genevay–Peyré–Cuturi (2016) demonstrated that stochastic gradients on OT duals are effective at scale (albeit in the entropically regularized setting), directly inspiring the unregularized semi-discrete SGD considered here. The convergence and statistical guarantees of the present work lean on Polyak–Juditsky (1992) for averaging to attain optimal variance and Nemirovski–Juditsky–Lan–Shapiro (2009) for projected stochastic approximation with finite-sample O(1/√n) rates under convexity and Lipschitz conditions. Finally, recent statistical studies of OT map estimation, exemplified by Manole–Niles-Weed–Rigollet (2021), shaped the risk formulation and lower-bound methodology; by exploiting the finite-dimensional semi-discrete parameterization of the potentials, the current paper translates those ideas to establish a sharp, parametric minimax rate for map recovery via SGD.",
  "analysis_timestamp": "2026-01-07T00:21:32.256839"
}