{
  "prior_works": [
    {
      "title": "Counterfactual explanations without opening the black box: Automated decisions and the GDPR",
      "authors": "Sandra Wachter, Brent Mittelstadt, Chris Russell",
      "year": 2017,
      "role": "Foundational counterfactual explanations",
      "relationship_sentence": "ElliCE builds on the standard counterfactual explanation formulation introduced by Wachter et al., but extends it to ensure validity not for a single fitted model, but uniformly over a set of near-optimal models."
    },
    {
      "title": "Actionable Recourse in Linear Classification",
      "authors": "Berk Ustun, Alexander Spangher, Yang Liu",
      "year": 2019,
      "role": "Optimization-based recourse with costs and constraints",
      "relationship_sentence": "ElliCE generalizes Ustun et al.’s convex optimization framework for actionable recourse by replacing single-model constraints with robust counterparts that must hold across an entire ellipsoidal model-uncertainty set."
    },
    {
      "title": "Predictive multiplicity in classification",
      "authors": "Charles Marx, Flavio Calmon, Berk Ustun",
      "year": 2020,
      "role": "Model multiplicity as a practical problem",
      "relationship_sentence": "By documenting the prevalence and consequences of multiple equally accurate models, this work motivates ElliCE’s central goal of making counterfactual recourse robust to model multiplicity."
    },
    {
      "title": "All models are wrong, but many are useful: Learning a variable's importance by studying an empirical Rashomon set of good models",
      "authors": "Anna Fisher, Cynthia Rudin, Francesca Dominici",
      "year": 2019,
      "role": "Rashomon set concept and empirical study",
      "relationship_sentence": "ElliCE operationalizes the empirical Rashomon set idea by proposing an ellipsoidal approximation to this set and optimizing counterfactuals that are guaranteed to be valid throughout it."
    },
    {
      "title": "Towards Robust and Reliable Algorithmic Recourse",
      "authors": "Suvrat Upadhyay, Shiv Shankar Joshi, Himabindu Lakkaraju",
      "year": 2021,
      "role": "Robust recourse under perturbations",
      "relationship_sentence": "ElliCE extends the robust-recourse agenda of ROAR by shifting robustness from local input perturbations to robustness over a family of near-optimal models, with provable guarantees."
    },
    {
      "title": "Robust solutions of uncertain linear programs",
      "authors": "Aharon Ben-Tal, Arkadi Nemirovski",
      "year": 1998,
      "role": "Ellipsoidal uncertainty sets and tractable robust optimization",
      "relationship_sentence": "ElliCE leverages the robust optimization machinery pioneered here—particularly the use of ellipsoidal uncertainty sets that yield convex, tractable programs—to enforce validity of recourse across the Rashomon ellipsoid."
    },
    {
      "title": "Robustness and Regularization Are Equivalent",
      "authors": "Huan Xu, Constantine Caramanis, Shie Mannor",
      "year": 2009,
      "role": "Link between parameter robustness and quadratic regularization",
      "relationship_sentence": "ElliCE’s ellipsoidal (quadratic) approximation of the Rashomon set and its proofs of uniqueness and stability draw on the equivalence between ellipsoidal robustness and L2-type regularization, supporting its theoretical guarantees."
    }
  ],
  "synthesis_narrative": "ElliCE’s core contribution—provably robust algorithmic recourse across the Rashomon set—sits at the confluence of counterfactual recourse, model multiplicity, and robust optimization. Foundational works on counterfactual explanations and actionable recourse (Wachter et al.; Ustun et al.) established counterfactuals as optimization problems with costs and feasibility constraints, but they target a single fitted model. Subsequent evidence of predictive multiplicity (Marx, Calmon, Ustun) exposed a key vulnerability: actions valid for one near-optimal model can fail under another, motivating robustness to an entire set of plausible models rather than to local perturbations alone.\nThe Rashomon set literature (Fisher, Rudin, Dominici) formalized this set-of-good-models perspective and studied feature importance across it. ElliCE translates this conceptual lens into an operational tool by proposing an ellipsoidal approximation of the Rashomon set around an empirical risk minimizer, enabling optimization of counterfactuals that are guaranteed valid throughout the set. This move is technically grounded in robust optimization with ellipsoidal uncertainty (Ben-Tal, Nemirovski), which provides convex, tractable robust counterparts and natural certificates. Moreover, the equivalence between robustness to parameter perturbations and quadratic regularization (Xu, Caramanis, Mannor) underpins ElliCE’s guarantees on uniqueness and stability via strong convexity of the ellipsoidal level sets.\nRelative to prior robust recourse (e.g., ROAR), which focuses on robustness to input noise or local perturbations, ElliCE explicitly targets model uncertainty induced by multiplicity, offering theoretical guarantees on validity, uniqueness, and alignment with salient feature directions across the Rashomon set.",
  "analysis_timestamp": "2026-01-06T23:42:48.135156"
}