{
  "prior_works": [
    {
      "title": "Trajectory Balance: Improved Credit Assignment in GFlowNets",
      "authors": "Malkin et al.",
      "year": 2022,
      "role": "Gap Identification",
      "relationship_sentence": "Introduced the TB objective that existing GFlowNet VRP solvers rely on for global trajectory optimization, whose tendency to under-optimize local choices is the precise shortcoming HBG remedies by adding a complementary DB component."
    },
    {
      "title": "GFlowNet Foundations",
      "authors": "Bengio et al.",
      "year": 2021,
      "role": "Foundation",
      "relationship_sentence": "Formalized the GFlowNet framework and the Detailed Balance (DB) training principle for local consistency, which HBG adopts as the local-optimization pillar to complement TB."
    },
    {
      "title": "Subtrajectory Balance for GFlowNets",
      "authors": "Madan et al.",
      "year": 2023,
      "role": "Inspiration",
      "relationship_sentence": "Showed that objectives interpolating between local and global credit assignment can stabilize learning, directly inspiring HBG’s principled, adaptive integration of TB and DB rather than committing to a single objective."
    },
    {
      "title": "Attention, Learn to Solve Routing Problems!",
      "authors": "Kool et al.",
      "year": 2019,
      "role": "Foundation",
      "relationship_sentence": "Established the modern neural formulation of TSP/CVRP with explicit depot semantics and standardized decoding/evaluation, which HBG leverages to craft its depot-centric inference strategy for CVRP."
    },
    {
      "title": "POMO: Policy Optimization with Multiple Optima",
      "authors": "Kwon et al.",
      "year": 2020,
      "role": "Inspiration",
      "relationship_sentence": "Exploited routing symmetries and depot-centered decoding to boost performance, motivating HBG’s specialized inference that capitalizes on the depot’s higher successor flexibility in CVRP."
    },
    {
      "title": "Bayesian Structure Learning with GFlowNets",
      "authors": "Deleu et al.",
      "year": 2022,
      "role": "Related Problem",
      "relationship_sentence": "Demonstrated practical trade-offs between GFlowNet training objectives on complex combinatorial structures, reinforcing the need for combining local (DB) and global (TB) signals that HBG operationalizes for routing."
    }
  ],
  "synthesis_narrative": "Hybrid-Balance GFlowNet (HBG) directly emerges from the evolution of GFlowNet training objectives and the neural routing literature. The GFlowNet Foundations work by Bengio et al. established the framework and the Detailed Balance (DB) objective, defining local flow consistency. Malkin et al. later introduced Trajectory Balance (TB), which quickly became the default for combinatorial generation due to its strong global credit assignment—also adopted by early GFlowNet-based routing methods. However, TB’s weakness in local optimization is well documented and is exactly the limitation HBG targets. Madan et al. advanced the field with Subtrajectory Balance, empirically showing that balancing local and global signals can stabilize training; HBG extends this idea by adaptively hybridizing TB and DB in a principled manner, explicitly aligning their complementary strengths for VRPs.\nIn parallel, the neural routing line shaped HBG’s inference design. Kool et al. codified the modern TSP/CVRP setup with explicit depot semantics and standardized decoding, which HBG leverages to craft a depot-centric inference routine exploiting the depot’s higher branching flexibility. POMO by Kwon et al. highlighted how depot-centered and symmetry-aware decoding can materially improve routing solutions, directly inspiring HBG’s specialized inference for CVRP. Finally, experience from GFlowNet applications on complex discrete structures (e.g., Deleu et al. in Bayesian structure learning) reinforced the practical need to reconcile DB and TB trade-offs—precisely the niche HBG fills by adaptively combining them while remaining applicable to both depot and non-depot settings (CVRP and TSP).",
  "analysis_timestamp": "2026-01-06T23:08:23.942050"
}