{
  "prior_works": [
    {
      "title": "Kronecker Graphs: An Approach to Modeling Networks",
      "authors": [
        "Jure Leskovec",
        "Deepayan Chakrabarti",
        "Jon Kleinberg",
        "Christos Faloutsos",
        "Zoubin Ghahramani"
      ],
      "year": 2010,
      "role": "baseline/contrast",
      "relationship_sentence": "GraphMaster moves beyond classic structure-only generators like Kronecker graphs by producing text-rich, semantically meaningful node/edge attributes and enforcing structural consistency via LLM agents."
    },
    {
      "title": "GraphRNN: Generating Realistic Graphs with Deep Auto-regressive Models",
      "authors": [
        "Jiaxuan You",
        "Rex Ying",
        "Xiang Ren",
        "William L. Hamilton",
        "Jure Leskovec"
      ],
      "year": 2018,
      "role": "baseline/contrast",
      "relationship_sentence": "While GraphRNN pioneered deep autoregressive graph synthesis at the topology level, GraphMaster extends generation to semantically attributed graphs and adds multi-agent iterative checks to mitigate LLM hallucination and maintain structural validity."
    },
    {
      "title": "NetGAN: Generating Graphs via Random Walks",
      "authors": [
        "Aleksandar Bojchevski",
        "Oleksandra Shchur",
        "Daniel Zügner",
        "Stephan Günnemann"
      ],
      "year": 2018,
      "role": "baseline/contrast",
      "relationship_sentence": "NetGAN focuses on structural realism via random-walk–based GANs, whereas GraphMaster directly tackles the missing semantic/textual attributes problem and introduces agentic verification to ensure consistency under LLM generation."
    },
    {
      "title": "TextGCN: Graph Convolutional Networks for Text Classification",
      "authors": [
        "Liang Yao",
        "Chengsheng Mao",
        "Yuan Luo"
      ],
      "year": 2019,
      "role": "problem framing",
      "relationship_sentence": "By evidencing the utility of text-attributed graphs for downstream tasks, TextGCN motivates GraphMaster’s emphasis on generating semantically rich textual node attributes rather than only graph topology."
    },
    {
      "title": "Open Graph Benchmark: Datasets for Machine Learning on Graphs",
      "authors": [
        "Weihua Hu",
        "Matthias Fey",
        "Marinka Zitnik",
        "Yuxiao Dong",
        "Jure Leskovec"
      ],
      "year": 2020,
      "role": "dataset/motivation",
      "relationship_sentence": "OGB highlighted the scarcity and diversity gaps of large-scale graph corpora, directly motivating GraphMaster’s automated synthesis pipeline to provision data for graph foundation models in data-limited settings."
    },
    {
      "title": "ReAct: Synergizing Reasoning and Acting in Language Models",
      "authors": [
        "Shunyu Yao",
        "Jeffrey Zhao",
        "Dian Yu",
        "Izhak Shafran",
        "Thomas L. Griffiths",
        "Yuan Cao",
        "Karthik Narasimhan"
      ],
      "year": 2023,
      "role": "methodological inspiration",
      "relationship_sentence": "GraphMaster’s Manager–Perception–Enhancement–Evaluation agents operationalize a ReAct-like loop of reasoning, acting (tool checks and structural validation), and feedback to curb hallucinations and enforce graph constraints."
    },
    {
      "title": "Self-Instruct: Aligning Language Models with Self-Generated Instructions",
      "authors": [
        "Yizhong Wang",
        "Yeganeh Kordi",
        "Swaroop Mishra",
        "Alisa Liu"
      ],
      "year": 2023,
      "role": "methodological inspiration",
      "relationship_sentence": "GraphMaster adapts the self-instruct principle to bootstrap graph synthesis in low-resource regimes, iteratively refining prompts/outputs across agents to expand high-quality synthetic corpora."
    }
  ],
  "synthesis_narrative": "GraphMaster targets a core gap exposed by structural graph generators—Kronecker Graphs, GraphRNN, and NetGAN—which excel at reproducing topology but neglect the semantically rich textual attributes increasingly crucial for real-world graph applications. TextGCN demonstrated that text-attributed graphs can unlock stronger task performance, reinforcing the need for synthesis approaches that create meaningful node/edge text rather than only edges. Concurrently, the Open Graph Benchmark underscored the shortage and limited diversity of large, high-quality graph corpora, a central bottleneck for training and evaluating graph foundation models. To overcome LLM limitations (context, hallucination, and structural inconsistency) when creating complex graphs, GraphMaster draws methodological inspiration from the ReAct paradigm: it decomposes generation into agent roles that reason, act with tools/validators, and iteratively feedback to each other. This agentic loop, complemented by Self-Instruct’s iterative bootstrapping ethos, enables GraphMaster to scale synthesis in data-limited settings while improving faithfulness and constraint satisfaction over iterations. In combination, these prior lines of work—structural graph generation, evidence of the value of text-attributed graphs, recognition of dataset scarcity for GFMs, and agentic LLM control for iterative reasoning and verification—directly shaped GraphMaster’s multi-agent design for producing structurally consistent, semantically meaningful synthetic graphs tailored to the needs of graph foundation models.",
  "analysis_timestamp": "2026-01-07T00:21:32.359794"
}