{
  "prior_works": [
    {
      "title": "Neural Ordinary Differential Equations",
      "authors": "Ricky T. Q. Chen, Yulia Rubanova, Jesse Bettencourt, David Duvenaud",
      "year": 2018,
      "role": "Foundational method for learning continuous-time dynamics and training via the adjoint sensitivity method",
      "relationship_sentence": "JacobianODE builds directly on the neural ODE formulation to learn a differentiable vector field from time series so that state-dependent Jacobians—and hence directed, contextual control between subsystems—can be computed via automatic differentiation."
    },
    {
      "title": "Discovering governing equations from data by sparse identification of nonlinear dynamical systems (SINDy)",
      "authors": "Steven L. Brunton, Joshua L. Proctor, J. Nathan Kutz",
      "year": 2016,
      "role": "Data-driven system identification for explicit nonlinear ODEs enabling analytic Jacobians",
      "relationship_sentence": "SINDy established that one can infer nonlinear vector fields (and thus Jacobians) from data, directly motivating the paper’s data-driven Jacobian-based characterization of inter-subsystem influence, while the new work replaces sparsity-based libraries with a deep, flexible estimator."
    },
    {
      "title": "Dynamic Mode Decomposition with Control (DMDc)",
      "authors": "Joshua L. Proctor, Steven L. Brunton, J. Nathan Kutz",
      "year": 2016,
      "role": "Linear system identification yielding A and B matrices that quantify state and control influence",
      "relationship_sentence": "DMDc’s estimation of A and B provided a control-theoretic template for attributing influence that the paper generalizes to nonlinear, state-dependent settings via local Jacobians between interacting subsystems."
    },
    {
      "title": "Dynamic causal modelling",
      "authors": "Karl J. Friston, Lee Harrison, Will Penny",
      "year": 2003,
      "role": "Effective connectivity framework with (bi)linear, context-modulated interactions",
      "relationship_sentence": "The proposed Jacobian-based measure extends DCM’s effective connectivity idea by learning flexible, nonlinear and context-dependent interactions directly from data without prescribing bilinear parametric forms."
    },
    {
      "title": "Granger causality analysis in neuroscience and neuroimaging",
      "authors": "Anil K. Seth, Adam B. Barrett, Lionel Barnett",
      "year": 2015,
      "role": "Widely used linear time-series causality framework and benchmark",
      "relationship_sentence": "The paper addresses limitations of linear Granger approaches by replacing global VAR coefficients with state-dependent Jacobians that capture nonlinear, directional, and context-sensitive control between subsystems."
    },
    {
      "title": "Equation-free mechanistic ecosystem forecasting using empirical dynamic modeling",
      "authors": "Hao Ye, Ethan R. Deyle, Luis J. Gilarranz, George Sugihara",
      "year": 2015,
      "role": "Nonparametric state-space reconstruction using local linear (S-map) models to infer interactions via Jacobians",
      "relationship_sentence": "EDM’s use of local linearization to estimate interaction strengths directly inspired the paper’s framing of subsystem influence as entries of a learned Jacobian, while the new method scales this idea with deep models to high-dimensional settings."
    },
    {
      "title": "Neural Controlled Differential Equations for Irregular Time Series",
      "authors": "Patrick Kidger, James Morrill, James Foster, Terry Lyons",
      "year": 2020,
      "role": "Continuous-time modeling of irregular data and pathwise controls",
      "relationship_sentence": "Techniques from Neural CDEs inform the paper’s handling of irregular, multimodal time series and the interpretation of one subsystem’s trajectory as a control-like signal affecting another via the learned Jacobian."
    }
  ],
  "synthesis_narrative": "The paper’s core contribution is a nonlinear, control-theoretic characterization of interactions between subsystems by learning a differentiable dynamical model and reading out directed, context-dependent influence from its Jacobian. Neural ODEs provided the essential machinery: a continuous-time, differentiable vector field trained with the adjoint method, enabling efficient estimation of state-dependent Jacobians from time series. Complementing this, SINDy demonstrated that governing equations—and thus Jacobians—can be identified from data, motivating a Jacobian-centric interpretation of influence, while the new deep approach trades handcrafted libraries for expressive neural parameterizations. In parallel, linear system identification and control perspectives (DMDc) and neuroscience’s effective connectivity (DCM) established the value of A/B or bilinear terms for quantifying how one component modulates another; the present work generalizes these ideas to nonlinear, context-varying Jacobians that capture rich interactions. The widespread use and limitations of linear Granger causality in neuroscience sharpen the target: replacing global linear coefficients with local, state-dependent Jacobian entries to capture directionality, strength, and contextual modulation in complex systems. From empirical dynamic modeling, the authors inherit the insight that local linearization (S-map) can reveal interaction structure via Jacobians, while advancing it to high-dimensional, noisy settings with deep learning. Finally, Neural CDEs inform robust learning from irregular trajectories and a control-like view of one subsystem’s path influencing another, consolidating the paper’s JacobianODE as a practical, nonlinear successor to classical connectivity and causality tools.",
  "analysis_timestamp": "2026-01-06T23:42:48.123812"
}