{
  "prior_works": [
    {
      "title": "3D Gaussian Splatting for Real-Time Radiance Field Rendering",
      "authors": "Bernhard Kerbl, Georgios Kopanas, Thomas Leimkühler, George Drettakis",
      "year": 2023,
      "role": "Established the 3D Gaussian Splatting representation and real-time differentiable splat-based renderer that LODGE builds upon.",
      "relationship_sentence": "LODGE extends 3DGS with a hierarchical level-of-detail selection, pruning, and streaming strategy tailored to the Gaussian primitive introduced by Kerbl et al."
    },
    {
      "title": "QSplat: A Multiresolution Point Rendering System for Large Models",
      "authors": "Szymon Rusinkiewicz, Marc Levoy",
      "year": 2000,
      "role": "Classical multiresolution point-based rendering with distance- and screen-space-driven LOD and hierarchical culling.",
      "relationship_sentence": "LODGE adapts QSplat’s core idea of distance-aware hierarchical point selection to Gaussian splats, guiding its iterative subset selection for efficient rendering."
    },
    {
      "title": "Surfels: Surface Elements as Rendering Primitives",
      "authors": "Hanspeter Pfister, Matthias Zwicker, Jeroen van Baar, Markus Gross",
      "year": 2000,
      "role": "Introduced surfel-based point rendering with anti-aliasing, pruning, and blending strategies to maintain visual quality.",
      "relationship_sentence": "LODGE’s importance-based pruning and opacity blending at chunk boundaries echo surfel rendering principles for artifact-free transitions while reducing draw cost."
    },
    {
      "title": "PlenOctrees for Real-time Rendering of Neural Radiance Fields",
      "authors": "Alex Yu, Ruilong Li, Matthew Tancik, Hao Li, Ren Ng, Angjoo Kanazawa",
      "year": 2021,
      "role": "Demonstrated hierarchical, pruned radiance field distillation into an octree for real-time rendering with memory-efficient lookup.",
      "relationship_sentence": "LODGE’s hierarchical representation and importance-driven pruning for fast queries draw on PlenOctrees’ use of multiscale structures to retain fidelity while cutting memory."
    },
    {
      "title": "Mega-NeRF: Scalable Construction of Large-Scale NeRFs",
      "authors": "Christian Reiser, Songyou Peng, Yiyi Liao, Andreas Geiger",
      "year": 2021,
      "role": "Pioneered spatial partitioning of large scenes with region-specific models and streaming to handle city-scale data.",
      "relationship_sentence": "LODGE’s spatial chunking and dynamic loading directly mirror Mega-NeRF’s partition-and-stream design, enabling memory-constrained real-time rendering at scale."
    },
    {
      "title": "Mip-NeRF: A Multiscale Representation for Anti-Aliasing Neural Radiance Fields",
      "authors": "Jonathan T. Barron, Ben Mildenhall, Matthew Tancik, Peter Hedman, Ricardo Martin-Brualla, Pratul P. Srinivasan",
      "year": 2021,
      "role": "Introduced cone-based integration and scale-aware prefiltering to combat aliasing via true multiscale radiance representation.",
      "relationship_sentence": "LODGE’s depth-aware smoothing and level construction are motivated by Mip-NeRF’s anti-aliasing via prefiltering, enabling stable detail roll-off with distance."
    },
    {
      "title": "Zip-NeRF: Anti-Aliased Grid-Based Neural Radiance Fields",
      "authors": "Jonathan T. Barron, Ben Mildenhall, Dor Verbin, Pratul P. Srinivasan, Peter Hedman",
      "year": 2023,
      "role": "Advanced anti-aliased neural rendering and provided strong indoor benchmarks emphasizing fidelity under scale changes.",
      "relationship_sentence": "LODGE targets Zip-NeRF’s anti-aliased quality while achieving real-time performance on memory-limited devices, informing its fidelity-preserving LOD and evaluation protocol."
    }
  ],
  "synthesis_narrative": "LODGE’s core contribution—an explicit, hierarchical level-of-detail pipeline for 3D Gaussian Splatting with pruning and streaming—stands on two converging lines of prior work: point-based LOD and multiscale neural rendering. The foundational basis is Kerbl et al.’s 3D Gaussian Splatting, which supplies the differentiable splat primitive and optimization framework that LODGE reorganizes across levels. Classic point-based rendering (QSplat, Surfels) contributes the key ideas of distance-aware hierarchical selection, pruning low-importance elements, and opacity-respecting blending to avoid popping—principles LODGE adapts to the Gaussian domain via importance-based pruning and boundary-safe opacity blending. From neural radiance field acceleration, PlenOctrees shows how hierarchical, pruned structures preserve quality while enabling real-time traversal, directly informing LODGE’s multi-level construction and culling. For scaling to city-sized scenes under tight memory, Mega-NeRF’s spatial partitioning and streaming inspire LODGE’s chunking and dynamic loading strategy. Finally, the anti-aliasing lineage (Mip-NeRF and Zip-NeRF) motivates LODGE’s depth-aware smoothing and level construction to maintain fidelity when reducing detail with distance. Synthesizing these threads, LODGE integrates Gaussian-native LOD selection with prefiltered level generation, aggressive yet quality-preserving pruning, and streaming-aware chunk management to deliver real-time, memory-efficient rendering of large scenes without sacrificing visual quality.",
  "analysis_timestamp": "2026-01-07T00:21:32.250070"
}