{
  "prior_works": [
    {
      "title": "Methods of A.M. Lyapunov and Their Application",
      "authors": "V.I. Zubov",
      "year": 1964,
      "role": "Theoretical foundation for region-of-attraction characterization",
      "relationship_sentence": "The paper’s Zubov‑inspired sampling and boundary estimation directly build on Zubov’s theorem, which characterizes the region of attraction via a value function whose level sets trace the RoA boundary."
    },
    {
      "title": "Constructing Lyapunov Functions Using Radial Basis Functions",
      "authors": "Philipp Giesl",
      "year": 2007,
      "role": "Computational realization of Zubov-based Lyapunov/RoA computation",
      "relationship_sentence": "This work demonstrates practical numerical approximations of Zubov-type Lyapunov functions, motivating the paper’s learnable surrogate that targets boundary‑aware sampling for less conservative RoA estimation."
    },
    {
      "title": "LQR-Trees: Feedback Motion Planning via Sums-of-Squares Verification",
      "authors": "Russ Tedrake, Ian R. Manchester, Mark M. Tobenkin, John W. Roberts",
      "year": 2010,
      "role": "Precedent for iterative domain growth around verified regions",
      "relationship_sentence": "The proposed iterative domain expansion mechanism echoes LQR-Trees’ strategy of expanding verified basins by sampling near current boundaries and re‑verifying, adapted here to NN controller/Lyapunov co‑design."
    },
    {
      "title": "Safe Model-Based Reinforcement Learning with Stability Guarantees",
      "authors": "Felix Berkenkamp, Matteo Turchetta, Angela P. Schoellig, Andreas Krause",
      "year": 2017,
      "role": "Learning with Lyapunov-style stability and RoA considerations",
      "relationship_sentence": "By integrating learning with Lyapunov-based stability and safe expansion of certified regions, this work informs the paper’s joint synthesis of a policy and certificate and its data‑driven focus on stability boundaries."
    },
    {
      "title": "dReal: An SMT Solver for Nonlinear Theories over the Reals",
      "authors": "Sicun Gao, Soonho Kong, Edmund M. Clarke",
      "year": 2013,
      "role": "SMT-based verification backbone used in prior continuous-time NN control works",
      "relationship_sentence": "Many earlier NN controller synthesis/verification pipelines used dReal to certify Lyapunov decrease; the present paper explicitly avoids this SMT dependence by shifting to NN verifier–based certification."
    },
    {
      "title": "Reluplex: An Efficient SMT Solver for Verifying Deep Neural Networks",
      "authors": "Guy Katz, Clark Barrett, David L. Dill, Kyle Julian, Mykel J. Kochenderfer",
      "year": 2017,
      "role": "SMT-style neural network verification for piecewise-linear NNs",
      "relationship_sentence": "Reluplex exemplifies SMT-driven NN verification whose scalability limits motivate the paper’s move toward bound‑propagation verifiers when checking Lyapunov conditions over continuous-time dynamics."
    },
    {
      "title": "CROWN-IBP: Training Provably Robust Neural Networks with Faster Bound Propagation",
      "authors": "Huan Zhang, Tsui-Wei Weng, Pin-Yu Chen, Cho-Jui Hsieh, Luca Daniel",
      "year": 2019,
      "role": "Scalable bound-propagation verification underlying modern NN verifiers",
      "relationship_sentence": "The bound‑propagation techniques in CROWN‑IBP underpin the paper’s extension of state-of-the-art NN verifiers to certify Lyapunov decrease without SMT, enabling scalable continuous-time verification."
    }
  ],
  "synthesis_narrative": "The paper’s key contribution—two-stage learning that jointly synthesizes a stabilizing neural controller and a Lyapunov function with reduced conservatism—sits at the confluence of region-of-attraction theory, iterative certified expansion, and modern neural verification. Zubov’s classical characterization of the region of attraction provides the theoretical basis for treating the RoA boundary as a level set of a value-like function; this motivates the paper’s Zubov-inspired sampling that preferentially targets stability boundaries rather than relying on uniform or heuristic sampling. Giesl’s computational work on approximating Zubov-type Lyapunov functions demonstrates the feasibility of numerically capturing these boundary structures, informing the learnable surrogate used here.\n\nTo reduce conservatism and efficiently cover the RoA, the paper adopts an iterative domain expansion paradigm reminiscent of LQR-Trees: it grows the certified region by sampling near current boundaries and re-verifying, but now in the setting of neural controllers and learned Lyapunov certificates. Prior learning-based control with Lyapunov guarantees, exemplified by Berkenkamp et al., established how data-driven policies can be coupled with stability certificates and safe expansion, which this work extends to a joint NN policy–certificate training pipeline.\n\nFinally, the paper departs from earlier continuous-time neural control works that rely on SMT solvers like dReal and Reluplex to check Lyapunov conditions—approaches that often limit scalability. By leveraging bound-propagation neural verification methods (e.g., CROWN-IBP) and extending them to continuous-time Lyapunov decrease checks, the authors replace SMT with scalable NN verification, enabling practical training-time certification over expanding domains.",
  "analysis_timestamp": "2026-01-07T00:02:04.979844"
}