{
  "prior_works": [
    {
      "title": "Solving high-dimensional partial differential equations using deep learning",
      "authors": "Jiequn Han et al.",
      "year": 2017,
      "role": "Baseline",
      "relationship_sentence": "Introduces the Deep BSDE method that discretizes FBSDEs with Euler–Maruyama and trains via a one-step self-consistency loss; the present paper pinpoints the EM-induced discretization bias in this setup and replaces it with a Stratonovich formulation plus stochastic Heun integration."
    },
    {
      "title": "Deep backward schemes for high-dimensional nonlinear PDEs",
      "authors": "Christian Huré et al.",
      "year": 2020,
      "role": "Gap Identification",
      "relationship_sentence": "Proposes multi-step deep backward schemes to mitigate time-discretization errors, but still relies on EM-type Itô discretizations; the current work shows multi-step self-consistency losses do not remove the EM-induced bias, motivating a shift to a Stratonovich-based formulation with Heun integration."
    },
    {
      "title": "Adapted solution of a backward stochastic differential equation",
      "authors": "Étienne Pardoux et al.",
      "year": 1990,
      "role": "Foundation",
      "relationship_sentence": "Establishes the BSDE framework and its link to semilinear PDEs via the nonlinear Feynman–Kac formula, providing the theoretical foundation that the paper retains while altering the stochastic integral (Itô to Stratonovich) to eliminate discretization bias in learning."
    },
    {
      "title": "Numerical Solution of Stochastic Differential Equations",
      "authors": "Peter E. Kloeden et al.",
      "year": 1992,
      "role": "Foundation",
      "relationship_sentence": "Provides core numerical SDE theory comparing Itô and Stratonovich interpretations and orders of accuracy of schemes (including EM and Heun), directly underpinning the diagnosis of EM bias and the choice of a Stratonovich + stochastic Heun integrator."
    },
    {
      "title": "An Algorithmic Introduction to Numerical Simulation of Stochastic Differential Equations",
      "authors": "Desmond J. Higham",
      "year": 2001,
      "role": "Inspiration",
      "relationship_sentence": "Highlights how discretization choices (e.g., EM vs Heun, Itô vs Stratonovich) impact bias and accuracy, inspiring the paper’s central insight that the integration scheme used inside the one-step BSDE loss crucially shapes the optimization landscape."
    },
    {
      "title": "Physics-informed neural networks: A deep learning framework for solving forward and inverse problems involving nonlinear partial differential equations",
      "authors": "Maziar Raissi et al.",
      "year": 2019,
      "role": "Baseline",
      "relationship_sentence": "Serves as the primary alternative PDE-learning baseline that has empirically outperformed standard BSDE solvers; the present work’s integration-centric redesign is motivated in part by closing this performance gap with PINNs."
    },
    {
      "title": "High strong order explicit Runge–Kutta methods for stochastic differential equations",
      "authors": "Kevin Burrage et al.",
      "year": 1996,
      "role": "Extension",
      "relationship_sentence": "Develops stochastic Runge–Kutta methods (including the stochastic Heun scheme) for Stratonovich SDEs; the proposed solver directly adopts the stochastic Heun integrator to implement the Stratonovich BSDE formulation and remove EM bias."
    }
  ],
  "synthesis_narrative": "The paper’s core innovation—diagnosing and removing the discretization bias that arises when training BSDE-based PDE solvers with Euler–Maruyama inside a one-step self-consistency loss—sits squarely on the lineage of BSDE theory and numerical SDE analysis. Pardoux and Peng (1990) established BSDEs and their connection to semilinear PDEs, defining the probabilistic framework modern deep BSDE solvers exploit. Han et al. (2017) operationalized this with the Deep BSDE method, using Euler–Maruyama to discretize the forward–backward dynamics and a one-step loss, a design choice the present work identifies as the source of a systematic bias that skews the optimization landscape. Attempts to reduce discretization error via multi-step training, such as Huré, Pham, and Warin’s deep backward schemes (2020), still inherit the EM-induced shift, a limitation this paper explicitly targets. The remedy draws from classical numerical SDE insights: Kloeden and Platen (1992) and Higham (2001) clarify how Itô versus Stratonovich interpretations and integrator choice dictate bias/consistency, motivating the move to a Stratonovich BSDE paired with a higher-accuracy stochastic Heun step. Burrage and Burrage (1996) provide the concrete SRK machinery—of which Heun is a key instance—that the method adopts. Finally, because PINNs (Raissi et al., 2019) have often outperformed standard deep BSDE solvers, they serve as the performance baseline the integration-aware redesign aims to match or surpass, closing the gap by correcting the underlying numerical bias rather than adding orthogonal optimizations.",
  "analysis_timestamp": "2026-01-06T23:08:23.975036"
}