{
  "prior_works": [
    {
      "title": "Maximum Entropy Inverse Reinforcement Learning",
      "authors": "Brian D. Ziebart, Andrew Maas, J. Andrew Bagnell, Anind K. Dey",
      "year": 2008,
      "role": "Foundational IRL formalism",
      "relationship_sentence": "The paper builds on MaxEnt IRL’s principle of inferring latent drivers of behavior from action data, but shifts the latent target from rewards to attentional biases and clarifies how attention-aware inverse planning departs from standard reward inference."
    },
    {
      "title": "Action understanding as inverse planning",
      "authors": "Chris L. Baker, Joshua B. Tenenbaum, Rebecca R. Saxe",
      "year": 2009,
      "role": "Foundational theory of inverse planning for mental state inference",
      "relationship_sentence": "This work established the Bayesian inverse planning paradigm—inferring unobserved mental states from goal-directed actions—which the current paper extends by treating attentional biases as the latent mental state to be inferred."
    },
    {
      "title": "Learning the preferences of bounded agents",
      "authors": "Owain Evans, Andreas Stuhlmüller, Noah D. Goodman",
      "year": 2015,
      "role": "Methodology for inferring utilities under computational limitations",
      "relationship_sentence": "The idea of jointly modeling preferences and cognitive constraints directly informs the paper’s move to separate reward from attention-induced biases and to estimate those biases from behavioral traces."
    },
    {
      "title": "Implications of Rational Inattention",
      "authors": "Christopher A. Sims",
      "year": 2003,
      "role": "Conceptual foundation: attention as information-constrained decision-making",
      "relationship_sentence": "Rational inattention motivates formalizing attention as a limited information channel that shapes choice, providing the theoretical grounding for parameterizing and inferring attentional biases in inverse planning."
    },
    {
      "title": "Thermodynamics as a theory of decision-making with information-processing costs",
      "authors": "Pedro A. Ortega, Daniel A. Braun",
      "year": 2013,
      "role": "Information-theoretic bounded rationality in control",
      "relationship_sentence": "This framework links control policies to information-processing costs (yielding soft/entropy-regularized solutions), informing the paper’s modeling of attention as an information-cost shaping the action policy to be inverted."
    },
    {
      "title": "Visual fixations and the computation and comparison of value in simple choice",
      "authors": "Ian Krajbich, Carolyn Armel, Antonio Rangel",
      "year": 2010,
      "role": "Empirical/computational link between attention and choice",
      "relationship_sentence": "Demonstrating that gaze biases value comparison supports the paper’s premise that systematic attentional biases measurably alter actions and can thus be inferred from behavior."
    },
    {
      "title": "Theory of mind as inverse planning",
      "authors": "Julian Jara-Ettinger, Hyowon Gweon, Laura Schulz, Joshua B. Tenenbaum",
      "year": 2016,
      "role": "Extension of inverse planning to richer latent mental states",
      "relationship_sentence": "By formalizing belief–desire–utility inference as inverse planning, this work paves the way for treating attention as another latent cognitive variable to be estimated from observed actions in complex tasks like driving."
    }
  ],
  "synthesis_narrative": "The core contribution—attention-aware inverse planning—arises at the intersection of inverse planning/IRL and theories of bounded rationality and attention. Ziebart et al.’s MaxEnt IRL provided the canonical machinery for inferring latent determinants of behavior from demonstrations; Baker et al. reframed this as Bayesian inverse planning to infer mental states, establishing that goal-directed action can reveal hidden cognitive variables. Jara-Ettinger et al. expanded this view to richer theory-of-mind constructs, legitimizing inference over latent internal states beyond rewards. The present work adopts that lens but targets attention specifically.\n\nThe pivot to attention is theoretically grounded in rational inattention (Sims), which models attention as an information bottleneck shaping decisions, and in information-theoretic bounded rationality for control (Ortega & Braun), which links policy structure to information-processing costs. These perspectives motivate parameterizing attentional biases as latent, resource-limited filters that modulate perceived state features and, consequently, action choices. Evans et al. provide the methodological precedent for jointly accounting for preferences and cognitive limitations when inverting behavior, a key step in distinguishing reward from attention-induced deviations from classical optimality.\n\nEmpirically, the aDDM tradition (Krajbich et al.) demonstrates that where people look systematically biases choices, justifying the premise that attentional strategies leave identifiable signatures in behavior even without direct gaze measurements. Combining these streams, the paper formulates and solves an inverse problem that recovers attentional bias parameters—operationalized within deep RL forward models—from observed actions, thereby extending IRL from reward inference to inference over attention-shaped cognition in real-world driving.",
  "analysis_timestamp": "2026-01-07T00:21:32.242691"
}