{
  "prior_works": [
    {
      "title": "Deep Learning with Differential Privacy",
      "authors": "Martin Abadi et al.",
      "year": 2016,
      "role": "Baseline",
      "relationship_sentence": "Introduced DP-SGD with independent (Poisson) subsampling and the moments accountant; the present work upper-bounds the k-out-of-t random allocation scheme by the privacy guarantees of this Poisson-subsampled mechanism."
    },
    {
      "title": "Subsampled Rényi Differential Privacy and Analytical Moments Accountant",
      "authors": "Yu-Xiang Wang et al.",
      "year": 2019,
      "role": "Extension",
      "relationship_sentence": "Provides tight RDP-based accounting for Poisson subsampling that the paper directly leverages as the comparison upper bound and as a computationally efficient alternative to Monte Carlo estimation."
    },
    {
      "title": "Rényi Differential Privacy",
      "authors": "Ilya Mironov",
      "year": 2017,
      "role": "Foundation",
      "relationship_sentence": "Establishes the RDP framework used to derive, compose, and numerically estimate privacy guarantees, which underpins the theoretical and numerical analyses in this paper."
    },
    {
      "title": "Amplification by Shuffling: From Local to Central Differential Privacy",
      "authors": "Úlfar Erlingsson et al.",
      "year": 2019,
      "role": "Gap Identification",
      "relationship_sentence": "Earlier analyses of random allocation relied on shuffling-based amplification; this work identifies those bounds as overly conservative and replaces them with tighter comparisons to independent subsampling."
    },
    {
      "title": "Privacy Amplification by Iteration",
      "authors": "Vitaly Feldman et al.",
      "year": 2018,
      "role": "Inspiration",
      "relationship_sentence": "Showed how iterative application of subsampled mechanisms amplifies privacy, motivating the study of multi-step allocation schemes and their reduction to well-understood subsampling analyses."
    },
    {
      "title": "The Composition Theorem for Differential Privacy",
      "authors": "Peter Kairouz et al.",
      "year": 2015,
      "role": "Foundation",
      "relationship_sentence": "Provides optimal composition tools that are directly used in converting step-level guarantees into end-to-end guarantees and in the paper’s numerical accounting for t-step procedures."
    }
  ],
  "synthesis_narrative": "The paper’s core innovation is to give the first theoretical and numerically efficient privacy guarantees for random k-out-of-t allocation by reducing it to well-studied independent (Poisson) subsampling. This lineage starts with Abadi et al., who established Poisson-subsampled DP-SGD and its accounting—creating the baseline mechanism whose guarantees this work uses as an upper bound for the allocation scheme. Mironov’s Rényi Differential Privacy provides the analytic framework for tight comparison and composition across many steps, while Kairouz–Oh–Viswanath’s optimal composition results ground the conversion from step-wise to end-to-end guarantees and inform efficient numerical accounting. Wang–Balle–Kasiviswanathan’s Subsampled RDP gives sharp privacy bounds for Poisson subsampling and the Analytical Moments Accountant; these become the precise tools enabling the paper’s clean upper bound and scalable estimation without Monte Carlo. Prior analyses of random allocation leaned on shuffling-based amplification (Erlingsson et al.), which the authors identify as too conservative for this setting—explicitly motivating their tighter reduction to independent subsampling. Finally, Feldman et al.’s privacy amplification by iteration clarifies how iterative, selectively applied updates can strengthen privacy, conceptually informing the treatment of k active steps among t. Together, these works directly enable the paper’s main contribution: principled, tight, and computationally practical privacy guarantees for random allocation that replace ad hoc shuffling bounds and costly simulations.",
  "analysis_timestamp": "2026-01-06T23:08:23.969295"
}