{
  "prior_works": [
    {
      "title": "A Chaining Algorithm for Online Nonparametric Regression",
      "authors": "Pierre Gaillard et al.",
      "year": 2015,
      "role": "Baseline",
      "relationship_sentence": "Provides the adversarial online nonparametric regression framework and a multiscale chaining forecaster achieving optimal rates for Hölder/Lipschitz classes; our method replaces cover-based chaining with a wavelet dictionary, extends guarantees to general Besov B_{p q}^s, and removes the need to know the global smoothness while adding spatial adaptivity."
    },
    {
      "title": "Online Learning via Sequential Complexities",
      "authors": "Alexander Rakhlin et al.",
      "year": 2015,
      "role": "Foundation",
      "relationship_sentence": "Supplies the sequential covering/entropy machinery used to derive minimax upper and lower bounds in online convex prediction; we specialize this framework to Besov classes by plugging in Besov metric entropy to prove our optimal regret rates."
    },
    {
      "title": "Piecewise-Polynomial Approximations of Functions of the Classes W_p^α",
      "authors": "M. S. Birman et al.",
      "year": 1967,
      "role": "Foundation",
      "relationship_sentence": "Establishes sharp entropy/approximation results for Besov/Sobolev embeddings that we leverage to calibrate scale selection and to match minimax regret lower bounds over Besov balls."
    },
    {
      "title": "Wavelets and Operators",
      "authors": "Yves Meyer",
      "year": 1992,
      "role": "Foundation",
      "relationship_sentence": "Provides the wavelet characterization of Besov spaces (equivalence of Besov norms with weighted ℓ^p norms of wavelet coefficients), which directly enables our wavelet-based online estimator and its complexity control across scales."
    },
    {
      "title": "Ideal Spatial Adaptation by Wavelet Shrinkage",
      "authors": "David L. Donoho et al.",
      "year": 1994,
      "role": "Inspiration",
      "relationship_sentence": "Introduces spatially adaptive wavelet shrinkage achieving near-minimax estimation over Besov classes; we generalize this spatial adaptivity principle to the adversarial online setting by adapting resolution locally in space (and over time) to obtain refined, location-dependent regret."
    },
    {
      "title": "Using and Combining Specialists",
      "authors": "Yoav Freund et al.",
      "year": 1997,
      "role": "Extension",
      "relationship_sentence": "Provides the specialist/sleeping-experts aggregation mechanism that we adapt to activate only wavelet atoms whose spatial support contains the current input, enabling our locally adaptive, support-aware updates and regret accounting."
    }
  ],
  "synthesis_narrative": "The paper’s core innovation—an adaptive, wavelet-based online forecaster that achieves minimax regret over general Besov spaces and further adapts locally to spatially inhomogeneous smoothness—emerges at the intersection of online chaining methods, Besov complexity theory, and spatially adaptive wavelet estimation. Gaillard et al.’s chaining forecaster is the immediate baseline: it established multiscale online regression with optimal rates for Hölder/Lipschitz classes but required known global smoothness and offered no spatial adaptivity. Rakhlin and Sridharan’s sequential complexity framework provides the formal vehicle to prove minimax optimality, allowing the present work to translate metric entropies into sharp regret bounds in the adversarial setting. Those entropies and approximation properties come from classical Besov theory—Birman and Solomyak’s results on entropy/widths of Besov/Sobolev embeddings—thereby fixing the target rates our algorithm must meet. Meyer’s wavelet characterization of Besov spaces makes the algorithmic design possible: it lets the learner operate directly on wavelet coefficients with scale-dependent penalization that mirrors Besov norms. For local adaptivity, the authors draw conceptual inspiration from Donoho and Johnstone’s spatially adaptive wavelet shrinkage, transporting its core idea—resolution selection that varies with local regularity—into an online, adversarial, convex-loss regime. Finally, to realize space-local updates operationally, they extend the specialist/sleeping-experts machinery of Freund et al., instantiating specialists as localized wavelet atoms active only on their spatial supports. Together, these works directly shape the paper’s algorithmic architecture, its adaptation mechanisms, and its optimal regret analysis.",
  "analysis_timestamp": "2026-01-06T23:08:23.970217"
}