{
  "prior_works": [
    {
      "title": "Proportionally Fair Clustering",
      "authors": [
        "Chen et al."
      ],
      "year": 2019,
      "role": "Centroid-paradigm foundation for proportional fairness (core/FJR) in clustering",
      "relationship_sentence": "The present paper generalizes the centroid-based proportional fairness model and guarantees of Chen et al. by allowing each point’s loss to blend centroid distance with non-centroid (diameter) loss, recovering Chen et al. as a special case."
    },
    {
      "title": "Proportional Fairness in Non-Centroid Clustering",
      "authors": [
        "Caragiannis et al."
      ],
      "year": 2024,
      "role": "Non-centroid (diameter-based) paradigm for proportional fairness in clustering",
      "relationship_sentence": "The semi-centroid model unifies this non-centroid paradigm with the centroid paradigm, and the new constant-approximation to the core specializes to the NeurIPS’24 non-centroid results when the centroid component is suppressed."
    },
    {
      "title": "Justified Representation in Approval-Based Committee Voting",
      "authors": [
        "Haris Aziz",
        "Markus Brill",
        "Vincent Conitzer",
        "Edith Elkind",
        "Rupert Freeman",
        "Toby Walsh"
      ],
      "year": 2017,
      "role": "Origin of JR/EJR proportionality concepts in multiwinner voting that underpin FJR-style relaxations",
      "relationship_sentence": "The paper’s FJR notion and its group-demand reasoning trace back to JR/EJR principles from approval-based committee selection, providing the conceptual ladder from the core to relaxed proportional guarantees used in clustering."
    },
    {
      "title": "Fully Proportional Representation",
      "authors": [
        "Burt L. Monroe"
      ],
      "year": 1995,
      "role": "Assignment-based representation framework (Monroe rule) linking voters to representatives",
      "relationship_sentence": "The centroid component of semi-centroid clustering inherits the assignment-to-representatives viewpoint popularized by Monroe, grounding the interpretation of clusters with designated representatives under proportionality constraints."
    },
    {
      "title": "Approximation Algorithms for the Ordered k-Median Problem",
      "authors": [
        "Deeparnab Chakrabarty",
        "Chaitanya Swamy"
      ],
      "year": 2018,
      "role": "Algorithmic techniques interpolating between k-median and k-center objectives",
      "relationship_sentence": "By mixing centroid and diameter losses, the semi-centroid objective echoes ordered k-median interpolations; bounding mixed losses and transferring guarantees from the extremes inform the paper’s constant-factor approximation to the core."
    },
    {
      "title": "Clustering to Minimize the Maximum Intercluster Distance (the k-Center Problem)",
      "authors": [
        "Teofilo F. Gonzalez"
      ],
      "year": 1985,
      "role": "Classic constant-factor algorithm and analysis for max-distance (diameter) objectives",
      "relationship_sentence": "The non-centroid component relies on k-center–style max-distance control; classical 2-approximation insights for diametric objectives serve as technical building blocks when proving guarantees for the semi-centroid loss."
    }
  ],
  "synthesis_narrative": "Two largely separate lines of work crystallized proportional fairness in clustering: centroid-based models (k-median–like), where each point is assigned to a representative and pays its distance, and non-centroid models (k-center/diameter–like), where a point’s loss is its distance to the farthest point in its cluster. Chen et al. (ICML 2019) formalized proportional fairness for the centroid paradigm via core and FJR-style guarantees, while Caragiannis et al. (NeurIPS 2024) established analogous notions and algorithms for the non-centroid, diameter-based paradigm. The present paper’s key contribution is to unify these by introducing semi-centroid clustering, in which each point’s loss blends centroid and diameter components, and by delivering a polynomial-time constant-factor approximation to the core across this spectrum.\nConceptually, the centroid side inherits the assignment-to-representatives perspective from Monroe’s fully proportional representation, and its fairness relaxations build on JR/EJR principles from approval-based committee voting (Aziz et al. 2017), which motivate the FJR relaxation used in clustering. Technically, controlling a mixed loss calls for interpolation ideas reminiscent of ordered k-median (Chakrabarty–Swamy 2018), which bridges k-median and k-center. Classical k-center guarantees (Gonzalez 1985) support the diameter component of the analysis. By marrying the centroid and non-centroid traditions within one model and proof framework, the paper recovers prior guarantees at both extremes and extends proportional fairness—via core and FJR—to intermediate regimes and even heterogeneous metrics.",
  "analysis_timestamp": "2026-01-07T00:02:04.952428"
}