{
  "prior_works": [
    {
      "title": "Monte Carlo Tree Diffusion",
      "authors": "Hyeonseo Cho, Jaesik Yoon, Sungjin Ahn",
      "year": 2024,
      "role": "Immediate predecessor integrating diffusion models with MCTS for trajectory-level reasoning",
      "relationship_sentence": "C-MCTD directly generalizes MCTD’s trajectory-local tree search by lifting the search space from single trajectories to compositions of subplans, addressing MCTD’s horizon and locality limits."
    },
    {
      "title": "Diffuser: Diffusion Models for Sequential Decision Making",
      "authors": "Michael Janner, Yang Gao, Sergey Levine",
      "year": 2022,
      "role": "Generative backbone for trajectory modeling and guidance",
      "relationship_sentence": "C-MCTD’s use of diffusion-based trajectory proposals and denoising-guided rollouts builds on Diffuser’s formulation of planning as conditional trajectory generation."
    },
    {
      "title": "Bandit Based Monte-Carlo Planning (UCT)",
      "authors": "Levente Kocsis, Csaba Szepesvári",
      "year": 2006,
      "role": "Search foundation for exploration–exploitation in tree search",
      "relationship_sentence": "C-MCTD’s Online Composer relies on UCT-style selection to evaluate and expand nodes over plan compositions, transferring the exploration–exploitation tradeoff from trajectory trees to composition graphs."
    },
    {
      "title": "Parallelization of Monte-Carlo Tree Search",
      "authors": "Guillaume M. J.-B. Chaslot, Mark H. M. Winands, H. Jaap van den Herik",
      "year": 2008,
      "role": "Parallel/distributed MCTS methodology",
      "relationship_sentence": "C-MCTD’s Distributed Composer adapts established root/tree/leaf parallelization ideas to concurrently explore multiple starting points and composition branches."
    },
    {
      "title": "Fast Planning Through Planning Graph Analysis (GraphPlan)",
      "authors": "Avrim L. Blum, Merrick L. Furst",
      "year": 1997,
      "role": "Plan-graph representation and reuse for accelerated planning",
      "relationship_sentence": "C-MCTD’s Preplan Composer leverages cached plan graphs conceptually akin to GraphPlan’s planning graphs to prune search and quickly retrieve feasible subplan combinations."
    },
    {
      "title": "Probabilistic Roadmaps for Path Planning in High-Dimensional Configuration Spaces",
      "authors": "Lydia E. Kavraki, Petr Švestka, Jean-Claude Latombe, Mark H. Overmars",
      "year": 1996,
      "role": "Offline roadmap construction and reuse for fast online queries",
      "relationship_sentence": "The idea of precomputing and caching a reusable connectivity graph in C-MCTD’s Preplan Composer parallels PRM’s offline roadmap that accelerates subsequent planning queries."
    },
    {
      "title": "Go-Explore: A New Approach for Hard-Exploration Problems",
      "authors": "Adrien Ecoffet, Joost Huizinga, Joel Lehman, Kenneth O. Stanley, Jeff Clune",
      "year": 2021,
      "role": "Archive-based multi-start exploration",
      "relationship_sentence": "C-MCTD’s Distributed/Preplan Composers echo Go-Explore’s principle of maintaining and revisiting an archive of promising states to launch parallel explorations and compose long-horizon solutions."
    }
  ],
  "synthesis_narrative": "C-MCTD’s core contribution—elevating diffusion-guided planning from local trajectory optimization to globally aware plan composition—builds directly on three intertwined lines of prior work. First, it extends Monte Carlo Tree Diffusion (MCTD) by addressing the horizon and locality limits of trajectory-level search: rather than exploring within a single rollout, C-MCTD constructs and searches over compositions of subplans. This extension retains diffusion-based trajectory generation from Diffuser, using conditional denoising to propose and refine segments while enabling combinatorial recomposition. Second, C-MCTD’s Online Composer relies on UCT to evaluate and expand nodes across a composition graph, transferring classical exploration–exploitation principles from trajectory trees to higher-level compositional structures. To manage search complexity, the Distributed Composer draws from the parallel MCTS literature, distributing rollouts across multiple starting points and branches for broader, deeper coverage. Third, the Preplan Composer accelerates inference through cached plan graphs, combining GraphPlan’s planning-graph abstraction (for pruning and reuse) with the PRM idea of precomputing reusable connectivity that can be rapidly queried at test time. Finally, the design of an archive of promising subplans and parallel exploration seeds resonates with Go-Explore’s multi-start strategy, ensuring robust long-horizon discovery. Together, these influences enable globally coherent, extendable planning that composes and reuses subplans efficiently while preserving the strengths of diffusion-guided search.",
  "analysis_timestamp": "2026-01-06T23:42:48.159243"
}