{
  "prior_works": [
    {
      "title": "A Linear Non-Gaussian Acyclic Model for Causal Discovery",
      "authors": "Shimizu et al.",
      "year": 2006,
      "role": "Foundation",
      "relationship_sentence": "Established LiNGAM and the ICA-based identifiability up to scaling and permutation, which our work leverages to view observational ambiguity as a permutation (assignment) problem that we then characterize combinatorially."
    },
    {
      "title": "Discovering Cyclic Causal Models by Independent Components Analysis",
      "authors": "Lacerda et al.",
      "year": 2008,
      "role": "Foundation",
      "relationship_sentence": "Extended LiNGAM to models with cycles and showed that observational ICA identifies only up to permutation in the cyclic case; our paper builds directly on this by formalizing the resulting equivalence classes as perfect matchings."
    },
    {
      "title": "On the number of experiments sufficient and in the worst case necessary to identify all causal relations among n variables",
      "authors": "Eberhardt et al.",
      "year": 2005,
      "role": "Foundation",
      "relationship_sentence": "Introduced the experiment-design perspective for orienting causal structure via atomic interventions; we adopt this elimination viewpoint but apply it to the permutation-equivalence induced by linear non-Gaussian cyclic models."
    },
    {
      "title": "Two optimal intervention problems for causal discovery",
      "authors": "Hauser et al.",
      "year": 2014,
      "role": "Related Problem",
      "relationship_sentence": "Formulated optimization objectives to shrink Markov equivalence classes in DAGs under interventions; our work mirrors this setup by defining an elimination reward over permutation-equivalence classes in cyclic LiNG models."
    },
    {
      "title": "Cost-Optimal Learning of Causal Graphs",
      "authors": "Kocaoglu et al.",
      "year": 2017,
      "role": "Extension",
      "relationship_sentence": "Showed (adaptive) submodularity-style elimination objectives enable near-optimal greedy intervention policies for DAGs; we transfer and extend this technique by proving adaptive submodularity for eliminating incompatible matchings in our setting."
    },
    {
      "title": "Budgeted Experiment Design for Causal Structure Learning",
      "authors": "Ghassami et al.",
      "year": 2018,
      "role": "Baseline",
      "relationship_sentence": "Proposed greedy, budget-aware intervention design to reduce DAG Markov equivalence; our method improves on this baseline by handling linear non-Gaussian cyclic models and operating over permutation-equivalence classes rather than CPDAGs."
    },
    {
      "title": "Adaptive Submodularity: Theory and Applications in Active Learning and Stochastic Optimization",
      "authors": "Golovin et al.",
      "year": 2011,
      "role": "Foundation",
      "relationship_sentence": "Provided the adaptive submodularity framework and greedy near-optimality guarantees that we invoke to analyze our adaptive stochastic optimization objective over equivalence classes."
    }
  ],
  "synthesis_narrative": "The core of this paper fuses the identifiability mechanisms of linear non-Gaussian SEMs with the modern theory of adaptive experiment design. The LiNGAM formulation (Shimizu et al., 2006) established that ICA recovers the mixing matrix only up to scaling and permutation. Lacerda et al. (2008) carried this to cyclic models, making explicit that in the presence of instantaneous feedback, observational data pin down structure only up to a permutation ambiguity. Our work takes the next step by recasting that permutation ambiguity as a combinatorial object: a perfect matching between error components and variables, which yields a tractable representation of the permutation-equivalence class.\n\nOn the experimental design side, Eberhardt et al. (2005) and Hauser and Bühlmann (2014) framed interventions as actions that eliminate incompatible causal graphs within an equivalence class, formulating optimization problems over such eliminations. Kocaoglu et al. (2017) then demonstrated that elimination-type rewards for orienting DAGs exhibit (adaptive) submodularity, enabling provably near-optimal greedy policies under budget constraints; Ghassami et al. (2018) operationalized closely related greedy designs for budgeted structure learning. Building directly on these ideas, we define a natural elimination reward over the permutation-equivalence classes induced by cyclic LiNG models and prove adaptive submodularity using the framework of Golovin and Krause (2011). This yields a near-optimal greedy strategy in our new matching-based state space, while each atomic intervention reveals one edge of the true matching and prunes incompatible structures. Together, these works directly shaped our matching characterization and the adaptive greedy design with guarantees.",
  "analysis_timestamp": "2026-01-06T23:08:23.935157"
}