{
  "prior_works": [
    {
      "title": "Pansharpening by Convolutional Neural Networks",
      "authors": "Masi et al.",
      "year": 2016,
      "role": "Foundation",
      "relationship_sentence": "Established the end-to-end CNN formulation for pan-sharpening that Pan-LUT keeps conceptually (learned spectral–spatial fusion) while replacing heavy convolutional inference with LUT-based inference."
    },
    {
      "title": "PanNet: A Deep Network Architecture for Pan-Sharpening",
      "authors": "Yang et al.",
      "year": 2017,
      "role": "Baseline",
      "relationship_sentence": "A widely adopted deep baseline using PAN-driven detail injection; Pan-LUT targets PanNet-level quality while explicitly addressing PanNet’s inference cost and memory footprint on large images via LUT-based computation."
    },
    {
      "title": "A Detail Injection-based Deep Convolutional Neural Network for Pansharpening (DiCNN)",
      "authors": "Zhang et al.",
      "year": 2019,
      "role": "Inspiration",
      "relationship_sentence": "DiCNN formalized pan-sharpening as spectral mapping plus PAN detail injection; Pan-LUT mirrors this decomposition with PGLUT for channel-wise spectral mapping and SDLUT for spatial detail injection, but realizes both with learnable LUTs."
    },
    {
      "title": "Deep Bilateral Learning for Real-Time Image Enhancement",
      "authors": "Chen et al.",
      "year": 2016,
      "role": "Inspiration",
      "relationship_sentence": "Introduced guidance-indexed local transformations via a learned guidance map and grid; Pan-LUT’s PAN-guided look-up table (PGLUT) adopts this guidance-conditioned lookup idea, using the PAN signal to control per-channel spectral mapping."
    },
    {
      "title": "Learning Image-adaptive 3D Lookup Tables for Real-Time Image Enhancement",
      "authors": "Zeng et al.",
      "year": 2020,
      "role": "Extension",
      "relationship_sentence": "Demonstrated that image enhancement can be modeled with learnable 3D LUTs and interpolation; Pan-LUT extends this LUT learning paradigm to multi-spectral–PAN fusion, designing LUTs specialized for spectral mapping and spatial detail extraction."
    },
    {
      "title": "Real-Time Image Super-Resolution via Lookup Tables (SR-LUT)",
      "authors": "Jo et al.",
      "year": 2021,
      "role": "Related Problem",
      "relationship_sentence": "Showed patch-based LUT indexing to capture local spatial patterns for efficient restoration; Pan-LUT’s SDLUT adopts a similar local-neighborhood LUT mechanism to encode fine-grained spatial details from the PAN image."
    },
    {
      "title": "A Critical Comparison Among Pansharpening Methods",
      "authors": "Vivone et al.",
      "year": 2015,
      "role": "Foundation",
      "relationship_sentence": "Provided the canonical taxonomy (CS/MRA/detail-injection) and evaluation criteria for pan-sharpening; Pan-LUT positions itself within detail-injection-style fusion while redefining the computational primitive via LUTs."
    }
  ],
  "synthesis_narrative": "Pan-LUT’s core idea—decomposing pan-sharpening into spectral mapping and spatial detail injection while executing both via learnable LUTs—stands on two converging lines of prior work. From pan-sharpening itself, Masi et al. pioneered the deep learning formulation, and PanNet became a dominant baseline using PAN-driven detail injection. DiCNN sharpened the conceptual split: perform channel-wise spectral mapping and inject PAN details. Pan-LUT directly adopts this decomposition but replaces cost-heavy convolutions with LUT primitives to unlock extreme efficiency on very large images. From the efficient image enhancement/restoration side, Chen et al.’s deep bilateral learning showed that a guidance signal can index into a parametric grid to drive local transformations; Pan-LUT’s PGLUT similarly uses the PAN image as a guidance axis to control channel-wise spectral mapping. Zeng et al. demonstrated that learnable 3D LUTs, coupled with interpolation, can model complex color transforms in real time—Pan-LUT extends this LUT learning paradigm to multi-spectral–PAN fusion. Complementing that, SR-LUT showed how local patch-based LUT indexing captures spatial structure efficiently, echoing Pan-LUT’s SDLUT for PAN detail extraction. Framed within Vivone et al.’s taxonomy and metrics, Pan-LUT thus emerges by fusing detail-injection pan-sharpening principles with modern learnable LUT mechanisms to deliver strong accuracy with drastically reduced inference cost.",
  "analysis_timestamp": "2026-01-06T23:08:23.973187"
}