{
  "prior_works": [
    {
      "title": "Modeling polypharmacy side effects with graph convolutional networks (Decagon)",
      "authors": "Marinka Zitnik, Monica Agrawal, Jure Leskovec",
      "year": 2018,
      "role": "Foundational MRL (2D, multi-relational link prediction)",
      "relationship_sentence": "Decagon established molecular relational learning as multi-relational link prediction over drug–drug pairs using primarily 2D/topological features, directly motivating 3DMRL’s push to inject missing 3D interaction geometry into relational models."
    },
    {
      "title": "Better informed distance geometry: Using experimental torsion-angle preferences improves conformation generation (ETKDG)",
      "authors": "Sereina Riniker, Gregory A. Landrum",
      "year": 2015,
      "role": "Fast 3D conformer generation without QM",
      "relationship_sentence": "ETKDG demonstrated that reliable 3D molecular conformers can be generated cheaply at scale, underpinning 3DMRL’s strategy to create a virtual 3D environment without expensive quantum mechanical calculations."
    },
    {
      "title": "SchNet: A continuous-filter convolutional neural network for modeling quantum interactions",
      "authors": "Kristof T. Schütt, Farhad Arbabzadah, Stefan Chmiela, Klaus-Robert Müller, Alexandre Tkatchenko",
      "year": 2017,
      "role": "3D geometric message passing for molecules",
      "relationship_sentence": "SchNet showed that explicitly modeling 3D coordinates and local geometric fields markedly improves molecular predictions, informing 3DMRL’s aim to distill global and local 3D interaction cues into downstream relational models."
    },
    {
      "title": "E(n) Equivariant Graph Neural Networks (EGNN)",
      "authors": "Victor Garcia Satorras, Emiel Hoogeboom, Max Welling",
      "year": 2021,
      "role": "SE(n)-equivariant encoders for 3D geometry",
      "relationship_sentence": "EGNN provided a principled way to learn from 3D coordinates with Euclidean equivariance, guiding 3DMRL’s design of geometry-aware supervision signals that capture rigid-motion–consistent local/global interaction patterns."
    },
    {
      "title": "3D-Infomax improves GNNs for molecular property prediction",
      "authors": "Hannes Stärk, Octavian-Eugen Ganea, Lagnajit Pattanaik, Regina Barzilay, Tommi Jaakkola",
      "year": 2022,
      "role": "Cross-modal 2D–3D self-supervised pretraining",
      "relationship_sentence": "3D-Infomax demonstrated that a 2D GNN can be pretrained to absorb 3D geometric knowledge via self-supervision on inexpensive conformers, directly inspiring 3DMRL’s pretraining that transfers 3D interaction geometry into 2D relational models."
    },
    {
      "title": "EquiBind: Geometric deep learning for drug binding structure prediction",
      "authors": "Hannes Stärk, Octavian-Eugen Ganea, Regina Barzilay, Tommi Jaakkola",
      "year": 2022,
      "role": "Fast prediction of protein–ligand interaction poses",
      "relationship_sentence": "EquiBind’s ability to rapidly produce plausible protein–ligand poses suggests a practical route to synthesize large-scale 3D interaction geometries, a core ingredient of 3DMRL’s virtual interaction environment."
    },
    {
      "title": "DiffDock: Diffusion steps, twists, and turns for molecular docking",
      "authors": "Gabriele Corso, Hannes Stärk, Bowen Jing, Regina Barzilay, Tommi Jaakkola",
      "year": 2023,
      "role": "Generative docking for scalable 3D interaction geometry",
      "relationship_sentence": "DiffDock’s diffusion-based docking offers robust, uncertainty-aware generation of interaction poses at scale, directly enabling 3DMRL to curate diverse, low-cost 3D supervisory signals for relational pretraining."
    }
  ],
  "synthesis_narrative": "3DMRL tackles a central gap in molecular relational learning: existing multi-relational predictors (e.g., Decagon) rely largely on 2D topology even though true interaction behavior is governed by 3D geometry. Two strands of prior work bridge this gap. First, 3D molecular GNNs such as SchNet and EGNN establish that modeling local and global geometric structure—and doing so with Euclidean equivariance—yields powerful representations. Second, cross-modal pretraining like 3D-Infomax shows a pragmatic recipe for transferring 3D knowledge into 2D encoders using inexpensive conformers, avoiding costly quantum labels. To operationalize 3D supervision specifically for interactions, fast geometry generators are essential. ETKDG supplies scalable single-molecule conformers, while modern docking methods—EquiBind and DiffDock—extend this idea to molecular pairs, producing plausible protein–ligand (or more general) interaction poses without QM calculations. Together, these works provide the blueprint for 3DMRL: construct a virtual 3D interaction environment using efficient conformer/docking generators; encode geometry with principles from equivariant learning; and pretrain a 2D relational model to internalize global and local 3D interaction cues. This combination directly enables 3DMRL to deliver 3D-aware MRL without prohibitive simulation costs and explains its strong out-of-distribution and extrapolation performance across real-world tasks.",
  "analysis_timestamp": "2026-01-07T00:02:04.969617"
}