{
  "prior_works": [
    {
      "title": "Sparse Additive Models",
      "authors": "Pradeep Ravikumar, John Lafferty, Han Liu, Larry Wasserman",
      "year": 2010,
      "role": "Foundational model and estimation framework for SpAM",
      "relationship_sentence": "Established the SpAM framework and group-sparsity regularization for component functions, providing the canonical modeling and estimation setup that this paper analyzes for selection optimality and against which it highlights the estimation–selection gap."
    },
    {
      "title": "Minimax-Optimal Rates for High-Dimensional Sparse Additive Models",
      "authors": "Marten Raskutti, Martin J. Wainwright, Bin Yu",
      "year": 2012,
      "role": "Benchmark minimax estimation rates in SpAM",
      "relationship_sentence": "Derived minimax-optimal estimation rates for sparse additive models over smoothness classes, furnishing the estimation benchmarks that this paper contrasts with minimax separation rates for selection and uses to articulate the estimation–selection gap."
    },
    {
      "title": "Variable Selection in Nonparametric Additive Models",
      "authors": "Jian Huang, Joel L. Horowitz, Fengrong Wei",
      "year": 2010,
      "role": "Selection methodology and sparsistency for additive models",
      "relationship_sentence": "Proved variable selection consistency for penalized methods in additive models, directly motivating the need to characterize fundamental separation boundaries for selecting nonzero component functions beyond algorithm-specific guarantees."
    },
    {
      "title": "Nonparametric Goodness-of-Fit Testing Under Gaussian Models",
      "authors": "Yu. I. Ingster, I. A. Suslina",
      "year": 2003,
      "role": "Minimax testing theory and adaptation to smoothness",
      "relationship_sentence": "Provided the general theory of minimax separation rates and the adaptation penalty for nonparametric testing over smoothness classes, which this paper extends to the componentwise selection problem in SpAM, including adaptation to unknown smoothness."
    },
    {
      "title": "Higher Criticism for Detecting Sparse Heterogeneous Mixtures",
      "authors": "David Donoho, Jiashun Jin",
      "year": 2004,
      "role": "Sparse detection paradigm and separation boundaries",
      "relationship_sentence": "Introduced phase diagrams and optimal detection boundaries under rare/weak signals, informing this paper’s sparse multiple-testing perspective and its derivation of separation rates under sparsity for selecting active additive components."
    },
    {
      "title": "Oracle and Adaptive Compound Decision Rules for False Discovery Rate Control",
      "authors": "Wei Sun, T. Tony Cai",
      "year": 2007,
      "role": "FDR/FNR trade-off and optimal multiple testing",
      "relationship_sentence": "Developed a decision-theoretic view that jointly considers FDR and false nondiscovery, underpinning this paper’s criterion of controlling FDR+FNR and guiding the construction and optimality analysis of adaptive selection procedures."
    },
    {
      "title": "Sharp Thresholds for High-Dimensional and Noisy Sparsity Recovery Using ℓ1-Constrained Quadratic Programming (Lasso)",
      "authors": "Martin J. Wainwright",
      "year": 2009,
      "role": "Support recovery thresholds and error-probability control",
      "relationship_sentence": "Characterized exact-support recovery phase transitions via error-probability control, providing the conceptual template for this paper’s support-recovery perspective (wrong-recovery probability) and the notion of separation boundaries for exact selection."
    }
  ],
  "synthesis_narrative": "The paper’s core contribution—deriving minimax separation rates for univariate function selection in sparse additive models (SpAM), with guarantees under both FDR+FNR control and exact support recovery, and studying adaptation to unknown smoothness—sits at the intersection of SpAM estimation theory, nonparametric minimax testing, and sparse multiple testing. Ravikumar et al. (2010) introduced the SpAM framework and group-sparse estimation, while Raskutti, Wainwright, and Yu (2012) established minimax-optimal estimation rates over smoothness classes. These works provide the estimation benchmarks that this paper contrasts with, crystallizing the estimation–selection gap: estimation-optimal procedures need not be selection-optimal. On the selection side, Huang, Horowitz, and Wei (2010) analyzed sparsistency of penalized additive-model selectors, motivating the need for model-agnostic, information-theoretic selection boundaries.\nMinimax testing theory from Ingster and Suslina (2003) supplies the backbone for separation rates and the consequences of adaptation to unknown smoothness, which the present work tailors to the per-component testing problem inherent in SpAM. Donoho and Jin (2004) contribute the sparse-signal detection paradigm and phase-diagram intuition that inform the paper’s sparse multiple-testing view. The decision-theoretic treatment of multiple testing by Sun and Cai (2007) directly underlies the paper’s FDR+FNR criterion and the design of adaptive procedures with risk control. Finally, Wainwright (2009) provides the support-recovery, error-probability framework and sharp thresholds that the paper extends to nonparametric additive settings, yielding exact support recovery separation rates. Together, these works directly shape the paper’s rate characterizations, adaptive procedure design, and the formal articulation of the estimation–selection gap in SpAM.",
  "analysis_timestamp": "2026-01-07T00:21:32.270523"
}