{
  "prior_works": [
    {
      "title": "The Algorithmic Foundations of Differential Privacy",
      "authors": "Cynthia Dwork; Aaron Roth",
      "year": 2014,
      "role": "Foundational theory (DP, composition, group privacy)",
      "relationship_sentence": "The paper’s treatment of users contributing up to k items relies on group privacy and composition principles from this monograph to calibrate privacy parameters and reason about per-user sensitivity in the multi-contribution setting."
    },
    {
      "title": "Calibrating Noise to Sensitivity in Private Data Analysis",
      "authors": "Cynthia Dwork; Frank McSherry; Kobbi Nissim; Adam Smith",
      "year": 2006,
      "role": "Mechanistic building blocks (Laplace mechanism; sensitivity)",
      "relationship_sentence": "Algorithms that report a subset of the union hinge on count/histogram queries and thresholding with noise calibrated to sensitivity; the Laplace mechanism and sensitivity framework enable the paper’s utility-guaranteed subset selection."
    },
    {
      "title": "Mechanism Design via Differential Privacy (Exponential Mechanism)",
      "authors": "Frank McSherry; Kunal Talwar",
      "year": 2007,
      "role": "Selection under DP",
      "relationship_sentence": "Selecting which items to include in the reported union under a dataset-dependent utility aligns with the exponential mechanism’s DP selection paradigm, informing how to balance inclusion of infrequent items against privacy."
    },
    {
      "title": "Fingerprinting Codes and the Price of Approximate Differential Privacy",
      "authors": "Mark Bun; Jonathan Ullman; Salil Vadhan",
      "year": 2014,
      "role": "Lower-bound techniques for DP release",
      "relationship_sentence": "The paper’s impossibility/utility-ratio lower bounds leverage fingerprinting/packing-style arguments developed in this work to show limits on privately recovering many rare items."
    },
    {
      "title": "RAPPOR: Randomized Aggregatable Privacy-Preserving Ordinal Response",
      "authors": "Úlfar Erlingsson; Vasyl Pihur; Aleksandra Korolova",
      "year": 2014,
      "role": "Practical LDP for set-union–like string discovery; multi-contribution motivation",
      "relationship_sentence": "RAPPOR highlighted the challenge of privately discovering unique strings when users contribute multiple items and rare items abound, motivating subset-reporting and normalized utility notions used here."
    },
    {
      "title": "Local Privacy and Statistical Minimax Rates",
      "authors": "Raef Bassily; Adam Smith",
      "year": 2015,
      "role": "Theory of frequency estimation/heavy hitters under DP",
      "relationship_sentence": "PSU reduces to identifying item support from noisy frequencies; minimax bounds and techniques for frequency estimation/heavy hitters from this work inform both algorithm design and accuracy limits in the union-recovery task."
    },
    {
      "title": "Distributed Differential Privacy via Shuffling",
      "authors": "Albert Cheu; Adam Smith; Jonathan Ullman; David Zeber",
      "year": 2019,
      "role": "Shuffle-model aggregation with multi-message users",
      "relationship_sentence": "Prior PSU and frequency-aggregation protocols in the shuffle model (rooted in this line) exposed how multiple user contributions interact with privacy and accuracy, providing conceptual and technical precedents for multi-contribution analysis even in the central model considered here."
    }
  ],
  "synthesis_narrative": "The core innovation of this paper is to solve private set union when each user may contribute up to k items, and to evaluate algorithms via a dataset-normalized utility ratio with matching upper and lower bounds. This builds on three pillars. First, foundational DP principles—sensitivity, composition, and group privacy—codified by Dwork–Roth and Dwork–McSherry–Nissim–Smith, underwrite the per-user accounting needed when multiple items come from the same individual. They also justify thresholding and noise calibration for histogram-style queries that power subset-of-union reporting. Second, classical DP selection tools, especially the exponential mechanism, map naturally onto deciding which items to include under a dataset-specific utility, shaping mechanisms that favor reliably present items while controlling privacy loss. Third, lower-bound methodology from fingerprinting-code–based arguments (Bun–Ullman–Vadhan) provides the template to prove that no algorithm can privately recover too many low-frequency items, enabling tight utility-ratio impossibility results.\nOn the applied/algorithmic side, prior art on discovering strings and heavy hitters under privacy—RAPPOR and minimax analyses for locally private frequency estimation—clarified the operational tradeoffs between suppressing rare items and maximizing discovery, directly motivating the paper’s normalized utility criterion. Finally, work on the shuffle model for multi-message contributions (e.g., Cheu–Smith–Ullman–Zeber) established how aggregating multiple user reports affects privacy/accuracy, a perspective this paper adapts to the central model to design and analyze algorithms with worst-case utility-ratio guarantees across datasets.",
  "analysis_timestamp": "2026-01-07T00:21:32.226030"
}