{
  "prior_works": [
    {
      "title": "Conditional Logit Analysis of Qualitative Choice Behavior",
      "authors": "Daniel McFadden",
      "year": 1973,
      "role": "Foundational random-utility and discrete choice framework",
      "relationship_sentence": "ATHENA’s group-level symbolic utility discovery is grounded in McFadden’s random utility model, but replaces pre-specified functional forms with LLM-guided symbolic search."
    },
    {
      "title": "Discrete Choice Analysis: Theory and Application to Travel Demand",
      "authors": "Moshe Ben-Akiva, Steven R. Lerman",
      "year": 1985,
      "role": "Canonical utility specification and application in travel mode choice",
      "relationship_sentence": "ATHENA adopts classic attribute-driven utility design (e.g., time, cost, constraints) from Ben-Akiva and Lerman to shape the search space and priors for its symbolic utility models."
    },
    {
      "title": "Discrete Choice Methods with Simulation",
      "authors": "Kenneth E. Train",
      "year": 2009,
      "role": "Heterogeneity and mixed logit estimation for individual differences",
      "relationship_sentence": "ATHENA’s individual-level semantic adaptation generalizes Train’s treatment of preference heterogeneity from numeric random coefficients to personalized semantic templates aligned with a learned group utility."
    },
    {
      "title": "Prospect Theory: An Analysis of Decision under Risk",
      "authors": "Daniel Kahneman, Amos Tversky",
      "year": 1979,
      "role": "Demonstrated systematic deviations from expected utility due to framing and context",
      "relationship_sentence": "The inclusion of linguistic preferences and constraints in ATHENA is motivated by Prospect Theory’s evidence that context and framing shape individual choices beyond purely numeric utilities."
    },
    {
      "title": "AI Feynman: A physics-inspired method for symbolic regression",
      "authors": "Silviu-Marian Udrescu, Max Tegmark",
      "year": 2020,
      "role": "Symbolic discovery of interpretable equations from data",
      "relationship_sentence": "ATHENA extends symbolic regression ideas from AI Feynman by using LLM reasoning to discover interpretable, economically meaningful utility specifications rather than purely algebraic expressions."
    },
    {
      "title": "Chain-of-Thought Prompting Elicits Reasoning in Large Language Models",
      "authors": "Jason Wei et al.",
      "year": 2022,
      "role": "Eliciting step-by-step textual reasoning in LLMs",
      "relationship_sentence": "ATHENA leverages chain-of-thought to decompose and justify both symbolic utility discovery and the construction of personalized semantic templates for individual decisions."
    },
    {
      "title": "ReAct: Synergizing Reasoning and Acting in Language Models",
      "authors": "Shunyu Yao et al.",
      "year": 2022,
      "role": "Interleaving LLM reasoning with tool use and feedback",
      "relationship_sentence": "ATHENA’s LLM-augmented discovery loop follows ReAct’s paradigm, orchestrating reasoning traces with calls to optimization/symbolic tools to iteratively refine utility forms."
    }
  ],
  "synthesis_narrative": "ATHENA’s core contribution—an adaptive textual-symbolic framework that first discovers robust group-level utility functions and then performs individual-level semantic adaptation—sits at the intersection of classic discrete choice theory, symbolic regression, and LLM-enabled reasoning. McFadden’s random utility model established the statistical backbone for modeling choice as utility maximization, while Ben-Akiva and Lerman operationalized attribute-driven specifications in domains like travel mode choice, informing ATHENA’s economically grounded search space. Train’s treatment of preference heterogeneity via mixed logit motivates ATHENA’s second stage: transitioning from a population utility to individual-level adjustment, but advancing from numeric random coefficients to personalized semantic templates that capture idiosyncratic constraints and preferences.\nProspect Theory underscores that framing and context systematically shape decisions, justifying ATHENA’s inclusion of linguistic information as first-class signals rather than noise. On the modeling front, AI Feynman shows how symbolic regression can yield interpretable functional forms; ATHENA extends this by constraining the search toward utility-theoretic structures and guiding it with language-based priors. Finally, advances in LLM reasoning—Chain-of-Thought for faithful stepwise inference and ReAct for interleaving reasoning with tool use—enable ATHENA to textualize the discovery process and to iteratively call optimization or symbolic tools, producing interpretable group utilities and individualized semantic adaptations. Together, these strands directly coalesce into ATHENA’s two-stage, human-centric decision modeling approach validated on travel mode and vaccine uptake tasks.",
  "analysis_timestamp": "2026-01-07T00:29:42.057233"
}