{
  "prior_works": [
    {
      "title": "Comparator-Adaptive Φ-Regret",
      "authors": "Lu et al.",
      "year": 2025,
      "role": "Immediate predecessor establishing comparator-adaptive Φ-regret via sparsity measures",
      "relationship_sentence": "The present paper directly improves upon Lu et al. (2025) by achieving strictly better comparator-adaptive Φ-regret bounds and far simpler algorithms, replacing Lu et al.’s sparsity-based machinery with a prior-based approach over binary transformations."
    },
    {
      "title": "Kernelized Hedge",
      "authors": "Gabriele Farina et al.",
      "year": 2022,
      "role": "Algorithmic building block for efficiently handling exponentially many comparators",
      "relationship_sentence": "One of the paper’s concrete algorithms is constructed by combining multiple copies of the kernelized Hedge algorithm of Farina et al. (2022), enabling efficient aggregation over a vast family of binary transformations."
    },
    {
      "title": "Prediction, Learning, and Games",
      "authors": "Nicolò Cesa-Bianchi, Gábor Lugosi",
      "year": 2006,
      "role": "Foundational source for Hedge with priors and prior-dependent regret",
      "relationship_sentence": "The key idea of assigning a prior over comparators and obtaining regret that scales with the prior mass traces to the exponential-weights framework in this book, which the paper generalizes from experts to transformation comparators."
    },
    {
      "title": "From External to Internal Regret: Learning in Games with Transfer",
      "authors": "Avrim Blum, Yishay Mansour",
      "year": 2007,
      "role": "Core framework connecting action-transformations to internal/swap regret",
      "relationship_sentence": "The paper’s Φ-regret setting and its specialization to internal/swap regret build on Blum–Mansour’s transfer-mapping viewpoint, which formalizes comparator transformations central to this work."
    },
    {
      "title": "Internal Regret in Online Portfolio Selection",
      "authors": "Gilles Stoltz, Gábor Lugosi",
      "year": 2005,
      "role": "Seminal algorithms and analysis for internal/swap and generalized transformation regret",
      "relationship_sentence": "This work underpins the Φ-regret framework and efficient reductions from transformation-based regret to implementable learning rules, informing the design and analysis in the present paper."
    },
    {
      "title": "A Simple Adaptive Procedure Leading to Correlated Equilibrium",
      "authors": "Sergiu Hart, Andreu Mas-Colell",
      "year": 2000,
      "role": "Motivating application link between (swap/Φ-)regret and game-theoretic equilibria",
      "relationship_sentence": "By showing that vanishing swap regret implies convergence to correlated equilibria, this work motivates the paper’s applications to games using improved Φ-regret guarantees."
    }
  ],
  "synthesis_narrative": "The paper advances the general Φ-regret paradigm, where performance is measured against action-transformations, by delivering improved comparator-adaptive bounds with simpler algorithms. Its immediate antecedent is Lu et al. (2025), which introduced comparator-adaptivity via a sparsity-based complexity of the transformation; the present work replaces that machinery with a principled prior over binary transformations, yielding tighter, prior-dependent guarantees and cleaner algorithms. This prior-centric move is rooted in the exponential-weights literature (Cesa-Bianchi and Lugosi, 2006), where initializing Hedge with nonuniform priors leads to regret scaling with the comparator’s prior mass; the authors lift this idea from experts to transformation comparators, identifying a specific prior that suffices for binary mappings.\n\nThe transformation viewpoint itself traces to classical internal/swap regret frameworks (Blum and Mansour, 2007; Stoltz and Lugosi, 2005), which formalized competing against mappings of actions and provided reductions and algorithms that the current work generalizes and unifies under Φ-regret. To make the approach computationally viable over exponentially many transformations, the paper leverages kernelized Hedge (Farina et al., 2022), combining multiple copies to efficiently implement the prior-weighted aggregation over binary transformations. Finally, the game-theoretic significance (Hart and Mas-Colell, 2000) underlies the applications: improved and simpler Φ-regret algorithms directly strengthen convergence guarantees to correlated (and related) equilibria. Together, these threads—comparator adaptivity, prior-based Hedge, transformation regret, and kernelized efficiency—culminate in sharper bounds and streamlined methods for Φ-regret and its game-theoretic applications.",
  "analysis_timestamp": "2026-01-07T00:02:04.978217"
}