{
  "prior_works": [
    {
      "title": "Submodular functions and convexity",
      "authors": "László Lovász",
      "year": 1983,
      "role": "Foundational theory (geometry of submodularity)",
      "relationship_sentence": "Established the Lovász extension and the base polyhedron, providing the convex-analytic framework that underlies the minimum-norm-point (MNP) viewpoint used to relate ratio objectives to submodular minimization."
    },
    {
      "title": "Submodular Functions and Optimization (2nd ed.)",
      "authors": "Satoru Fujishige",
      "year": 2005,
      "role": "Foundational theory and key equivalences (SFM ↔ MNP; parametric minimization/principal partitions)",
      "relationship_sentence": "Gives the classic equivalence between submodular function minimization and finding the MNP over the base polyhedron, and develops parametric minimization of f(S)−λ|S|, both of which the paper leverages to show strong-polynomial reductions among USSS/UDSS/DSS/SFM/MNP."
    },
    {
      "title": "Finding the nearest point in a polytope",
      "authors": "Philip Wolfe",
      "year": 1976,
      "role": "Algorithmic tool (MNP algorithm)",
      "relationship_sentence": "Provides the MNP algorithmic machinery that, via Fujishige’s connection to SFM, enables the paper’s MNP-based perspective and algorithmic cross-over between geometric and combinatorial formulations."
    },
    {
      "title": "A combinatorial, strongly polynomial-time algorithm for minimizing submodular functions",
      "authors": "Satoru Iwata, Lisa Fleischer, Satoru Fujishige",
      "year": 2001,
      "role": "Complexity-theoretic foundation (strongly polynomial SFM)",
      "relationship_sentence": "Establishes strongly polynomial-time solvability of SFM, a cornerstone that the paper uses to argue strongly polynomial reductions and equivalences among the ratio problems and MNP."
    },
    {
      "title": "A combinatorial algorithm minimizing submodular functions in strongly polynomial time",
      "authors": "Alexander Schrijver",
      "year": 2000,
      "role": "Complexity-theoretic foundation (alternative strongly polynomial SFM)",
      "relationship_sentence": "Provides an independent strongly polynomial SFM approach, reinforcing the paper’s claim that algorithms for SFM (and thus MNP) can be repurposed for the proposed ratio problems."
    },
    {
      "title": "Finding a maximum density subgraph",
      "authors": "Andrew V. Goldberg",
      "year": 1984,
      "role": "Prototype ratio problem and parametric reduction",
      "relationship_sentence": "Introduces the densest subgraph objective |E(S)|/|S| and solves it via parametric reductions, directly motivating the paper’s treatment of f(S)/|S| through parametric forms f(S)−λ|S| and its generalization beyond graphs."
    },
    {
      "title": "On Nonlinear Fractional Programming",
      "authors": "W. Dinkelbach",
      "year": 1967,
      "role": "Fractional programming principle (ratio-to-difference transform)",
      "relationship_sentence": "Supplies the general technique that converts ratio objectives to parametric difference problems, underpinning the paper’s reductions from USSS/UDSS to families of SFM/MNP instances."
    }
  ],
  "synthesis_narrative": "The paper’s core contribution—showing strongly polynomial equivalences between optimizing the average value f(S)/|S| for submodular/supermodular functions and classical submodular function minimization (SFM) via the minimum-norm-point (MNP) perspective—rests on two pillars: fractional-to-parametric reductions for ratio problems and the convex-analytic geometry of submodularity. On the ratio side, Dinkelbach’s fractional programming framework formalized the conversion of max/min of ratios to solving parametric families of difference objectives. Goldberg’s densest subgraph result embodied this idea for |E(S)|/|S| via parametric reductions, seeding the general viewpoint that optimizing f(S)/|S| can be addressed by solving instances of f(S) − λ|S|. On the submodular side, Lovász’s convexity and base polyhedron laid the geometric foundation, while Fujishige’s monograph crystallized the deep equivalence between SFM and finding the MNP over the base polyhedron and developed parametric minimization/principal partitions for f(S) − λ|S|. Wolfe’s MNP algorithm provided a concrete computational vehicle for the geometric viewpoint. Finally, the strongly polynomial algorithms of Schrijver and of Iwata–Fleischer–Fujishige established the algorithmic robustness of SFM, enabling the paper’s claim of strongly polynomial-time reductions and cross-over among USSS, UDSS, DSS, SFM, and MNP. Together, these works directly inform the paper’s unifying perspective: ratio optimization for sub/supermodular functions can be systematically and efficiently handled through the MNP/SFM machinery, even in the unrestricted (non-monotone, possibly negative) regime.",
  "analysis_timestamp": "2026-01-07T00:05:12.515647"
}