{
  "prior_works": [
    {
      "title": "Explainable k-Means and k-Medians Clustering",
      "authors": "Sanjoy Dasgupta et al.",
      "year": 2020,
      "role": "Foundation",
      "relationship_sentence": "This paper introduced the explainable clustering formulation via axis-aligned threshold decision trees and provided the first approximation guarantees for p=1 (k-medians) and p=2 (k-means), establishing the structural lemmas and analysis template that the present work generalizes to all ℓ_p norms and improves for p=2."
    },
    {
      "title": "Classification and Regression Trees",
      "authors": "Leo Breiman et al.",
      "year": 1984,
      "role": "Foundation",
      "relationship_sentence": "CART established the threshold decision-tree framework that underpins the interpretability model adopted by explainable clustering, providing the core hypothesis class (axis-aligned threshold trees) that this paper algorithmically optimizes for k-medians under general ℓ_p."
    },
    {
      "title": "Random Projection Trees and Low Dimensional Manifolds",
      "authors": "Sanjoy Dasgupta et al.",
      "year": 2008,
      "role": "Inspiration",
      "relationship_sentence": "This work pioneered recursive tree partitions for geometric data with cost/diameter control across levels, an approach that directly inspired the recursive splitting and potential-function style analyses used in explainable clustering trees and extended here to handle general ℓ_p tradeoffs."
    },
    {
      "title": "A Space-Partitioning Tree Structure for Nonparametric Estimation in High Dimensions (k-d trees)",
      "authors": "Jon Louis Bentley",
      "year": 1975,
      "role": "Inspiration",
      "relationship_sentence": "Bentley’s k-d trees introduced axis-aligned recursive partitioning, the structural primitive that explainable clustering formalizes and that this paper leverages to design and analyze split sequences that achieve ℓ_p-sensitive approximation factors."
    },
    {
      "title": "Probabilistic Approximation of Metric Spaces and its Algorithmic Applications",
      "authors": "Yair Bartal",
      "year": 1996,
      "role": "Related Problem",
      "relationship_sentence": "Bartal’s tree-metric approximations informed the use of hierarchical trees to control clustering costs across scales; the present work echoes this perspective by calibrating depth/scale tradeoffs to obtain log k–type guarantees that interpolate between ℓ_1 and ℓ_2."
    },
    {
      "title": "A Tight Bound on Approximating Arbitrary Metrics by Tree Metrics",
      "authors": "Jittat Fakcharoenphol et al.",
      "year": 2004,
      "role": "Related Problem",
      "relationship_sentence": "FRT’s analysis of hierarchical tree decompositions with logarithmic distortion influenced the multi-scale, log k–dependent analyses of decision-tree partitions that the explainable clustering literature (and this paper) adapt to bound k-medians cost under structural constraints."
    }
  ],
  "synthesis_narrative": "The central lineage of this paper begins with Dasgupta, Frost, Moshkovitz, and Rashtchian (2020), who formulated explainable clustering as optimizing k-medians/k-means under the constraint that assignments are realized by axis-aligned threshold decision trees. They provided structural and algorithmic results for p=1 and p=2, establishing both the interpretability model and the baseline guarantees—O(log k)–type behavior for k-medians and a weaker polylogarithmic bound for k-means—that left open how to handle general ℓ_p and whether the p=2 exponent could be improved. The roots of the interpretability class itself trace to CART (Breiman et al., 1984), which formalized threshold decision trees, and to Bentley’s k-d trees (1975), which introduced axis-aligned recursive partitioning of Euclidean space. Methodologically, recursive geometric partitions with cost control across levels—central to explainable clustering analyses—were influenced by random projection and partition trees (Dasgupta–Freund, 2008). Finally, the multi-scale reasoning that yields logarithmic factors through hierarchical trees connects to Bartal’s tree-metric approximations and the FRT bound, which provided a paradigm for analyzing hierarchical decompositions with logarithmic distortion. Building directly on the explainable-clustering framework and its p=1/p=2 analyses, the present paper generalizes the structural/algorithmic approach to all finite p≥1 and sharpens the p=2 exponent, yielding an Õ(p·(log k)^{1+1/p−1/p^2}) approximation and thereby filling the explicit gap left by prior work.",
  "analysis_timestamp": "2026-01-06T23:08:23.947937"
}