{
  "prior_works": [
    {
      "title": "The K-armed Dueling Bandits Problem",
      "authors": "Yisong Yue et al.",
      "year": 2012,
      "role": "Foundation",
      "relationship_sentence": "This paper formalized the dueling bandits setting and regret notion with pairwise preference feedback that the current work adopts verbatim before introducing evaluator bias."
    },
    {
      "title": "Relative Upper Confidence Bound for the K-armed Dueling Bandit Problem",
      "authors": "Hédi Zoghi et al.",
      "year": 2014,
      "role": "Baseline",
      "relationship_sentence": "RUCB is a standard high-performing algorithm under unbiased preferences; the proposed bias-sensitive algorithm directly modifies the UCB-style estimation/confidence machinery to remain valid under known evaluator bias."
    },
    {
      "title": "The Copeland Dueling Bandit Problem",
      "authors": "Hédi Zoghi et al.",
      "year": 2015,
      "role": "Gap Identification",
      "relationship_sentence": "This work develops regret guarantees for identifying Copeland winners under unbiased comparisons, and its explicit unbiasedness assumption is a limitation the present paper addresses by handling systematically biased evaluators."
    },
    {
      "title": "Unbiased Learning-to-Rank with Counterfactual Inference",
      "authors": "Thorsten Joachims et al.",
      "year": 2017,
      "role": "Inspiration",
      "relationship_sentence": "Introduces inverse-propensity-based debiasing for biased user feedback; the new unbiased arm-performance estimator is the dueling-bandit analogue that corrects pairwise feedback using known evaluator-bias parameters."
    },
    {
      "title": "Corrupt Bandits",
      "authors": "Thodoris Lykouris et al.",
      "year": 2018,
      "role": "Related Problem",
      "relationship_sentence": "Models and analyzes bandits with corrupted feedback and regret dependence on corruption; this motivates bias-aware exploration and informs the paper’s regret characterization showing how favorable or opposing bias can reduce regret."
    },
    {
      "title": "Maximum Likelihood Estimation of Observer Error-Rates Using the EM Algorithm",
      "authors": "A. P. Dawid et al.",
      "year": 1979,
      "role": "Inspiration",
      "relationship_sentence": "Provides the classic evaluator-bias/confusion-matrix framework; the paper’s unbiased estimator leverages the same principle of correcting observations using known evaluator-specific bias to recover unbiased performance signals."
    }
  ],
  "synthesis_narrative": "The core innovation in “Tackling Biased Evaluators in Dueling Bandits” is an unbiased arm-performance estimator and a bias-sensitive exploration algorithm that operate when evaluator bias is known, with regret analysis quantifying how bias that aligns with or opposes ground truth can actually reduce regret. This advances the foundational dueling bandits framework of Yue et al. (2012), which defined the pairwise-feedback setting and regret notion that the new work retains. The algorithmic backbone clearly extends UCB-style methods typified by RUCB (Zoghi et al., 2014) and subsequent Copeland-oriented approaches (Zoghi et al., 2015), but removes their core limitation: the assumption of unbiased feedback. The estimator itself draws direct methodological inspiration from counterfactual debiasing in learning-to-rank (Joachims et al., 2017), translating inverse-propensity correction to the dueling-feedback context using evaluator-specific bias parameters to construct unbiased estimates of arm quality. Conceptually, the paper is also informed by the corrupt bandits literature (Lykouris et al., 2018), which shows how feedback corruption shapes regret; here, a parallel insight is established for systematic evaluator bias, including the counterintuitive benefit of strongly aligned or opposed bias. Finally, the statistical foundation for correcting known evaluator effects traces back to Dawid–Skene (1979), whose confusion-matrix modeling underpins the idea that, given known bias, one can invert the bias to recover unbiased signals. Together, these works directly shape the problem formulation, identify the key gap (unbiasedness), and provide the estimation and analysis principles that the paper extends to biased dueling feedback.",
  "analysis_timestamp": "2026-01-06T23:08:23.969739"
}