{
  "prior_works": [
    {
      "title": "Optimal Rates for the Regularized Least-Squares Algorithm",
      "authors": "Alessandro Caponnetto, Ernesto De Vito",
      "year": 2007,
      "role": "Operator-framework and optimal-rate baseline for KRR/RLS",
      "relationship_sentence": "This seminal paper established minimax-optimal excess risk rates for kernel ridge regression via the integral operator approach under bounded/subgaussian-type noise and eigenvalue decay, providing the benchmark rates that the present work shows persist under heavy-tailed noise."
    },
    {
      "title": "Learning Theory Estimates via Integral Operators",
      "authors": "Steve Smale, Ding-Xuan Zhou",
      "year": 2007,
      "role": "Foundational integral-operator machinery",
      "relationship_sentence": "It developed the operator-theoretic excess-risk decomposition (covariance/effective-dimension, source conditions) that the current paper adopts and extends by plugging in heavy-tail concentration to control sample errors."
    },
    {
      "title": "Minimax-optimal rates for nonparametric regression under random design",
      "authors": "Garvesh Raskutti, Martin J. Wainwright, Bin Yu",
      "year": 2012,
      "role": "Minimax lower bounds under eigenvalue/capacity conditions",
      "relationship_sentence": "Their lower bounds for random-design regression (including RKHS classes characterized by eigenvalue decay) are used conceptually to certify that the subgaussian-dominated rates achieved here under heavy-tailed noise are minimax optimal."
    },
    {
      "title": "Probability inequalities for sums of independent random variables",
      "authors": "D. K. Fuk, S. V. Nagaev",
      "year": 1971,
      "role": "Core heavy-tail concentration tool",
      "relationship_sentence": "The Fuk–Nagaev inequality under finite moments is the probabilistic backbone that enables the paper’s subgaussian-plus-polynomial excess-risk bounds without subexponential tail assumptions."
    },
    {
      "title": "Optimum bounds for the distributions of martingales in Banach spaces",
      "authors": "I. Pinelis",
      "year": 1994,
      "role": "Hilbert/Banach-space extension enabling vector-valued concentration",
      "relationship_sentence": "This work provides Banach/Hilbert-space probabilistic bounds that facilitate applying Fuk–Nagaev-type inequalities to RKHS-valued sums and operators in the paper’s analysis."
    },
    {
      "title": "Robust linear least squares regression",
      "authors": "Jean-Yves Audibert, Olivier Catoni",
      "year": 2011,
      "role": "Heavy-tailed regression motivation and contrast",
      "relationship_sentence": "By showing that robust losses attain subgaussian-style guarantees under only finite moments, this paper set the heavy-tailed benchmark that the current work matches asymptotically using plain ridge regression through new concentration arguments."
    },
    {
      "title": "Empirical Risk Minimization for Heavy-Tailed Losses",
      "authors": "Christian Brownlees, Emilien Joly, Gábor Lugosi",
      "year": 2015,
      "role": "Robust ERM under heavy tails as prior state of the art",
      "relationship_sentence": "Their median-of-means/robust-ERM framework motivated the belief that heavy tails necessitate robustification; the present paper demonstrates that standard RKHS ridge regression already achieves minimax rates under finite higher moments."
    }
  ],
  "synthesis_narrative": "The paper’s core contribution—proving that RKHS ridge regression achieves minimax-optimal excess risk rates even with heavy-tailed noise having only finitely many moments—rests on two intertwined threads of prior work. First, the integral-operator framework of Smale and Zhou and the optimal-rate analysis of Caponnetto and De Vito established the standard decomposition (approximation plus sample error), effective dimension via kernel eigenvalue decay, and the benchmark minimax rates for regularized least squares under subgaussian/subexponential-type assumptions. Complementing these upper bounds, minimax lower bounds for random-design regression tied to spectral decay, as in Raskutti, Wainwright, and Yu, calibrate optimality under typical RKHS capacity conditions. Second, heavy-tailed concentration is enabled by probabilistic tools: the Fuk–Nagaev inequality provides sharp deviation control with only finite moments, and Pinelis’s Banach/Hilbert-space bounds permit deploying such inequalities to Hilbert-space-valued sums and operator deviations that arise in RKHS analysis. Together, these allow the authors to derive excess risk bounds with a dominant subgaussian term and a secondary polynomial term, showing that the heavy tails do not worsen asymptotic rates. This directly challenges the robust-learning literature—exemplified by Audibert and Catoni, and Brownlees, Joly, and Lugosi—which typically modifies the loss or estimator to cope with heavy tails. The present paper instead shows that unmodified ridge regression in RKHS already achieves the optimal rates, thereby refining our understanding of the noise assumptions truly required for optimal kernel regression.",
  "analysis_timestamp": "2026-01-07T00:05:12.527987"
}