{
  "prior_works": [
    {
      "title": "LoRA: Low-Rank Adaptation of Large Language Models",
      "authors": "Edward J. Hu et al.",
      "year": 2022,
      "role": "Baseline",
      "relationship_sentence": "Provides the parameter-efficient low‑rank update mechanism that this paper reparameterizes on a hyperbolic manifold, serving as the primary baseline the proposed hyperbolic fine‑tuning improves upon."
    },
    {
      "title": "Poincaré Embeddings for Learning Hierarchical Representations",
      "authors": "Maximilian Nickel et al.",
      "year": 2017,
      "role": "Foundation",
      "relationship_sentence": "Established hyperbolic geometry as a natural representation space for hierarchical and power‑law structured data, directly motivating the paper’s choice to place token embeddings in hyperbolic space."
    },
    {
      "title": "Hyperbolic Neural Networks",
      "authors": "Octavian Ganea et al.",
      "year": 2018,
      "role": "Gap Identification",
      "relationship_sentence": "Introduced exp/log maps and gyrovector operations for learning on hyperbolic manifolds but presupposed hyperbolic parameters throughout; the present work explicitly addresses the unmet need of fine‑tuning when pretrained LLM weights remain Euclidean and naïve exp/log mappings fail."
    },
    {
      "title": "Poincaré GloVe: Hyperbolic Word Embeddings",
      "authors": "Adrian Tifrea et al.",
      "year": 2019,
      "role": "Inspiration",
      "relationship_sentence": "Showed that word embeddings in hyperbolic space capture lexical hierarchies with radial positions correlating with frequency, directly inspiring the paper’s empirical finding of token hyperbolicity and frequency–radius structure in LLM embeddings."
    },
    {
      "title": "Learning Continuous Hierarchies in the Lorentz Model of Hyperbolic Geometry",
      "authors": "Maximilian Nickel et al.",
      "year": 2018,
      "role": "Extension",
      "relationship_sentence": "Provided a numerically stable Lorentz-model parameterization and mappings that the paper extends conceptually to design manifold-aware updates compatible with Euclidean weight matrices during hyperbolic fine‑tuning."
    },
    {
      "title": "Hyperbolic Graph Convolutional Neural Networks",
      "authors": "Ines Chami et al.",
      "year": 2019,
      "role": "Related Problem",
      "relationship_sentence": "Demonstrated practical recipes for projecting between Euclidean inputs and hyperbolic representations in deep networks, informing this work’s boundary handling between Euclidean LLM parameters and hyperbolic adaptation."
    },
    {
      "title": "Riemannian Adaptive Optimization Methods",
      "authors": "Mickaël Bécigneul et al.",
      "year": 2019,
      "role": "Extension",
      "relationship_sentence": "Supplied Riemannian Adam-style optimizers for manifold-valued parameters, which underpin the paper’s stable optimization of hyperbolic fine‑tuning updates."
    }
  ],
  "synthesis_narrative": "This work’s core idea—parameter‑efficiently fine‑tuning LLMs in hyperbolic space while base embeddings and weights remain Euclidean—emerges from two converging lines of prior research. First, hyperbolic representation learning established both the motivation and the mathematical tools. Poincaré Embeddings (Nickel & Kiela, 2017) showed that hyperbolic geometry naturally models hierarchical, power‑law phenomena, directly motivating the authors’ analysis of token frequency and latent tree structure. Poincaré GloVe (Tifrea et al., 2019) brought that insight to words, linking radial position with frequency and hierarchy, which inspired the paper’s empirical observations on LLM token embeddings. Methodologically, Hyperbolic Neural Networks (Ganea et al., 2018) and the Lorentz model (Nickel et al., 2018) provided exp/log maps, gyrovector operations, and numerically stable parameterizations; however, these methods largely assume hyperbolic parameters throughout, leaving a gap when interfacing with pretrained Euclidean LLMs. Hyperbolic GCNs (Chami et al., 2019) further informed practical projection between Euclidean features and hyperbolic layers, shaping the boundary design needed here. Second, parameter‑efficient fine‑tuning in LLMs provided the operational template: LoRA (Hu et al., 2022) is the baseline update mechanism the authors reparameterize on a hyperbolic manifold to retain efficiency while exploiting non‑Euclidean structure. Finally, Riemannian adaptive optimizers (Bécigneul & Ganea, 2019) enable stable training on curved spaces. Together, these works directly lead to the paper’s key contribution: a manifold‑aware, low‑rank hyperbolic fine‑tuning scheme that resolves the incompatibility of naïve exp/log mappings with Euclidean pretrained weights.",
  "analysis_timestamp": "2026-01-06T23:08:23.951647"
}