{
  "prior_works": [
    {
      "title": "Restless bandits: Activity allocation in a changing world",
      "authors": "Peter Whittle",
      "year": 1988,
      "role": "Foundational RMAB formulation and Lagrangian relaxation",
      "relationship_sentence": "The paper’s SP-based policy builds on Whittle’s Lagrangian decoupling of multi-project RMABs, providing the structural relaxation that enables per-arm stochastic approximations and tractable large-N analysis."
    },
    {
      "title": "Restless Bandits, Linear Programming Relaxations, and a Near-Optimal Policy",
      "authors": "Dimitris Bertsimas, José Niño-Mora",
      "year": 2000,
      "role": "LP-relaxation and fluid-approximation based control for RMABs",
      "relationship_sentence": "This work established LP-based (fluid) relaxations and policies for RMABs that the present paper explicitly improves upon by incorporating variance via a Gaussian approximation to overcome degeneracy-driven 1/√N gaps."
    },
    {
      "title": "On an index policy for restless bandits",
      "authors": "Robert G. Weber, Gideon Weiss",
      "year": 1990,
      "role": "Asymptotic analysis for many-arm RMABs and mean-field style decoupling",
      "relationship_sentence": "Weber–Weiss’s large-system viewpoint motivates the homogeneous, large-N regime and the idea that asymptotically derived policies can be near-optimal, a premise extended here from fluid to Gaussian approximations."
    },
    {
      "title": "Limit theorems for density dependent Markov chains",
      "authors": "Thomas G. Kurtz",
      "year": 1976,
      "role": "Fluid (LLN) and diffusion (CLT) approximations for large stochastic systems",
      "relationship_sentence": "Kurtz’s LLN/CLT framework directly underpins the paper’s replacement of fluid limits with a Gaussian system capturing both mean and variance of the RMAB occupancy dynamics."
    },
    {
      "title": "Brownian Motion and Stochastic Flow Systems",
      "authors": "J. Michael Harrison",
      "year": 1985,
      "role": "Brownian/diffusion models and control (Brownian control problems)",
      "relationship_sentence": "Harrison’s diffusion-control paradigm informs the paper’s key step of optimizing a Gaussian (diffusion) surrogate to synthesize implementable policies with tighter ˜O(1/N) gaps."
    },
    {
      "title": "Stochastic Programming",
      "authors": "András Prékopa",
      "year": 1995,
      "role": "Foundations of stochastic programming, especially with Gaussian uncertainty",
      "relationship_sentence": "The paper’s stochastic-programming formulation over a Gaussian system leverages classic tractability and reformulations from Prékopa’s framework for chance constraints and moment-based Gaussian programs."
    },
    {
      "title": "A mean field approach for optimization in Markov decision processes with large populations",
      "authors": "Nicolas Gast, Bruno Gaujal",
      "year": 2012,
      "role": "Mean-field control for large-population MDPs",
      "relationship_sentence": "Mean-field MDP methods by Gast–Gaujal provide the fluid-control baseline and uniqueness-style assumptions that the paper refines by adding variance-aware (Gaussian) corrections to handle degeneracy."
    }
  ],
  "synthesis_narrative": "The paper’s core advance—achieving a ˜O(1/N) optimality gap for degenerate homogeneous RMABs—sits at the intersection of RMAB relaxations and diffusion-based stochastic control. Whittle’s formulation of restless bandits and Lagrangian decoupling supplies the structural backbone enabling tractable per-arm analysis. Building on this, LP-based relaxations and fluid policies from Bertsimas and Niño-Mora established a powerful baseline that performs excellently under non-degeneracy, yet can stall at Θ(1/√N) gaps when degeneracies arise. The large-population, asymptotic perspective of Weber and Weiss motivates the homogeneous, many-arm setting where approximation-driven policies can be provably near-optimal.\n\nMethodologically, the paper’s decisive step is to move beyond the fluid (LLN) approximation to a Gaussian (CLT/diffusion) approximation. Kurtz’s limit theorems justify modeling occupancy fluctuations around the fluid trajectory as Gaussian, while Harrison’s Brownian control program suggests that optimizing a diffusion surrogate can yield implementable policies with sharper performance guarantees. To operationalize this, the authors formulate and solve a stochastic program defined on the Gaussian system; Prékopa’s stochastic programming foundations—particularly for Gaussian uncertainties—inform tractable reformulations and solution strategies. Finally, mean-field control insights from Gast and Gaujal clarify when fluid solutions are unique and how variance-aware corrections can systematically repair fluid-level degeneracies. Together, these strands directly enable the paper’s SP-based Gaussian policy and its improved ˜O(1/N) gap in regimes where LP/fluid methods are insufficient.",
  "analysis_timestamp": "2026-01-07T00:27:38.139915"
}