{
  "prior_works": [
    {
      "title": "Communication-Efficient Learning of Deep Networks from Decentralized Data (FedAvg)",
      "authors": "H. Brendan McMahan, Eider Moore, Daniel Ramage, Seth Hampson, Blaise Agüera y Arcas",
      "year": 2017,
      "role": "Foundational federated learning algorithm and training paradigm",
      "relationship_sentence": "HYPERION is instantiated within the standard FL pipeline established by FedAvg, but replaces purely Euclidean updates with hyperspherical representations and alignment/purification steps tailored to graph data and noisy labels."
    },
    {
      "title": "SphereFace: Deep Hypersphere Embedding for Face Recognition",
      "authors": "Weiyang Liu, Yandong Wen, Zhiding Yu, Meng Yang",
      "year": 2017,
      "role": "Introduced unit-norm embeddings and angular-margin losses on a hypersphere",
      "relationship_sentence": "The client-side fine-grained hypersphere alignment in HYPERION builds on the insight from SphereFace that normalized, angular geometry yields tighter intra-class compactness and clearer inter-class separation."
    },
    {
      "title": "ArcFace: Additive Angular Margin Loss for Deep Face Recognition",
      "authors": "Jiankang Deng, Jia Guo, Niannan Xue, Stefanos Zafeiriou",
      "year": 2019,
      "role": "Refined angular-margin classification to enforce discriminative hyperspherical geometry",
      "relationship_sentence": "HYPERION’s alignment objective leverages ArcFace-style angular constraints to regulate edge-mediated error propagation and capture intra-class topological nuances through precise angle-based separation."
    },
    {
      "title": "Prototypical Networks for Few-shot Learning",
      "authors": "Jake Snell, Kevin Swersky, Richard S. Zemel",
      "year": 2017,
      "role": "Established class prototypes as geometric anchors in embedding space",
      "relationship_sentence": "HYPERION’s unified hyperspherical space and class-aware alignment/purification are inspired by prototype-centric reasoning, using spherical class anchors to guide consistent cross-client graph representations."
    },
    {
      "title": "MOON: Model-Contrastive Federated Learning",
      "authors": "Qinbin Li, Bingsheng He, Dawn Song",
      "year": 2021,
      "role": "Introduced cosine-based representation alignment to mitigate client drift in FL",
      "relationship_sentence": "HYPERION extends MOON’s cosine/angle-based alignment principle by performing fine-grained hyperspherical alignment of graph embeddings, explicitly addressing topology-driven intra-class variation under label noise."
    },
    {
      "title": "Robust Aggregation for Federated Learning via Median and Geometric Median",
      "authors": "Venkatakrishna Pillutla, Sham Kakade, Zaid Harchaoui",
      "year": 2019,
      "role": "Pioneered geometry-aware robust server aggregation against corrupted updates",
      "relationship_sentence": "HYPERION’s geometric-aware hyperspherical purification module parallels the idea of robust geometric aggregation, adapting it to spherical manifolds and class-conditional representations to filter label-induced noise."
    },
    {
      "title": "Co-teaching: Robust Training of Deep Neural Networks with Extremely Noisy Labels",
      "authors": "Bo Han, Quanming Yao, Xingrui Yu, Gang Niu, Miao Xu, Weihua Hu, Ivor W. Tsang, Masashi Sugiyama",
      "year": 2018,
      "role": "Canonical noisy-label learning via mutual sample selection and purification",
      "relationship_sentence": "HYPERION provides a geometric alternative to sample/label purification by detecting and suppressing noise through angular inconsistency on the hypersphere, an idea conceptually related to Co-teaching’s purification but realized via manifold geometry and federation."
    }
  ],
  "synthesis_narrative": "HYPERION’s core idea—a unified hyperspherical space enabling fine-grained alignment on clients and geometric purification on the server—sits at the intersection of angular metric learning and federated alignment/robustness. SphereFace and ArcFace established that constraining representations to the unit sphere with angular-margin losses delivers robust intra-class compactness and inter-class separation. HYPERION transposes these principles from images to graph embeddings, exploiting angular geometry to modulate edge-mediated message passing and to parse intra-class topological diversity. Prototypical Networks further contributed the notion of class-centric geometric anchors; HYPERION leverages prototype-like anchors on the hypersphere to coordinate class-wise alignment across heterogeneous clients.\n\nWithin federated learning, FedAvg provides the training substrate, while MOON’s cosine-based representation alignment motivates HYPERION’s angle-aware, client-side objectives that resist client drift in non-iid graph settings. At the server, robust aggregation via geometric median (Pillutla et al.) informs HYPERION’s geometric-aware purification: instead of aggregating raw parameters, it filters noisy contributions in a manifold-aware way by operating on normalized, class-conditional spherical embeddings. Finally, Co-teaching’s success in noisy-label regimes shaped HYPERION’s philosophy of selective purification; yet, HYPERION operationalizes purification through angular consistency tests and hyperspherical statistics rather than small-loss heuristics. Together, these works directly inspire HYPERION’s fine-grained hypersphere alignment to curb error propagation on graphs and its hyperspherical purification to mitigate undetected label noise, yielding a robust federated graph learning framework.",
  "analysis_timestamp": "2026-01-07T00:21:32.307462"
}