{
  "prior_works": [
    {
      "title": "The Franz–Parisi Criterion for Computational Barriers in Statistical Inference",
      "authors": "Afonso S. Bandeira et al.",
      "year": 2022,
      "role": "Immediate precursor",
      "relationship_sentence": "Introduced the FP criterion (via an annealed Franz–Parisi potential) and proved its equivalence to low-degree polynomial (LDP) lower bounds for Gaussian additive models, providing the baseline that this paper refines and extends to SQ."
    },
    {
      "title": "Recipes for Metastable States in Spin Glasses",
      "authors": "Silvio Franz; Giorgio Parisi",
      "year": 1995,
      "role": "Foundational concept",
      "relationship_sentence": "Originated the Franz–Parisi potential capturing overlap geometry in disordered systems, the physical construct that underlies the FP criterion optimized in this work."
    },
    {
      "title": "The Power of Low-Degree Polynomials for High-Dimensional Inference",
      "authors": "Samuel B. Hopkins",
      "year": 2018,
      "role": "Methodological framework (LDP)",
      "relationship_sentence": "Formalized the low-degree method used to certify computational lower bounds, which the earlier FP work matched in Gaussian additive models and which this paper uses as a comparison point when upgrading FP to match SQ lower bounds."
    },
    {
      "title": "Notes on the Low-Degree Likelihood Ratio Method",
      "authors": "David Gamarnik; Max H. Wein; Henry Y. T. Kunisky (often cited as Kunisky; Schramm; Wein)",
      "year": 2022,
      "role": "Methodological consolidation (LDP toolbox)",
      "relationship_sentence": "Systematized techniques relating likelihood-ratio geometry, χ^2 correlations, and low-degree projections; these tools clarify how overlap and correlation structures drive algorithmic barriers, directly informing the optimized FP-to-SQ equivalence."
    },
    {
      "title": "Efficient Noise-Tolerant Learning from Statistical Queries",
      "authors": "Michael Kearns",
      "year": 1998,
      "role": "Foundational model (SQ)",
      "relationship_sentence": "Introduced the Statistical Query framework that defines the class of algorithms for which this paper establishes lower-bound equivalence with the optimized FP criterion."
    },
    {
      "title": "Statistical Algorithms and a Lower Bound for Planted Clique",
      "authors": "Vitaly Feldman; Elena Grigorescu; Lev Reyzin; Santosh Vempala; Ying Xiao",
      "year": 2013,
      "role": "SQ lower bound machinery",
      "relationship_sentence": "Developed the statistical algorithm (SQ) lower-bound framework via average correlation/statistical dimension, techniques this paper leverages to match the optimized FP criterion with SQ hardness across detection problems."
    },
    {
      "title": "A General Characterization of the Statistical Query Complexity",
      "authors": "Vitaly Feldman",
      "year": 2017,
      "role": "SQ complexity characterization",
      "relationship_sentence": "Provided general SQ complexity measures in terms of correlation/χ^2 geometry, enabling the precise formal bridge this paper builds between the optimized FP potential and SQ lower bounds under mild model assumptions."
    }
  ],
  "synthesis_narrative": "The paper’s core contribution—optimizing the Franz–Parisi (FP) criterion to better encode overlap geometry and proving its equivalence to Statistical Query (SQ) lower bounds—rests on two pillars: the FP/low-degree lineage and the SQ lower-bound framework. The FP strand begins with the Franz–Parisi potential from spin-glass theory (Franz–Parisi, 1995), which quantifies the overlap landscape. Bandeira et al. (2022) imported an annealed variant of this potential into high-dimensional inference, formulating the FP criterion and showing it matches low-degree polynomial (LDP) lower bounds in Gaussian additive models. The low-degree methodology (Hopkins, 2018) and its subsequent consolidation (e.g., expositions on low-degree likelihood-ratio and χ^2 geometry) clarified how computational barriers are captured by low-degree projections of the likelihood ratio and by overlap/correlation structures—precisely the aspects refined by the optimized FP criterion here.\n\nOn the SQ side, Kearns (1998) introduced the SQ model, and Feldman et al. (2013) developed powerful lower-bound machinery (statistical dimension/average correlation) for detection tasks like planted clique. Feldman (2017) further provided general characterizations of SQ complexity via correlation and χ^2 metrics. These SQ tools connect algorithmic hardness to geometric properties of distributions. The present work leverages these insights to align the optimized FP potential—now more faithful to overlap geometry—with SQ lower bounds under mild, checkable assumptions across broad model classes (e.g., Gaussian additive, planted sparse). In effect, it unifies FP’s physics-inspired overlap perspective with SQ’s algorithmic complexity lens, extending the earlier FP–LDP equivalence to a foundational algorithm class.",
  "analysis_timestamp": "2026-01-06T23:42:48.144221"
}