{
  "prior_works": [
    {
      "title": "Sparse MRI: The application of compressed sensing for rapid MR imaging",
      "authors": "Michael Lustig, David Donoho, John M. Pauly",
      "year": 2007,
      "role": "Theory/Foundation",
      "relationship_sentence": "Introduced the compressibility/sparsity prior and objective design that CUPID adapts into an unsupervised, image-domain regularization when only routine clinical images (not raw k-space) are available."
    },
    {
      "title": "SENSE: Sensitivity encoding for fast MRI",
      "authors": "Klaas P. Pruessmann, Markus Weiger, Markus B. Scheidegger, Peter Boesiger",
      "year": 1999,
      "role": "Physics/Model",
      "relationship_sentence": "Established the parallel-imaging forward model relating coil sensitivities to image formation, enabling CUPID’s parallel imaging fidelity term that proxies data-consistency without requiring access to raw k-space."
    },
    {
      "title": "GRAPPA: Generalized Autocalibrating Partially Parallel Acquisitions",
      "authors": "Mark A. Griswold, Peter M. Jakob, Robin M. Heidemann, Mathias Nittka, Volker Jellus, Jianmin Wang, Berthold Kiefer, Axel Haase",
      "year": 2002,
      "role": "Clinical Reconstruction/Practical Enabler",
      "relationship_sentence": "As the de facto clinical PI method on scanners, GRAPPA’s vendor recon outputs provide the accessible, routine-image surrogate CUPID leverages to instantiate its parallel-imaging fidelity when raw data are unavailable."
    },
    {
      "title": "MoDL: Model-Based Deep Learning Architecture for Inverse Problems",
      "authors": "Hemant K. Aggarwal, Merry P. Mani, Mathews Jacob",
      "year": 2018,
      "role": "Method (PD-DL/Unrolled Reconstruction)",
      "relationship_sentence": "Provided the unrolled PD-DL template with an explicit data-consistency operator; CUPID retains this structure but replaces k-space DC with a PI-based fidelity computable from clinical recon images."
    },
    {
      "title": "Learning a Variational Network for Reconstruction of Accelerated MRI Data",
      "authors": "Kersten Hammernik, Thomas Klatzer, Erich Kobler, Matthew P. Recht, Daniel K. Sodickson, Thomas Pock, Florian Knoll",
      "year": 2018,
      "role": "Method (Learned Regularizers in PD-DL)",
      "relationship_sentence": "Demonstrated learning image priors within an unrolled variational formulation; CUPID follows this paradigm but crafts a compressibility-inspired unsupervised prior paired with a novel PI-fidelity term."
    },
    {
      "title": "Self-supervised learning of physics-guided reconstruction neural networks without fully sampled reference data",
      "authors": "Burhaneddin Yaman, Saip A. Hosseini, Steen Moeller, Jutta Ellermann, Kamil Ugurbil, Mehmet Akcakaya",
      "year": 2020,
      "role": "Method (Self-Supervised MRI Reconstruction)",
      "relationship_sentence": "Showed PD-DL can be trained without ground-truth images by splitting acquired k-space; CUPID extends this self-supervised principle to settings with no raw data by using parallel-imaging fidelity from routine images."
    },
    {
      "title": "Plug-and-Play Priors for Model Based Reconstruction",
      "authors": "S. Venkatakrishnan, Charles A. Bouman, Brendt Wohlberg",
      "year": 2013,
      "role": "Theory/Algorithmic Principle",
      "relationship_sentence": "Inspired CUPID’s decoupling of learned image priors from physics-based fidelity, legitimizing training priors purely on image-domain data while enforcing measurement physics through a separate fidelity mechanism."
    }
  ],
  "synthesis_narrative": "CUPID’s core insight—training physics-driven deep MRI reconstructions without any access to raw k-space—sits at the intersection of compressibility priors, parallel-imaging physics, and unrolled deep reconstruction. Lustig–Donoho–Pauly’s compressed sensing MRI established compressibility as a powerful prior and a workable objective, a principle CUPID repurposes as an unsupervised image-domain regularization when only routine reconstructions are available. The fidelity side is grounded in parallel imaging: SENSE formalized the multi-coil forward model, while GRAPPA became the ubiquitous clinical PI recon on scanners. CUPID leverages this reality by defining a “parallel-imaging fidelity” that can be instantiated from readily available vendor recon outputs, eliminating the need for raw k-space during training.\nModel-wise, CUPID inherits the unrolled PD-DL paradigm from MoDL and variational networks—alternating learned priors with physics consistency—yet replaces the conventional k-space data-consistency with its PI-based fidelity. From the learning perspective, SSDU demonstrated that PD-DL can be trained without fully sampled ground truth by exploiting measurement splits; CUPID advances this line by removing the raw-data dependency altogether, expanding applicability to under-resourced sites where only final images can be exported. Finally, Plug-and-Play priors provide the algorithmic justification for decoupling learned image priors from the measurement model, supporting CUPID’s strategy of training priors on image-only corpora and enforcing physics via a separate fidelity mechanism. Together, these works directly scaffold CUPID’s compressibility-inspired objective and its practical, raw-free fidelity formulation.",
  "analysis_timestamp": "2026-01-06T23:42:48.118173"
}