{
  "prior_works": [
    {
      "title": "Time Series: Data Analysis and Theory",
      "authors": "David R. Brillinger",
      "year": 1981,
      "role": "Canonical spectral analysis foundation",
      "relationship_sentence": "Brillinger formalized canonical coherence for stationary multivariate time series in the frequency domain, providing the stationary benchmark that WaveCanCoh generalizes to a nonstationary, scale-specific setting."
    },
    {
      "title": "Multiple Time Series",
      "authors": "E. J. Hannan",
      "year": 1970,
      "role": "Rigorous development of multivariate spectral and canonical analysis",
      "relationship_sentence": "Hannan’s treatment of canonical analysis for multiple time series established the mathematical basis for defining and estimating canonical coherences between vector processes, which WaveCanCoh extends to evolve over time and scale."
    },
    {
      "title": "The Analysis of Non-Stationary Time Series by Means of Time-Dependent Spectral Analysis",
      "authors": "M. B. Priestley",
      "year": 1965,
      "role": "Evolutionary spectrum concept",
      "relationship_sentence": "Priestley’s evolutionary spectrum introduced time-varying second-order structure, motivating the very idea of time-varying coherence that WaveCanCoh seeks to estimate at multiple scales."
    },
    {
      "title": "Fitting Time Series Models to Nonstationary Processes",
      "authors": "R. Dahlhaus",
      "year": 1997,
      "role": "Locally stationary (Fourier) framework",
      "relationship_sentence": "Dahlhaus’s locally stationary process theory provided a path to consistent time-varying spectral matrix estimation, a prerequisite for defining time-evolving canonical coherences later adapted in the wavelet domain by WaveCanCoh."
    },
    {
      "title": "Wavelet Processes and the Estimation of the Evolutionary Wavelet Spectrum",
      "authors": "G. P. Nason, R. von Sachs, and G. Kroisandt",
      "year": 2000,
      "role": "Locally stationary wavelet (LSW) model",
      "relationship_sentence": "This seminal LSW model underpins the multiscale, time-localized representation used by WaveCanCoh to estimate scale-specific time-varying dependence between clusters."
    },
    {
      "title": "Application of the Cross Wavelet Transform and Wavelet Coherence to Geophysical Time Series",
      "authors": "A. Grinsted, J. C. Moore, and S. Jevrejeva",
      "year": 2004,
      "role": "Pairwise wavelet coherence",
      "relationship_sentence": "Grinsted et al. operationalized time–frequency localized coherence for two signals, which WaveCanCoh generalizes from pairwise to multivariate cluster-to-cluster canonical coherence."
    },
    {
      "title": "The SLEX Model of a Nonstationary Random Process",
      "authors": "H. Ombao, J. Raz, R. von Sachs, and W. Guo",
      "year": 2002,
      "role": "Time–frequency spectral matrices and time-varying coherence",
      "relationship_sentence": "SLEX provided practical estimation of time-varying spectral matrices and coherence for nonstationary multivariate series, directly informing WaveCanCoh’s estimation of evolving cross-cluster dependence."
    }
  ],
  "synthesis_narrative": "WaveCanCoh sits at the intersection of canonical spectral analysis and multiscale nonstationary modeling. In the stationary regime, Brillinger and Hannan laid the mathematical foundations for canonical coherence—frequency-domain canonical correlation between vector time series—defining the population objects WaveCanCoh ultimately seeks to recover over time and across scales. Priestley’s evolutionary spectrum reframed dependence as time-varying, motivating coherence measures that adapt to changing dynamics. Dahlhaus advanced this by formalizing locally stationary processes and consistent estimation of time-varying spectral matrices, establishing a principled route to evolve canonical objects in time.\nThe wavelet line of work supplies the multiscale machinery essential for transient, frequency-specific interactions. Nason, von Sachs, and Kroisandt’s locally stationary wavelet (LSW) model enables time–scale localized second-order structure, which WaveCanCoh leverages to define scale-specific canonical coherence between signal clusters. Grinsted, Moore, and Jevrejeva’s wavelet coherence provided a practical, time–frequency localized dependence measure—but only pairwise—highlighting the need for a multivariate, cluster-based generalization. Finally, Ombao and co-authors’ SLEX framework demonstrated how to estimate time-varying spectral matrices and coherence for nonstationary vectors, bridging theory and computation for evolving connectivity.\nIntegrating these streams, WaveCanCoh generalizes stationary canonical coherence to nonstationary multivariate clusters by embedding it within the LSW framework. This yields interpretable, scale-specific, time-evolving canonical coherences and estimation procedures grounded in established theory for locally stationary processes and time–frequency spectral matrices.",
  "analysis_timestamp": "2026-01-07T00:21:32.300044"
}