{
  "prior_works": [
    {
      "title": "Generative Modeling by Estimating Gradients of the Data Distribution",
      "authors": "Yang Song et al.",
      "year": 2019,
      "role": "Baseline",
      "relationship_sentence": "This work introduced annealed Langevin dynamics with learned scores, the de facto diffusion-based sampler for unnormalized energies that PITA generalizes by adding a progressive temperature (Boltzmann) annealing schedule and a cascade of models trained across temperatures."
    },
    {
      "title": "Annealed Importance Sampling",
      "authors": "Radford M. Neal",
      "year": 2001,
      "role": "Inspiration",
      "relationship_sentence": "PITA’s core idea of traversing a sequence of increasingly ‘colder’ target distributions directly draws on AIS-style temperature tempering, but operationalizes it inside a diffusion framework with learnable transitions."
    },
    {
      "title": "Sequential Monte Carlo Samplers",
      "authors": "Pierre Del Moral et al.",
      "year": 2006,
      "role": "Foundation",
      "relationship_sentence": "The principle of constructing and exploiting a tempered sequence of intermediate targets underpins PITA’s progressive training from high to low temperatures using easy-to-sample hot distributions to bootstrap colder ones."
    },
    {
      "title": "Score-Based Generative Modeling through Stochastic Differential Equations",
      "authors": "Yang Song et al.",
      "year": 2021,
      "role": "Foundation",
      "relationship_sentence": "PITA’s diffusion smoothing and probability-path design rely on the SDE view of score-based diffusion models, which provides the training and sampling machinery used at each temperature level."
    },
    {
      "title": "Diffusion Schrödinger Bridge",
      "authors": "Valentin De Bortoli et al.",
      "year": 2021,
      "role": "Gap Identification",
      "relationship_sentence": "Bridge-based diffusion methods highlight the promise of connecting base and target distributions but struggle to scale to complex, high-dimensional energy targets, a limitation PITA addresses via progressive temperature annealing and staged training."
    },
    {
      "title": "Boltzmann Generators: Sampling Equilibrium States of Many-Body Systems with Deep Learning",
      "authors": "Frank Noé et al.",
      "year": 2019,
      "role": "Foundation",
      "relationship_sentence": "This paper established amortized deep generative sampling for Boltzmann densities and motivates PITA’s objective, which replaces flow-based transport with diffusion smoothing plus temperature annealing to improve scalability."
    },
    {
      "title": "Flow-based sampling for lattice gauge theory",
      "authors": "Michael S. Albergo et al.",
      "year": 2019,
      "role": "Related Problem",
      "relationship_sentence": "Demonstrating amortized sampling for unnormalized Boltzmann-like targets via learned transport paths, this work informs PITA’s use of an explicit bridging path, which PITA realizes by coupling diffusion smoothing with temperature tempering."
    }
  ],
  "synthesis_narrative": "PITA’s core contribution—progressively annealing Boltzmann targets while applying diffusion smoothing—emerges from unifying two mature lines of work: tempering-based bridging of targets and score-based diffusion sampling. Tempering from AIS and SMC (Neal, 2001; Del Moral et al., 2006) established that sequences of intermediate, higher-temperature distributions make otherwise intractable targets accessible. Score-based diffusion modeling (Song et al., 2021) and its practical sampler, annealed Langevin dynamics (Song & Ermon, 2019), introduced multi-noise smoothing and probability-path design that enable learnable, amortized transitions. Bridge-based diffusion formulations (De Bortoli et al., 2021) further clarified how to connect distributions through diffusions, but also exposed scaling limitations when targets are defined by complex, high-dimensional energies. In parallel, amortized Boltzmann sampling in physical sciences (Noé et al., 2019; Albergo et al., 2019) demonstrated the promise of learned transport to tackle unnormalized densities, though primarily with normalizing flows and often domain-specific constraints. PITA synthesizes these threads by training a cascade of diffusion models from hot to cold temperatures, using easy samples at high temperature to bootstrap learning at progressively lower temperatures, while diffusion smoothing maintains stability and expressivity of the probability path. This directly addresses the identified gap—scaling diffusion-based samplers to realistic Boltzmann densities—by aligning the annealing schedule (from AIS/SMC) with the diffusion score framework and thereby achieving tractable, amortized sampling for molecular-scale targets.",
  "analysis_timestamp": "2026-01-06T23:08:23.955083"
}