{
  "prior_works": [
    {
      "title": "Scaling Laws for Neural Language Models",
      "authors": "Jared Kaplan, Sam McCandlish, Tom Henighan, et al.",
      "year": 2020,
      "role": "Scaling-law foundation for progressive evaluation",
      "relationship_sentence": "Genesys’s Ladder of Scales—screening designs at small sizes and promoting only promising ones to larger budgets—directly operationalizes Kaplan et al.’s finding that performance predictably scales with model size/compute."
    },
    {
      "title": "Training Compute-Optimal Large Language Models",
      "authors": "Jordan Hoffmann, Sebastian Borgeaud, Arthur Mensch, et al.",
      "year": 2022,
      "role": "Compute-optimal budgeting across scales",
      "relationship_sentence": "Chinchilla-style compute/data tradeoffs inform Genesys’s narrowing verification budget and scale-aware selection, ensuring efficient allocation of training runs across 14M–350M parameters."
    },
    {
      "title": "Regularized Evolution for Image Classifier Architecture Search",
      "authors": "Esteban Real, Alok Aggarwal, Yanping Huang, Quoc V. Le",
      "year": 2019,
      "role": "Evolutionary search backbone for architectures",
      "relationship_sentence": "Genesys’s genetic programming backbone (mutation/selection of design candidates with tournament-like downselection) is a direct adaptation of regularized evolutionary NAS principles to LM architecture/code search."
    },
    {
      "title": "AutoML-Zero: Evolving Machine Learning Algorithms From Scratch",
      "authors": "Esteban Real, Chen Liang, David R. So, Quoc V. Le",
      "year": 2020,
      "role": "Genetic programming for discovering ML primitives",
      "relationship_sentence": "AutoML-Zero’s idea of evolving executable programs that implement ML algorithms directly motivates Genesys’s code-generating, GP-based discovery of LM design components and training recipes."
    },
    {
      "title": "CAMEL: Communicative Agents for ‘Mind’ Exploration with Large Language Models",
      "authors": "Li et al.",
      "year": 2023,
      "role": "Role-specialized multi-agent LLM coordination",
      "relationship_sentence": "Genesys’s proposal–review–implementation–verification pipeline mirrors CAMEL-style role-playing agents that coordinate through dialogue to plan, critique, and execute complex tasks."
    },
    {
      "title": "AI Safety via Debate",
      "authors": "Geoffrey Irving, Paul Christiano, Dario Amodei",
      "year": 2018,
      "role": "Adversarial review via debate-style critique",
      "relationship_sentence": "Genesys’s adversarial reviewing of design proposals draws on debate paradigms to elicit flaws and surface stronger candidates before expensive verification."
    },
    {
      "title": "PromptBreeder: Self-Referential Genetic Improvement for LLM Prompts",
      "authors": "Fernando et al.",
      "year": 2023,
      "role": "LLM-guided genetic search and mutation operators",
      "relationship_sentence": "PromptBreeder’s use of genetic operators and self-referential mutation for LLM artifacts inspires Genesys’s claim that a genetic backbone outperforms direct, one-shot prompt/code generation for producing viable designs."
    }
  ],
  "synthesis_narrative": "Genesys’s core contribution—an LLM-driven, multi-agent system that proposes, critiques, implements, trains, and evaluates novel LM designs with a Ladder of Scales—stands on three converging lines of prior work. First, scaling-law research by Kaplan et al. and the compute-optimal perspective of Hoffmann et al. directly motivate Genesys’s progressive verification: run many cheap small-scale trials, then advance only the most promising designs to larger models under a tightening compute budget. This turns empirical scaling regularities into an explicit experiment-allocation policy.\nSecond, Genesys’s “genetic programming backbone” traces to evolutionary architecture/algorithm discovery. Regularized evolution (Real et al., 2019) establishes robust mutation–selection loops for neural design, while AutoML-Zero (Real et al., 2020) shows that executable ML programs can be evolved end-to-end. Genesys adapts these ideas to LLM-mediated code generation for LM components, arguing this evolutionary substrate reliably yields runnable, high-quality designs relative to single-shot prompting. PromptBreeder extends this by demonstrating LLM-in-the-loop genetic operators for textual artifacts, informing Genesys’s mutation, crossover, and self-referential improvements.\nThird, the system-level orchestration draws from multi-agent LLM frameworks and adversarial critique. CAMEL-style role specialization maps naturally onto research roles (proposer, reviewer, implementer, verifier), and debate-inspired adversarial reviewing (Irving et al.) provides a principled mechanism to stress-test proposals before expensive training. Together, these threads produce a closed-loop, compute-aware discovery pipeline in which LLMs not only propose but systematically winnow and validate LM architectures.",
  "analysis_timestamp": "2026-01-07T00:05:12.542733"
}