{
  "prior_works": [
    {
      "title": "Will Affirmative-Action Policies Eliminate Negative Stereotypes?",
      "authors": "Stephen Coate, Glenn C. Loury",
      "year": 1993,
      "role": "Conceptual foundation linking group beliefs/valuations, effort incentives, and equilibrium representation",
      "relationship_sentence": "The paper’s core idea that group-specific perceived post-selection value shapes equilibrium effort and representation directly builds on Coate–Loury’s model where beliefs about returns drive heterogeneous investment and self-confirming disparities."
    },
    {
      "title": "Strategic Classification",
      "authors": "Moritz Hardt, Nimrod Megiddo, Christos Papadimitriou, Mikhail Wootters",
      "year": 2016,
      "role": "Microfoundations for agents’ strategic effort in response to selection rules",
      "relationship_sentence": "Celis et al.’s effort-choice model under merit-based selection adopts the strategic-response paradigm formalized here, where agents weigh costs of effort against acceptance rewards determined by a decision rule."
    },
    {
      "title": "How Do Classifiers Induce Agents to Invest Effort Strategically?",
      "authors": "Jon Kleinberg, Manish Raghavan",
      "year": 2019,
      "role": "Characterization of incentive effects of thresholds on effort and welfare",
      "relationship_sentence": "The paper’s explicit formulas linking institutional selectivity to group effort and welfare echo this work’s analysis of how acceptance thresholds induce heterogeneous effort responses and shape social outcomes."
    },
    {
      "title": "The Delayed Impact of Fair Machine Learning",
      "authors": "Lydia T. Liu, Sarah Dean, Esther Rolf, Max Simchowitz, Moritz Hardt",
      "year": 2018,
      "role": "Dynamic/incentive perspective on selection policies and group outcomes",
      "relationship_sentence": "Their demonstration that selection rules affect future group qualifications via incentives directly motivates the present paper’s focus on perceived value disparities and policy modifications that internalize strategic responses."
    },
    {
      "title": "Contest Success Functions",
      "authors": "Stergios Skaperdas",
      "year": 1996,
      "role": "Game-theoretic machinery for effort competition for scarce prizes",
      "relationship_sentence": "The model of costly effort to compete for limited selection slots maps to contest theory, and Skaperdas’s framework underpins the formulation and equilibrium analysis of merit-based selection as a contest."
    },
    {
      "title": "Equilibrium Points of Nonatomic Games",
      "authors": "David Schmeidler",
      "year": 1973,
      "role": "Non-atomic/large-population equilibrium foundation",
      "relationship_sentence": "The paper’s large-agent limit and uniqueness of Nash equilibrium rely on the nonatomic-games approach introduced by Schmeidler, enabling clean equilibrium characterizations with a continuum of strategic agents."
    },
    {
      "title": "The Cost of Fairness in Binary Classification",
      "authors": "Aditya Menon, Robert C. Williamson",
      "year": 2018,
      "role": "Optimization lens for quantifying accuracy–fairness trade-offs",
      "relationship_sentence": "The proposed cost-sensitive optimization that quantifies how modifying selection affects welfare and utility follows this line of work in explicitly formulating and optimizing trade-offs induced by fairness or policy constraints."
    }
  ],
  "synthesis_narrative": "The paper’s core contribution—a game-theoretic model where group-specific perceived post-selection value drives strategic effort under merit-only selection, leading to closed-form equilibrium characterizations and a cost-sensitive policy design—sits at the intersection of three lines of prior work. First, Coate and Loury provide the conceptual backbone: perceived returns and beliefs shape investment incentives and can yield self-confirming disparities in representation. The present work operationalizes this idea as group-dependent valuations, including those shaped by AI advice, which enter payoffs and hence effort choices.\nSecond, the incentive-theoretic machinery comes from strategic behavior under selection rules. Hardt et al. (Strategic Classification) and Kleinberg–Raghavan formalize how thresholds induce agents to invest costly effort, connecting decision rules to welfare. Liu et al. extend this to dynamic, group-level impacts, motivating the paper’s explicit coupling between institutional selectivity and induced effort, representation, and social welfare. These works collectively inform the equilibrium structure and the interpretation of policy effects through incentives.\nThird, technical underpinnings come from contest theory and nonatomic games. Skaperdas’s contest success function framework maps merit-based selection to effort competition for scarce slots, guiding equilibrium derivations, while Schmeidler’s nonatomic equilibrium enables the large-agent limit and uniqueness claimed by the authors. Finally, the proposed cost-sensitive optimization to modify selection policies draws on the fairness–utility trade-off literature (Menon–Williamson), providing a principled objective to quantify and navigate the strategic costs of perceived bias in selection.",
  "analysis_timestamp": "2026-01-07T00:29:42.061221"
}