{
  "prior_works": [
    {
      "title": "ROME: Locating and Editing Factual Associations in GPT",
      "authors": "Kevin Meng, David Bau, Alex Andonian, Yonatan Belinkov",
      "year": 2022,
      "role": "Foundational model-editing method for factual knowledge",
      "relationship_sentence": "CAKE generalizes ROME’s notion of localized factual edits—originally framed around structured triplets—to unstructured, entangled text by first organizing evidence into a semantic-augmented graph and then applying conflict-aware edits."
    },
    {
      "title": "MEMIT: Mass-Editing Memory in a Transformer",
      "authors": "Kevin Meng et al.",
      "year": 2023,
      "role": "Scalable multi-edit approach addressing interference",
      "relationship_sentence": "MEMIT’s analysis of edit interference and scalability directly motivates CAKE’s conflict-aware editing strategy, which detects and mitigates collisions among interdependent facts surfaced from unstructured text."
    },
    {
      "title": "MEND: Fast Model Editing at Scale",
      "authors": "Eric Mitchell, Charles Lin, Antoine Bosselut, Christopher D. Manning, Stefano Ermon",
      "year": 2022,
      "role": "Gradient-based editing with locality constraints",
      "relationship_sentence": "CAKE builds on MEND’s locality/reliability trade-offs, extending the idea to graph-structured contexts so edits respect neighboring, semantically related facts extracted from wild text."
    },
    {
      "title": "SERAC: Memory-Based Model Editing at Scale",
      "authors": "Eric Mitchell et al.",
      "year": 2022,
      "role": "Non-parametric, routing-based editing to avoid interference",
      "relationship_sentence": "SERAC’s strategy to isolate edits informs CAKE’s conflict-aware mechanism, but CAKE integrates isolation decisions with a semantic graph to identify and handle conflicting evidence within unstructured documents."
    },
    {
      "title": "Transformer Feed-Forward Layers Are Key-Value Memories",
      "authors": "Mor Geva, Roei Schuster, Jonathan Berant, Omer Levy",
      "year": 2021,
      "role": "Mechanistic insight into how transformers store facts",
      "relationship_sentence": "The key-value memory view motivates CAKE’s targeted updates by clarifying where facts live in LMs, while CAKE contributes a semantic graph front-end to locate which parameters to adjust given messy textual evidence."
    },
    {
      "title": "Abstract Meaning Representation (AMR) 1.0",
      "authors": "Laura Banarescu et al.",
      "year": 2013,
      "role": "Semantic graph formalism for unstructured text",
      "relationship_sentence": "AMR inspires CAKE’s semantic-augmented graph module, demonstrating how predicate-argument structure, coreference, and semantic roles can be encoded as a graph to reduce ambiguity in free text."
    },
    {
      "title": "DYGIE++: A Neural Information Extraction System for Document-Level Relation Extraction and Event Extraction",
      "authors": "David Wadden et al.",
      "year": 2019,
      "role": "Graph-based IE over documents with entities, relations, and coreference",
      "relationship_sentence": "DYGIE++ shows how to build and reason over span-level semantic graphs from documents, a blueprint CAKE adapts to structure unstructured knowledge before performing conflict-aware edits."
    }
  ],
  "synthesis_narrative": "CAKE’s core contribution—editing LLM knowledge from wild, unstructured text via a semantic-augmented graph paired with a conflict-aware editing strategy—sits at the intersection of model editing and document-level semantic graph construction. On the editing side, ROME established that factual associations can be localized and surgically modified in transformer MLP layers, but it assumes structured, triplet-style edits and struggles with entangled contexts. MEMIT extended editing to many facts at once and exposed interference phenomena that arise when edits collide, directly motivating CAKE’s explicit conflict-awareness. MEND further formalized the locality–reliability trade-off in gradient-based editing, a principle CAKE operationalizes in graph space so local neighborhoods of semantically linked facts remain consistent. SERAC offered a memory-based route to isolate edits and avoid interference; CAKE borrows the isolation intuition but grounds it in a semantic graph to detect and resolve conflicts intrinsic to unstructured evidence. Mechanistically, Geva et al.’s “key–value memory” view informs where and how to target updates once CAKE has disambiguated the textual knowledge. On the representation side, AMR provides the paradigm for capturing predicate–argument structure, coreference, and roles as a graph, while DYGIE++ demonstrates practical document-level graph construction and reasoning. Together, these works directly shape CAKE’s pipeline: structure messy text into a semantically faithful graph, then perform conflict-aware, localized edits that respect neighboring knowledge.",
  "analysis_timestamp": "2026-01-07T00:21:32.285017"
}