{
  "prior_works": [
    {
      "title": "Individual Choice Behavior: A Theoretical Analysis",
      "authors": "R. Duncan Luce",
      "year": 1959,
      "role": "Foundational baseline for discrete choice (IIA/MNL)",
      "relationship_sentence": "DeepHalo is explicitly designed to model context-dependent violations of Luce’s IIA, providing a feature-based neural alternative where utilities can depend on the composition of the choice set."
    },
    {
      "title": "Elimination by Aspects: A Theory of Choice",
      "authors": "Amos Tversky",
      "year": 1972,
      "role": "Early feature-based, context-dependent choice theory",
      "relationship_sentence": "DeepHalo generalizes the EBA intuition of aspect-driven interactions by learning feature-conditioned interactions among alternatives, extending from pairwise to controllable higher-order effects."
    },
    {
      "title": "Context-Dependent Preferences",
      "authors": "Amos Tversky, Itamar Simonson",
      "year": 1993,
      "role": "Behavioral foundation for attraction/compromise effects and regularity violations",
      "relationship_sentence": "The phenomena formalized by Tversky and Simonson motivate DeepHalo’s core design goal of capturing and interpreting first- and higher-order context effects within feature-rich choice sets."
    },
    {
      "title": "Determinantal Point Processes for Machine Learning",
      "authors": "Alex Kulesza, Ben Taskar",
      "year": 2012,
      "role": "Probabilistic set model with explicit pairwise interactions (diversity/repulsion)",
      "relationship_sentence": "DeepHalo extends beyond DPPs’ restrictive pairwise structure by offering a feature-based framework with tunable interaction order, enabling both pairwise and higher-order context effects with interpretability."
    },
    {
      "title": "Deep Sets",
      "authors": "Manzil Zaheer, Satwik Kottur, Siamak Ravanbakhsh, Barnabás Póczos, Ruslan Salakhutdinov, Alexander J. Smola",
      "year": 2017,
      "role": "Permutation-invariant neural architecture for set inputs",
      "relationship_sentence": "DeepHalo builds on the Deep Sets principle of permutation invariance but moves beyond independent item scoring by introducing controlled interaction terms whose order can be explicitly specified and interpreted."
    },
    {
      "title": "Set Transformer: A Framework for Attention-based Permutation-Invariant Neural Networks",
      "authors": "Juho Lee, Yoonho Lee, Jungtaek Kim, Adam Kosiorek, Seungjin Choi, Yee Whye Teh",
      "year": 2019,
      "role": "Set encoder with attention-induced (entangled) interactions",
      "relationship_sentence": "DeepHalo addresses the interpretability limits of Set Transformers by disentangling interaction orders, allowing practitioners to isolate and control pairwise versus higher-order context effects."
    },
    {
      "title": "Invariant and Equivariant Graph Networks",
      "authors": "Haggai Maron, Heli Ben-Hamu, Nadav Shlezinger, Yaron Lipman",
      "year": 2019,
      "role": "Theory of k-order invariant architectures enabling order-controlled interactions",
      "relationship_sentence": "DeepHalo adapts the notion of k-ary invariant constructions to discrete choice, operationalizing order-controlled interaction terms to yield principled, interpretable decompositions of context effects."
    }
  ],
  "synthesis_narrative": "DeepHalo’s core innovation—feature-based, controllable interaction orders with principled interpretability—emerges at the intersection of behavioral choice theory and permutation-invariant neural set modeling. Classical discrete choice foundations (Luce, 1959) provide the benchmark MNL/IIA paradigm that assumes context-independent utilities; the very limitations of this view motivate modeling schemes that allow the composition of the choice set to influence preferences. Behavioral work on context dependence (Tversky, 1972; Tversky & Simonson, 1993) establishes both mechanisms and phenomena—such as attraction and compromise effects—that DeepHalo aims to capture, not merely reproduce, but decompose into identifiable first- and higher-order interactions.\nOn the modeling side, probabilistic set models like DPPs (Kulesza & Taskar, 2012) show how explicit pairwise interactions can encode context effects (e.g., similarity-driven repulsion), yet they remain structurally limited to order-2 effects. Neural set architectures (Deep Sets; Zaheer et al., 2017) deliver permutation invariance but largely aggregate independent item utilities, suppressing interactions; attention-based Set Transformers (Lee et al., 2019) introduce rich interactions but entangle them across orders, undermining interpretability. Theoretical advances in invariant/equivariant networks (Maron et al., 2019) demonstrate how k-ary constructions can control interaction order. DeepHalo synthesizes these threads: it retains permutation invariance, introduces explicit k-order feature-conditioned interaction terms, and yields interpretable decompositions aligned with behavioral phenomena. This resolves the trade-off between expressivity and interpretability that characterizes prior feature-based and neural approaches to context-dependent choice.",
  "analysis_timestamp": "2026-01-07T00:02:04.942166"
}