{
  "prior_works": [
    {
      "title": "EvolveGCN: Evolving Graph Convolutional Networks for Dynamic Graphs",
      "authors": "Pareja et al.",
      "year": 2020,
      "role": "Dynamic GNN foundation",
      "relationship_sentence": "EvoBrain builds on EvolveGCN’s central premise that graph structure and parameters must evolve over time, but shifts from weight-evolving GCNs on given dynamic graphs to explicitly learning and using time-varying EEG channel graphs driven by the signals themselves for seizure detection."
    },
    {
      "title": "Temporal Graph Networks for Deep Learning on Dynamic Graphs",
      "authors": "Rossi et al.",
      "year": 2020,
      "role": "Temporal-event dynamic graph modeling",
      "relationship_sentence": "By emphasizing continuous-time message passing and temporal memory, TGN motivates EvoBrain’s explicit modeling of temporal dynamics and interactions before graph reasoning, informing the paper’s time-then-graph design and its theoretical analysis of temporal–structural interplay."
    },
    {
      "title": "Graph WaveNet for Deep Spatial-Temporal Graph Modeling",
      "authors": "Wu, Pan, Long, Jiang, Zhang",
      "year": 2019,
      "role": "Adaptive adjacency and temporal-first blocks",
      "relationship_sentence": "Graph WaveNet’s dilated temporal convolutions and learned adaptive adjacency inspire EvoBrain’s data-driven connectivity modeling; EvoBrain extends this by making the adjacency explicitly time-varying and formalizing a time-then-graph pipeline tailored to EEG dynamics."
    },
    {
      "title": "Connecting the Dots: Multivariate Time Series Forecasting with Graph Neural Networks (MTGNN)",
      "authors": "Wu, Pan, Long, Jiang, Chang, Zhang",
      "year": 2020,
      "role": "Joint time–graph learning from sensor signals",
      "relationship_sentence": "MTGNN demonstrates learning dependency graphs directly from multivariate signals; EvoBrain adapts this idea to EEG by learning evolving (not static) inter-channel graphs and analyzing why a temporal-then-graph order stabilizes performance for rapidly changing brain states."
    },
    {
      "title": "Neural Relational Inference for Interacting Systems",
      "authors": "Kipf, Fetaya, Wang, Welling, Zemel",
      "year": 2018,
      "role": "Latent, time-varying edge inference",
      "relationship_sentence": "NRI’s formulation of inferring latent relations from trajectories underpins EvoBrain’s explicit dynamic connectivity estimation from EEG, guiding the move away from fixed graphs toward edges that change with seizure progression."
    },
    {
      "title": "Spatial Temporal Graph Convolutional Networks (ST-GCN) for Skeleton-Based Action Recognition",
      "authors": "Yan, Xiong, Lin",
      "year": 2018,
      "role": "Spatiotemporal operator ordering",
      "relationship_sentence": "ST-GCN highlights how temporal and spatial graph operations can be composed; EvoBrain leverages this insight to justify and theoretically analyze a time-then-graph ordering that better captures evolving EEG dependencies than graph-first designs."
    },
    {
      "title": "Dynamic network drivers of seizure generation, propagation and termination in human neocortical epilepsy",
      "authors": "Khambhati et al.",
      "year": 2016,
      "role": "Neuroscientific evidence for time-evolving brain connectivity",
      "relationship_sentence": "This work provides empirical evidence that seizure-related brain networks evolve over time, directly motivating EvoBrain’s core choice to model EEG connectivity as explicitly dynamic rather than temporally fixed."
    }
  ],
  "synthesis_narrative": "EvoBrain’s core contribution—explicitly modeling time-evolving EEG connectivity and formalizing a time-then-graph dynamic GNN—sits at the intersection of dynamic graph learning, spatiotemporal GNN design, and neuroscience evidence about seizure dynamics. Dynamic GNN advances like EvolveGCN and Temporal Graph Networks established that both node states and graph structure can change and that temporal memory is vital, but they generally presuppose given dynamic graphs or evolve model parameters rather than learning edges from raw multivariate signals. In parallel, spatiotemporal architectures for sensors, notably Graph WaveNet and MTGNN, demonstrated that strong performance emerges when temporal modules process signals before graph reasoning and when adjacency can be learned adaptively from data; however, these graphs are typically static or slowly varying and were not tailored to abrupt regime shifts like seizures. Neural Relational Inference bridged this gap by showing how latent, time-varying relations can be inferred from trajectories, directly motivating EvoBrain’s dynamic edge estimation from EEG. Finally, ST-GCN clarified design choices for composing temporal and spatial operators, a theme EvoBrain extends with a theoretical analysis that favors a time-then-graph pipeline under rapidly changing dependencies. Grounding all of this, Khambhati et al. provide neuroscientific evidence that seizure networks evolve across onset, propagation, and termination, justifying explicit dynamic connectivity. Together, these works directly inform EvoBrain’s dynamic graph construction, temporal-first processing, and theory-backed architecture for seizure detection.",
  "analysis_timestamp": "2026-01-06T23:42:48.146997"
}