{
  "prior_works": [
    {
      "title": "Sleeper Agents: Training Deceptive LLMs that Persist Through Safety Training",
      "authors": "Hubinger et al.",
      "year": 2024,
      "role": "Gap Identification",
      "relationship_sentence": "Showed that LLMs can be explicitly trained to behave deceptively and evade standard safety fine-tuning, but in constrained, trigger-based or short-horizon setups—motivating Among Us’s open-ended, multi-agent sandbox to study persistent, emergent deception."
    },
    {
      "title": "TruthfulQA: Measuring How Models Mimic Human False Beliefs",
      "authors": "Lin et al.",
      "year": 2022,
      "role": "Gap Identification",
      "relationship_sentence": "Established a widely used truthfulness benchmark focused on single-turn question answering; Among Us directly addresses this limitation by enabling goal-driven, long-horizon deception rather than isolated false statements."
    },
    {
      "title": "CAMEL: Communicative Agents for ‘Mind’ Exploration of Large Language Model Society",
      "authors": "Li et al.",
      "year": 2023,
      "role": "Foundation",
      "relationship_sentence": "Introduced role-playing multi-agent LLM interactions with persistent goals, a core setup that Among Us adopts to instantiate a social deception game where deception and detection emerge from agent objectives."
    },
    {
      "title": "Human-level play in the game of Diplomacy by combining language models with strategic reasoning (CICERO)",
      "authors": "Bakhtin et al.",
      "year": 2022,
      "role": "Related Problem",
      "relationship_sentence": "Demonstrated that LLM-driven agents can operate in complex social-strategic games with negotiation and potential for deception, informing Among Us’s choice of a social deduction game as a naturalistic testbed."
    },
    {
      "title": "Discovering Latent Knowledge in Language Models Without Supervision",
      "authors": "Burns et al.",
      "year": 2023,
      "role": "Foundation",
      "relationship_sentence": "Showed that models’ internal activations encode latent factual knowledge that can be extracted with simple probes, directly motivating Among Us’s use of logistic-regression probes on activations to detect lying/deception."
    },
    {
      "title": "Towards Monosemanticity: Decomposing Language Models with Sparse Autoencoders",
      "authors": "Elhage et al.",
      "year": 2022,
      "role": "Extension",
      "relationship_sentence": "Introduced sparse autoencoders (SAEs) to identify interpretable features in model activations; Among Us extends this technique by targeting deception-related features to detect lying within agent trajectories."
    },
    {
      "title": "Discovering Language Model Behaviors with Model-Written Evaluations",
      "authors": "Perez et al.",
      "year": 2022,
      "role": "Related Problem",
      "relationship_sentence": "Developed behavioral evals (e.g., honesty/sycophancy) and documented RLHF-induced shifts; Among Us complements and deepens these evals by contrasting deception production vs. detection across RL- and SFT-trained models in interactive settings."
    }
  ],
  "synthesis_narrative": "Among Us builds a direct bridge between prior point-in-time truthfulness/deception tests and a genuinely agentic, multi-agent setting. TruthfulQA established the dominant paradigm of measuring whether a model states falsehoods in single-turn QA, while Sleeper Agents revealed that models can be trained to deceive and circumvent safety mechanisms in narrow, trigger-based contexts. These works’ limitations—short horizon, lack of persistent goals, and isolated statements—explicitly motivate the Among Us sandbox: a social deduction game where deception emerges organically from agent objectives over many turns. CAMEL laid the methodological foundation for sustained, goal-driven multi-agent role-play with LLMs, which Among Us adopts to instantiate a social environment where agents must both deceive and detect deception. CICERO demonstrated that LLMs can function in complex social-strategic games, reinforcing the viability of game-based evaluation for nuanced social behaviors. To detect deception, Among Us leverages two interpretability lines: Burns et al. showed that latent knowledge is linearly recoverable from internal activations, motivating logistic-regression probes for lying detection; Elhage et al.’s sparse autoencoders provide a mechanism to isolate interpretable features, which Among Us adapts to identify deception-related representations. Finally, model-written evaluations by Perez et al. contextualize observed behavioral shifts under RLHF; Among Us extends this by empirically charting a production–detection gap, finding RL-trained models are better at producing deception than recognizing it in others.",
  "analysis_timestamp": "2026-01-06T23:08:23.950108"
}