{
  "prior_works": [
    {
      "title": "CLEVR: A Diagnostic Dataset for Compositional Language and Elementary Visual Reasoning",
      "authors": "Justin Johnson et al.",
      "year": 2017,
      "role": "Foundation",
      "relationship_sentence": "ORIGAMISPACE adopts CLEVR’s diagnostic, multi-step compositional reasoning framing and extends it to visuospatial origami settings with explicit geometric constraints and intermediate supervision (folding process, compiled flat pattern)."
    },
    {
      "title": "MathVista: Evaluating Mathematical Reasoning in Visual Contexts",
      "authors": "Haozhe Lu et al.",
      "year": 2024,
      "role": "Gap Identification",
      "relationship_sentence": "MathVista revealed persistent weaknesses of MLLMs on visually grounded mathematics—especially geometry and precise quantitative reasoning—motivating ORIGAMISPACE’s origami-based tasks that couple spatial reasoning with strict mathematical constraints."
    },
    {
      "title": "GeoQA: A Geometric Question Answering Dataset for Solving Plane Geometry Problems",
      "authors": "Chen et al.",
      "year": 2021,
      "role": "Foundation",
      "relationship_sentence": "GeoQA formalized diagram-based geometric problem solving with mathematical constraints, a paradigm ORIGAMISPACE builds on by replacing standard geometry diagrams with crease patterns and adding executable CP code targets."
    },
    {
      "title": "UniGeo: Unifying Geometry Problem Solving with a Unified Meaning Representation",
      "authors": "Hong et al.",
      "year": 2023,
      "role": "Extension",
      "relationship_sentence": "ORIGAMISPACE extends UniGeo’s idea of generating structured, executable intermediate representations for geometry by introducing a domain-specific CP code and stepwise folding traces tailored to origami."
    },
    {
      "title": "GQA: A New Dataset for Real-World Visual Reasoning and Compositional Question Answering",
      "authors": "Drew A. Hudson et al.",
      "year": 2019,
      "role": "Related Problem",
      "relationship_sentence": "GQA’s emphasis on fine-grained spatial relationships informs ORIGAMISPACE’s dedicated Spatial Relationship Prediction task, adapted to the crease-pattern/folded-shape setting."
    },
    {
      "title": "Freeform Origami",
      "authors": "Tomohiro Tachi",
      "year": 2010,
      "role": "Foundation",
      "relationship_sentence": "Tachi’s formulation of rigid origami kinematics and folding sequences underpins ORIGAMISPACE’s notion of compiled flat patterns and canonical multi-step folding processes used for supervision and evaluation."
    }
  ],
  "synthesis_narrative": "ORIGAMISPACE’s core innovation—evaluating MLLMs on multi-step spatial reasoning under strict mathematical constraints using origami—emerges from two converging lines of work: diagnostic visual reasoning benchmarks and geometry-with-diagrams problem solving. CLEVR established the blueprint for controlled, multi-step compositional reasoning, which ORIGAMISPACE repurposes for visuospatial origami, adding structured intermediates like the folding process and compiled flat patterns. From the math-and-diagram side, GeoQA introduced the formulation of solving geometry with explicit visual constraints, while UniGeo showed that representing reasoning as an executable, structured program substantially clarifies and evaluates the reasoning process. ORIGAMISPACE directly extends these ideas by defining a domain-specific CP code and step-by-step folding traces that are executable and verifiable.\nMathVista exposed the current limitations of MLLMs on visually grounded quantitative and geometric problems, explicitly motivating a benchmark that fuses spatial reasoning with hard constraints and demands multi-step consistency. Complementing these, GQA’s focus on precise spatial relations informed ORIGAMISPACE’s Spatial Relationship Prediction task, ensuring that relational understanding is evaluated alongside procedural reasoning. Finally, Tachi’s Freeform Origami provides the geometric and kinematic foundations for representing crease patterns and folding sequences, enabling ORIGAMISPACE to define mathematically grounded supervision targets (compiled flat patterns, folding steps) and a code-generation endpoint. Together, these works directly shaped ORIGAMISPACE’s problem formulation, task design, and representation choices, yielding a benchmark that tests spatial reasoning, mathematical correctness, and end-to-end executable generation in a unified origami domain.",
  "analysis_timestamp": "2026-01-06T23:08:23.965995"
}