{
  "prior_works": [
    {
      "title": "Neural Combinatorial Optimization with Reinforcement Learning",
      "authors": "Irwan Bello et al.",
      "year": 2016,
      "role": "Foundation",
      "relationship_sentence": "This paper established the NCO paradigm—training neural policies to construct solutions to combinatorial problems—which our work seeks to interpret by probing the internal representations of such learned policies."
    },
    {
      "title": "Reinforcement Learning for Solving the Vehicle Routing Problem",
      "authors": "Mohammadreza Nazari et al.",
      "year": 2018,
      "role": "Foundation",
      "relationship_sentence": "It introduced the widely adopted NCO formulation for VRP (state representation, decoder policy, and RL training), directly providing the problem setup and model class that our probing tasks and analyses target."
    },
    {
      "title": "Attention, Learn to Solve Routing Problems!",
      "authors": "Wouter Kool et al.",
      "year": 2019,
      "role": "Baseline",
      "relationship_sentence": "The attention-based NCO architecture (AM) is a primary model we probe, and our analyses—including CS-Probing—explicitly examine its encoder/decoder representations to reveal inductive biases and information content."
    },
    {
      "title": "POMO: Policy Optimization with Multiple Optima for Reinforcement Learning",
      "authors": "Yeong-Dae Kwon et al.",
      "year": 2020,
      "role": "Baseline",
      "relationship_sentence": "POMO is a prevalent NCO baseline for routing that we directly analyze with our probing suite to compare how its training objective and sampling strategy shape learned representations."
    },
    {
      "title": "Understanding intermediate layers using linear classifier probes",
      "authors": "Guillaume Alain et al.",
      "year": 2016,
      "role": "Foundation",
      "relationship_sentence": "We build on the linear-probe methodology introduced here and extend it with our Coefficient Significance Probing (CS-Probing), which analyzes probe coefficients and their statistical significance rather than relying solely on predictive accuracy."
    },
    {
      "title": "Designing and Interpreting Probes with Control Tasks",
      "authors": "John Hewitt et al.",
      "year": 2019,
      "role": "Gap Identification",
      "relationship_sentence": "Their critique that probe accuracy can reflect probe capacity rather than representational content motivates our CS-Probing design, which emphasizes coefficient-level significance to separate genuine information from spurious fit."
    },
    {
      "title": "Information-Theoretic Probing for Linguistic Structure",
      "authors": "Tiago Pimentel et al.",
      "year": 2020,
      "role": "Gap Identification",
      "relationship_sentence": "By showing that conventional probe scores can be misleading without controlling for complexity and mutual information, this work directly motivates our statistical-significance focus to make probing conclusions robust for NCO representations."
    }
  ],
  "synthesis_narrative": "The core innovation of this paper is to open the black box of Neural Combinatorial Optimization (NCO) models via probing, and to introduce Coefficient Significance Probing (CS-Probing) for statistically grounded interpretability. This builds on two intertwined intellectual lineages. First, foundational NCO works—Bello et al. inaugurating neural policies for combinatorial optimization and Nazari et al. formulating the VRP within this paradigm—established the policy-construction setting and model classes our study interrogates. Among these, Kool et al.’s attention-based model and Kwon et al.’s POMO are the primary contemporary baselines whose encoder/decoder representations we directly probe, enabling us to attribute differences in inductive bias and information encoding to concrete architectural and training choices.\nSecond, our methodology stands on the probing literature. Alain & Bengio introduced linear classifier probes as a means to read out information from intermediate representations; we adopt this readout mechanism but extend it with a principled statistical layer. Specifically, critiques by Hewitt & Liang and Pimentel et al. demonstrated that raw probe accuracy can conflate probe capacity with representational content, urging more rigorous interpretability criteria. CS-Probing operationalizes this by examining probe coefficients and their statistical significance, shifting emphasis from mere prediction to which features of the representation reliably encode task-relevant signals. In synthesizing these lines, our work provides the first systematic, statistically grounded probing of NCO models, revealing both low-level construction cues and high-level decision knowledge encoded by leading VRP policies.",
  "analysis_timestamp": "2026-01-06T23:08:23.953529"
}