{
  "prior_works": [
    {
      "title": "PASCAL-Part: Object Part Annotations for the PASCAL VOC",
      "authors": "Sepehr Mottaghi et al.",
      "year": 2014,
      "role": "dataset",
      "relationship_sentence": "Provided one of the first widely used, object-specific semantic part annotations in 2D, directly seeding PARTONOMY’s emphasis on object-specific part taxonomies and pixel-level evaluation."
    },
    {
      "title": "PartImageNet: A Large-scale, High-quality Dataset of Object Parts",
      "authors": "Zheng et al.",
      "year": 2020,
      "role": "dataset",
      "relationship_sentence": "Established large-scale, fine-grained part segmentation across many categories; PARTONOMY builds on and unifies such resources while adding multimodal prompts, comparisons across objects, and justification requirements."
    },
    {
      "title": "PartNet: A Large-scale Benchmark for Fine-grained and Hierarchical Part-level 3D Object Understanding",
      "authors": "Kaichun Mo et al.",
      "year": 2019,
      "role": "dataset/benchmark",
      "relationship_sentence": "Introduced hierarchical partonomies and part-whole structure (in 3D); PARTONOMY adapts this hierarchical, part-whole reasoning paradigm to 2D images and LMM evaluation."
    },
    {
      "title": "Visual Genome: Connecting Language and Vision Using Crowdsourced Dense Image Annotations",
      "authors": "Ranjay Krishna et al.",
      "year": 2017,
      "role": "dataset",
      "relationship_sentence": "Its rich scene graphs with part-of relations informed PARTONOMY’s design of tasks that require part-whole reasoning and language grounding beyond mere naming of generic parts."
    },
    {
      "title": "RefCOCO, RefCOCO+, and RefCOCOg: Datasets for Referring Expression Comprehension",
      "authors": "Licheng Yu et al.",
      "year": 2016,
      "role": "dataset/benchmark",
      "relationship_sentence": "Pioneered language-to-region grounding; PARTONOMY extends this line to object-specific part grounding with pixel-level masks and cross-object comparisons, exposing LMM limitations at finer granularity."
    },
    {
      "title": "Segment Anything",
      "authors": "Alexander Kirillov et al.",
      "year": 2023,
      "role": "method/tool",
      "relationship_sentence": "Provided promptable, class-agnostic segmentation used by many segmentation-enabled LMMs; PARTONOMY evaluates whether such tools, when coupled with LLMs, truly achieve object-specific part grounding."
    },
    {
      "title": "LISA: Reasoning Segmentation via Large Language Models",
      "authors": "LISA authors et al.",
      "year": 2024,
      "role": "method/model",
      "relationship_sentence": "An early LLM+segmentation system directly evaluated in PARTONOMY; its poor gIoU on part grounding motivates and validates the need for a dedicated benchmark stressing technical, object-specific parts and justification."
    }
  ],
  "synthesis_narrative": "PARTONOMY’s core contribution—a rigorous benchmark for pixel-level, object-specific part grounding with part-whole reasoning and justification—emerges from three converging threads of prior work. First, classic part datasets laid the empirical foundation for object-specific parts. PASCAL-Part provided early 2D part annotations tightly coupled to object categories, while PartImageNet scaled fine-grained part segmentation across many classes. PartNet contributed a hierarchical view of parts and part-whole relations (albeit in 3D), shaping PARTONOMY’s emphasis on explicit partonomies and cross-object comparability. Second, language–vision grounding benchmarks demonstrated the value of natural language supervision but rarely demanded pixel-accurate, object-specific parts. Visual Genome’s part-of relations inspired PARTONOMY’s compositional reasoning dimension, and the RefCOCO family established language-to-region grounding that PARTONOMY elevates to part-level segmentation and inter-object comparisons with technical terminology. Third, the recent wave of segmentation-enabled LMMs created both opportunity and urgency. Segment Anything enabled promptable masks that many LMMs rely on, yet it is category-agnostic and not tailored to object-specific part semantics. LISA exemplified coupling LLM reasoning with segmentation, but its weak performance on PARTONOMY underscores a gap: current LMM pipelines cannot reliably map precise, technical part descriptions to pixel-accurate masks and justify predictions. By unifying and extending part datasets, encoding hierarchical part-whole structure, and enforcing language-grounded, mask-based justification, PARTONOMY crystallizes these lines of work into a focused stress test for part-level multimodal understanding.",
  "analysis_timestamp": "2026-01-07T00:05:12.526573"
}