{
  "prior_works": [
    {
      "title": "Nonnegative Decomposition of Multivariate Information",
      "authors": "Paul L. Williams, Randall D. Beer",
      "year": 2010,
      "role": "Foundational framework",
      "relationship_sentence": "Introduced Partial Information Decomposition (PID) and the redundancy lattice that Jansma directly reuses, replacing observational information with interventional causal quantities while preserving the lattice-based semantics of redundant, unique, and synergistic components."
    },
    {
      "title": "A Bivariate Measure of Redundant Information",
      "authors": "Malte Harder, Christoph Salge, Daniel Polani",
      "year": 2013,
      "role": "Redundancy semantics in PID",
      "relationship_sentence": "Clarified the axioms and interpretation of redundancy in PID, informing how Jansma defines and constrains the ‘redundant causal power’ term within an interventional decomposition."
    },
    {
      "title": "Quantifying Unique Information",
      "authors": "Nils Bertschinger, Johannes Rauh, Eckehard Olbrich, Jürgen Jost, Nihat Ay",
      "year": 2014,
      "role": "Unique information formalization",
      "relationship_sentence": "Provided an operational account of unique information that guides Jansma’s definition of ‘unique causal power’, ensuring the interventional components satisfy consistency and monotonicity properties analogous to BROJA-style PID."
    },
    {
      "title": "Causality: Models, Reasoning, and Inference (2nd ed.)",
      "authors": "Judea Pearl",
      "year": 2009,
      "role": "Interventional causal calculus",
      "relationship_sentence": "Supplies the do-operator and interventional/structural causal framework that Jansma leverages to argue for an interventional (rather than observational) decomposition of causal effects."
    },
    {
      "title": "Information Flow in Causal Networks",
      "authors": "Nihat Ay, Daniel Polani",
      "year": 2008,
      "role": "Information-theoretic causal effect",
      "relationship_sentence": "Established information measures grounded in interventions, providing a template for defining ‘causal power’ that Jansma decomposes into redundant, unique, and synergistic parts."
    },
    {
      "title": "Measuring Multivariate Redundant Information with Pointwise Common Surprisal",
      "authors": "Robin A. A. Ince",
      "year": 2017,
      "role": "Lattice/Möbius-based decompositions",
      "relationship_sentence": "Demonstrated practical PID via lattice-based Möbius inversion and local (pointwise) measures—techniques Jansma extends to the interventional setting and applies to logic gates and dynamical systems."
    },
    {
      "title": "On the Foundations of Combinatorial Theory I: Theory of Möbius Functions",
      "authors": "Gian-Carlo Rota",
      "year": 1964,
      "role": "Mathematical backbone (Möbius inversion on lattices)",
      "relationship_sentence": "Provides the Möbius inversion machinery on posets that underlies Jansma’s closed-form lattice inversion over the redundancy lattice to obtain interventional causal components."
    }
  ],
  "synthesis_narrative": "Jansma’s core contribution—an interventional decomposition of causal effects into redundant, unique, and synergistic components—sits squarely at the intersection of PID and causal inference. The structural backbone comes from Williams and Beer’s PID and redundancy lattice, which define how multivariate influence can be partitioned into qualitatively distinct pieces. Harder–Salge–Polani’s redundancy measure and Bertschinger et al.’s operationalization of unique information refine the axioms and meaning of these components, ensuring that the decomposition adheres to coherent semantics when transferred from observational to causal settings.\nOn the causal side, Pearl’s interventional calculus motivates replacing observational information with do-interventions as the primitive notion of causal effect, addressing Jansma’s argument that a proper causal decomposition must be interventional. Ay and Polani’s information-theoretic treatment of causal influence supplies concrete, intervention-based quantities that can be decomposed.\nMathematically, the work relies on Möbius inversion over the redundancy lattice to isolate redundant, unique, and synergistic terms. Rota’s theory of Möbius functions on posets supplies the algebraic engine, while Ince’s lattice/Möbius methodology and local measures demonstrate how to carry out such decompositions in practice and analyze systems like logic gates. By fusing these strands—PID semantics, interventional causality, and lattice-based Möbius inversion—Jansma derives an interventional PID that reveals how causal power is distributed and combined across variables, and shows its context- and parameter-dependence in complex systems such as logic gates, cellular automata, and chemical reaction networks.",
  "analysis_timestamp": "2026-01-07T00:21:32.322120"
}