{
  "prior_works": [
    {
      "title": "Bayesian Inverse Reinforcement Learning",
      "authors": "Deepak Ramachandran, Eyal Amir",
      "year": 2007,
      "role": "Conceptual foundation (reward uncertainty)",
      "relationship_sentence": "PSD’s requirement to dominate across a range of reward functions echoes Bayesian IRL’s explicit treatment of posterior uncertainty over reward functions, but PSD operationalizes this uncertainty via stochastic dominance constraints rather than posterior inference."
    },
    {
      "title": "Maximum Entropy Inverse Reinforcement Learning",
      "authors": "Brian D. Ziebart, Andrew Maas, J. Andrew Bagnell, Anind K. Dey",
      "year": 2008,
      "role": "Conceptual/theoretical foundation (distributional imitation)",
      "relationship_sentence": "MaxEnt IRL’s distributional view of expert behavior and emphasis on support/entropy informs PSD’s pluralistic goal, while PSD departs from feature-expectation matching to enforce dominance over return distributions."
    },
    {
      "title": "Generative Adversarial Imitation Learning",
      "authors": "Jonathan Ho, Stefano Ermon",
      "year": 2016,
      "role": "Baseline/problem framing (occupancy matching)",
      "relationship_sentence": "GAIL’s expectation-driven occupancy matching crystallizes the limitation PSD addresses—matching in expectation can collapse distinct modes—prompting PSD’s dominance-based objective that preserves pluralistic support."
    },
    {
      "title": "InfoGAIL: Interpretable Imitation Learning from Visual Demonstrations",
      "authors": "Yunzhu Li, Jiaming Song, Stefano Ermon",
      "year": 2017,
      "role": "Methodological precursor (multimodal imitation)",
      "relationship_sentence": "InfoGAIL demonstrates the need to capture multiple qualitatively distinct behaviors; PSD offers a principled alternative by guaranteeing support-level pluralism via stochastic dominance instead of latent-variable MI heuristics."
    },
    {
      "title": "A Distributional Perspective on Reinforcement Learning",
      "authors": "Marc G. Bellemare, Will Dabney, Rémi Munos",
      "year": 2017,
      "role": "Theoretical tool (return distributions)",
      "relationship_sentence": "Distributional RL’s modeling of return distributions underpins PSD’s shift from expected returns to stochastic dominance comparisons over return distributions induced by different reward functions."
    },
    {
      "title": "Primal Wasserstein Imitation Learning",
      "authors": "S. Dadashi, L. Hussenot, M. Geist, O. Pietquin",
      "year": 2021,
      "role": "Methodological tool (optimal transport for imitation)",
      "relationship_sentence": "PWIL’s use of optimal transport to align learner and expert samples directly informs PSD’s trajectory-pair matching; PSD extends this by aligning policy support to demonstrations in service of dominance guarantees."
    },
    {
      "title": "Sinkhorn Distances: Lightspeed Computation of Optimal Transport",
      "authors": "Marco Cuturi",
      "year": 2013,
      "role": "Computational tool (scalable OT)",
      "relationship_sentence": "PSD’s OT-based objective over trajectory pairs is made practical by entropic regularization and Sinkhorn iterations, enabling efficient support matching between policy samples and demonstrations."
    }
  ],
  "synthesis_narrative": "Pluralistic Stochastic Dominance (PSD) reframes imitation learning to ensure that an imitator supports the full diversity of demonstrated behaviors while outperforming or matching them under broad reward uncertainty. This reorientation grows from two converging lines of prior work. First, Bayesian IRL and Maximum Entropy IRL established principled ways to reason under reward uncertainty and to model expert behavior distributionally, but they typically enforce matching in expectation or via feature moments. GAIL further popularized expectation-driven occupancy matching, crystallizing a limitation: such objectives can collapse distinct modes of behavior. InfoGAIL showed one practical remedy—introducing latent variables and mutual information to uncover multiple modes—but without guarantees about reward-sensitive performance. The second line concerns learning and comparing full return distributions. Distributional RL introduced return-distribution modeling, providing the substrate on which PSD defines stochastic dominance criteria, thereby moving beyond expectations to order entire distributions across a set of candidate reward functions. To operationalize pluralistic support alignment, PSD leverages optimal transport. Building on Primal Wasserstein Imitation Learning’s insight to align expert and learner samples with OT, PSD extends matching to trajectory pairs and focuses on policy support to preserve qualitative diversity. Finally, computationally, Sinkhorn’s entropic OT enables scalable alignment across many trajectories, making PSD’s dominance-based objective tractable. Together, these works directly shaped PSD’s core contribution: a distributional, OT-grounded imitation objective that guarantees pluralistic behavior via stochastic dominance over uncertain rewards.",
  "analysis_timestamp": "2026-01-07T00:21:32.333149"
}