{
  "prior_works": [
    {
      "title": "Multiple-frequency range imaging using amplitude-modulated continuous-wave lidar",
      "authors": "Jonathan G. Godbaz; Michael J. Cree; Adrian A. Dorrington",
      "year": 2012,
      "role": "AMCW iToF phase unwrapping via frequency diversity",
      "relationship_sentence": "Established that combining measurements across multiple modulation frequencies extends the unambiguous range (via CRT-style unwrapping), directly motivating BE-ToF’s idea of encoding a long effective period so phase can be estimated without wrapping."
    },
    {
      "title": "Resolving Multipath Interference in Time-of-Flight Imaging using Modulation Frequency Diversity",
      "authors": "A. Bhandari; A. Kadambi; R. Raskar",
      "year": 2014,
      "role": "Coded/modulation diversity for robust iToF",
      "relationship_sentence": "Showed that judicious selection of multiple modulation frequencies and frequency-domain reasoning can robustify iToF measurements, informing BE-ToF’s shift from single-frequency phase to a richer, code-diverse burst whose global phase can be robustly inferred."
    },
    {
      "title": "Fourier Domain Time-of-Flight Imaging",
      "authors": "Mohit Gupta; Amit Agrawal; Ashok Veeraraghavan",
      "year": 2015,
      "role": "Frequency-domain formulation of iToF",
      "relationship_sentence": "Provided a Fourier/phasor view linking temporal illumination codes to phase estimation and ambiguity, underpinning BE-ToF’s strategy to infer phase over an extended coded burst rather than per-cycle, thereby mitigating phase wrapping at long range."
    },
    {
      "title": "Separating true range and amplitude in AMCW lidar using pseudorandom codes",
      "authors": "Adrian A. Dorrington; Jonathan G. Godbaz; Michael J. Cree; et al.",
      "year": 2011,
      "role": "Pseudo-random/coded waveforms for ToF",
      "relationship_sentence": "Demonstrated that long-period pseudo-random sequences and matched filtering improve SNR and ambiguity handling, inspiring BE-ToF’s burst-encodable illumination and correlation-based estimation over an entire burst period."
    },
    {
      "title": "Learning Sensor Multiplexing Design Through Back-Propagation",
      "authors": "Ayan Chakrabarti",
      "year": 2016,
      "role": "End-to-end learnable capture–reconstruction co-design",
      "relationship_sentence": "Pioneered differentiable co-optimization of sensor coding and inference, directly influencing BE-ToF’s end-to-end framework that jointly optimizes burst codes and the reconstruction network for high-SNR long-distance depth."
    },
    {
      "title": "Burst Photography for High Dynamic Range and Low-Light Imaging",
      "authors": "Samuel W. Hasinoff; Dillon Sharlet; Ryan Geiss; Andrew Adams; Richard Szeliski; Kari Pulli; Marc Levoy; Frédo Durand",
      "year": 2016,
      "role": "Burst imaging to boost SNR and fidelity",
      "relationship_sentence": "Showed that aggregating coded bursts significantly improves SNR and fidelity in photon-starved regimes, a principle BE-ToF adapts to depth sensing by encoding and jointly reconstructing across a burst to combat distance-induced attenuation."
    }
  ],
  "synthesis_narrative": "BE-ToF’s key contribution—encoding illumination as a learnable burst and estimating phase over the entire burst to avoid iToF phase wrapping while boosting SNR—stands on two converging lines of prior work. On the iToF side, multi-frequency and frequency-domain analyses (Godbaz–Cree–Dorrington; Bhandari–Kadambi–Raskar; Gupta–Agrawal–Veeraraghavan) formalized how phase ambiguity arises and how modulation diversity or Fourier representations can extend unambiguous range and improve robustness. These works seeded the central idea that range can be disambiguated by observing signals over longer or richer effective periods rather than a single sinusoidal cycle. In parallel, coding strategies from AMCW/ToF that use long-period pseudo-random sequences (Dorrington and colleagues) demonstrated the practical SNR and ambiguity benefits of code design plus matched filtering—foreshadowing BE-ToF’s correlation over a burst window.\nA second thread is end-to-end co-design of capture and inference. Chakrabarti’s differentiable sensor multiplexing showed that jointly optimizing codes with reconstruction yields task-specific gains, which BE-ToF adopts to learn burst patterns and a reconstruction network tailored to long-range, low-photon conditions. Finally, burst photography (Hasinoff et al.) established that aggregating short exposures markedly improves SNR and fidelity in low light; BE-ToF translates this to depth by using a burst-encodable illumination and joint estimation that integrates weak returns over time. Together, these works directly inform BE-ToF’s distinctive combination of burst coding, phase-over-burst estimation, and end-to-end learnable design for high-fidelity, long-distance depth sensing.",
  "analysis_timestamp": "2026-01-07T00:21:33.150272"
}