{
  "prior_works": [
    {
      "title": "Outrageously Large Neural Networks: The Sparsely-Gated Mixture-of-Experts Layer",
      "authors": "Noam Shazeer, Azalia Mirhoseini, Krzysztof Maziarz, Andy Davis, Quoc V. Le, Geoffrey Hinton, Jeff Dean",
      "year": 2017,
      "role": "Algorithmic foundation of MoE",
      "relationship_sentence": "Established the modular expert-and-gating formulation and sparse token-to-expert routing that Mozart preserves and exploits by mapping experts to chiplets and orchestrating token streams across hardware modules."
    },
    {
      "title": "GShard: Scaling Giant Models with Conditional Computation and Automatic Sharding",
      "authors": "Dmitry Lepikhin et al.",
      "year": 2020,
      "role": "Distributed MoE with expert parallelism and all-to-all",
      "relationship_sentence": "Formalized expert parallelism and the all-to-all token exchange pattern; Mozart’s expert allocation explicitly reshapes this all-to-all to remain on‑package, reducing off‑package traffic and aligning routing with chiplet topology."
    },
    {
      "title": "Switch Transformers: Scaling to Trillion Parameter Models with Simple and Efficient Sparsity",
      "authors": "William Fedus, Barret Zoph, Noam Shazeer",
      "year": 2021,
      "role": "Routing simplification and load balancing for MoE",
      "relationship_sentence": "Showed that top‑1 routing and capacity management make MoE practical at scale; Mozart’s fine‑grained streaming leverages such sparse, capacity‑constrained routing to pipeline tokens and experts and improve overlap."
    },
    {
      "title": "DeepSpeed-MoE: Advancing Mixture-of-Experts Inference and Training with System Innovations",
      "authors": "Samyam Rajbhandari, Jeff Rasley, Olatunji Ruwase, Yuxiong He",
      "year": 2021,
      "role": "System-level MoE scaling with hierarchical all-to-all and overlap",
      "relationship_sentence": "Introduced hierarchical all‑to‑all, optimized token dispatchers, and comm‑compute overlap; Mozart adapts these ideas to a chiplet NoP by making the hierarchy physical (on‑package vs off‑package) and scheduling for on‑fabric overlap."
    },
    {
      "title": "Tutel: High-Performance Mixture-of-Experts Distributed Training",
      "authors": "Zhengda Jia et al.",
      "year": 2022,
      "role": "Runtime/dispatcher optimizations and fused MoE kernels",
      "relationship_sentence": "Demonstrated that efficient token packing, fused dispatch/combine, and topology-aware routing are critical; Mozart extends this with token/expert streaming schedules that fuse and pipeline across chiplet boundaries on the NoP."
    },
    {
      "title": "MegaBlocks: Efficient Mixture-of-Experts Training with Universal Block-Sparse Operations",
      "authors": "Lewis Tunstall et al. (MosaicML)",
      "year": 2023,
      "role": "Block-sparse compute and utilization for MoE",
      "relationship_sentence": "Showed that organizing tokens/experts into structured blocks improves utilization and reduces overhead; Mozart’s fine-grained scheduling exploits similar block-structured transfers to maximize compute–communication overlap on chiplets."
    },
    {
      "title": "The Cerebras Wafer-Scale Engine: A Platform for Deep Learning",
      "authors": "Andrew Feldman, Sean Lie, et al.",
      "year": 2021,
      "role": "Wafer-scale accelerator and on-wafer communication fabric",
      "relationship_sentence": "Established the benefits of wafer-scale integration and localized communication for DL workloads; Mozart’s 3.5D chiplet design and 2.5D NoP-Tree build on these principles to co-locate heterogeneous modules and confine MoE traffic on-package."
    }
  ],
  "synthesis_narrative": "Mozart’s key contribution—an algorithm–hardware co-design that confines MoE all-to-all within a 3.5D wafer-scale chiplet package and overlaps communication with computation via token/expert streaming—sits at the intersection of two lines of prior work. On the algorithmic and systems side, Shazeer et al. defined the sparse, modular expert paradigm, while GShard operationalized expert parallelism and its signature all-to-all exchange. Switch Transformers demonstrated that simplified (top-1) routing with capacity management can make sparse dispatch efficient, shaping the traffic patterns that Mozart ultimately pipelines. DeepSpeed-MoE and Tutel then pushed the MoE runtime forward with hierarchical all-to-all, fused dispatch/combine, and topology-aware token packing, directly informing Mozart’s expert placement and its fine-grained, streaming scheduler that maximizes compute–communication overlap. Complementing these, MegaBlocks showed that structured, block-sparse organization improves utilization—an idea Mozart echoes when structuring token/expert streams to match chiplet granularities. On the hardware side, the Cerebras Wafer-Scale Engine established the efficacy of wafer-scale integration and localized fabrics for deep learning, motivating Mozart’s 3.5D approach that marries a 2.5D network-on-package tree with vertically integrated memory/logic to co-locate heterogeneous modules. Together, these works converge in Mozart: it physically grounds MoE’s modularity by aligning experts to chiplets, transforms logical hierarchical all-to-all into on-package NoP-tree exchanges, and uses streaming schedules inspired by MoE runtimes to fully exploit the wafer-scale chiplet fabric.",
  "analysis_timestamp": "2026-01-07T00:05:12.549528"
}