{
  "prior_works": [
    {
      "title": "Language Models as Knowledge Bases?",
      "authors": "Fabio Petroni et al.",
      "year": 2019,
      "arxiv_id": "1909.01066",
      "role": "Foundation",
      "relationship_sentence": "It formulated factual recall in LMs via cloze-style probes and popularized the view that parameters store factual associations, which this paper adopts as the evaluation starting point before questioning whether such recall equates to 'knowledge'."
    },
    {
      "title": "Transformer Feed-Forward Layers Are Key-Value Memories",
      "authors": "Mor Geva et al.",
      "year": 2021,
      "arxiv_id": null,
      "role": "Inspiration",
      "relationship_sentence": "It argued MLP feed-forward layers implement key–value memory that stores token-level associations, the precise mechanistic premise this paper scrutinizes by testing whether the same mechanism also mediates syntactic and other linguistic behaviors."
    },
    {
      "title": "Knowledge Neurons in Pretrained Transformers",
      "authors": "Dai et al.",
      "year": 2022,
      "arxiv_id": null,
      "role": "Foundation",
      "relationship_sentence": "It introduced 'knowledge neurons' and a localization-and-editing procedure in MLPs, which this paper directly reuses to edit non-factual linguistic phenomena to probe the scope and limits of the knowledge-neuron thesis."
    },
    {
      "title": "ROME: Locating and Editing Factual Associations in GPT",
      "authors": "Kevin Meng et al.",
      "year": 2022,
      "arxiv_id": "2202.05262",
      "role": "Baseline",
      "relationship_sentence": "It provided a causal weight-editing method targeting MLP key–value pairs (and the CounterFact evaluation), which this paper adopts as a primary editing baseline to show that identical interventions also alter syntactic behavior."
    },
    {
      "title": "MEMIT: Mass-Editing Memory in a Transformer",
      "authors": "Kevin Meng et al.",
      "year": 2023,
      "arxiv_id": null,
      "role": "Baseline",
      "relationship_sentence": "It scaled ROME-style edits to many facts with layer-wise linear updates, a technique this paper benchmarks to demonstrate that mass MLP edits likewise modulate linguistic competence, challenging a 'facts-only' interpretation."
    },
    {
      "title": "Zero-Shot Relation Extraction via Reading Comprehension (ZSRE)",
      "authors": "Omer Levy et al.",
      "year": 2017,
      "arxiv_id": null,
      "role": "Foundation",
      "relationship_sentence": "It supplies a standardized factual QA benchmark and evaluation protocol for post-edit behavior, which this paper uses to contrast factual editing outcomes with changes in linguistic phenomena."
    },
    {
      "title": "BLiMP: A Benchmark of Linguistic Minimal Pairs for English",
      "authors": "Alex Warstadt et al.",
      "year": 2020,
      "arxiv_id": null,
      "role": "Foundation",
      "relationship_sentence": "It created controlled minimal-pair tests of formal grammatical competence, providing the syntactic diagnostics this paper uses to quantify how KN/ROME-style edits affect non-factual linguistic behavior."
    }
  ],
  "synthesis_narrative": "Early evidence that language models store retrievable factual associations came from cloze-style probing, where parameters appeared to encode facts that could be recalled without explicit databases. Complementing this, work on the internal mechanics of transformers argued that feed-forward layers act as key–value memories, suggesting a concrete locus and mechanism by which such associations are represented. Building on these ideas, the knowledge neuron line of work operationalized the thesis by proposing methods to localize and directly edit neurons thought to store facts in MLP modules. Concurrently, causal intervention approaches such as ROME introduced precise weight-editing procedures targeting MLP key–value pairs, alongside factual evaluation resources like CounterFact, and later scaled to mass editing via MEMIT. Factual QA datasets such as ZSRE standardized how to measure whether an edit succeeds or generalizes, while BLiMP’s minimal-pair diagnostics provided controlled probes of formal grammatical competence across many syntactic phenomena. Together, these works supplied both the mechanistic hypothesis—that MLPs store factual knowledge—and the toolchain and benchmarks for intervening and evaluating edits. The natural open question, given the causal-editing tools and linguistic diagnostics, was whether the same MLP-targeted edits that alter factual recall are specific to “knowledge” or instead modulate broader linguistic competence. This paper synthesizes the editing protocols with syntactic evaluations to reveal that identical interventions systematically affect non-factual linguistic behavior, exposing a central limitation in the knowledge-neuron thesis and reframing what these edits truly control.",
  "target_paper": {
    "title": "What does the Knowledge Neuron Thesis Have to do with Knowledge?",
    "authors": "Jingcheng Niu, Andrew Liu, Zining Zhu, Gerald Penn",
    "conference": "ICLR",
    "year": 2024,
    "presentation_type": "spotlight",
    "keywords": "language model, knowledge neuron, model editing, formal and function competence, syntax, fact",
    "abstract": "We reassess the Knowledge Neuron (KN) Thesis: an interpretation of the mechanism underlying the ability of large language models to recall facts from a training corpus. This nascent thesis proposes that facts are recalled from the training corpus through the MLP weights in a manner resembling key-value memory, implying in effect that \"knowledge\" is stored in the network. Furthermore, by modifying the MLP modules, one can control the language model's generation of factual information. The plausibility of the KN thesis has been demonstrated by the success of KN-inspired model editing methods (Dai et al., 2022; Meng et al., 2022).\n\nWe find that this thesis is, at best, an oversimplification. Not only have we found that we can edit the expression of certain linguistic phenomena using the same model editing methods but, through a more comprehensive evaluation, we have found that the KN thesis does not adequately explain the process of factual expression. While it is possible to argue that t",
    "openreview_id": "2HJRwwbV3G",
    "forum_id": "2HJRwwbV3G"
  },
  "analysis_timestamp": "2026-01-06T18:34:36.596212"
}