{
  "prior_works": [
    {
      "title": "Representation Learning with Contrastive Predictive Coding",
      "authors": "Aäron van den Oord et al.",
      "year": 2018,
      "arxiv_id": "1807.03748",
      "role": "Foundation",
      "relationship_sentence": "This work introduced the temporal InfoNCE objective that the paper formalizes and analyzes, providing the precise temporal contrastive learning setup whose ability to recover latent MDP state under i.i.d. noise is theoretically bounded here."
    },
    {
      "title": "CURL: Contrastive Unsupervised Representations for Reinforcement Learning",
      "authors": "Aravind Srinivas et al.",
      "year": 2020,
      "arxiv_id": "2004.04136",
      "role": "Baseline",
      "relationship_sentence": "CURL instantiated CPC-style temporal contrastive pretraining for pixel-based RL, serving as the primary empirical baseline class whose objective the paper studies and explains with provable guarantees and failure modes."
    },
    {
      "title": "World Models",
      "authors": "David Ha et al.",
      "year": 2018,
      "arxiv_id": "1803.10122",
      "role": "Baseline",
      "relationship_sentence": "World Models established autoencoding plus forward (latent dynamics) modeling for control from video, directly motivating the paper’s analysis of when reconstruction and forward prediction can or cannot learn the latent MDP state."
    },
    {
      "title": "Dream to Control: Learning Behaviors by Latent Imagination (Dreamer)",
      "authors": "Danijar Hafner et al.",
      "year": 2020,
      "arxiv_id": "1912.01603",
      "role": "Baseline",
      "relationship_sentence": "Dreamer operationalized forward modeling with reconstruction for visual control, and the paper analyzes this forward-modeling paradigm to derive upper bounds under i.i.d. noise and characterize failures with exogenous noise."
    },
    {
      "title": "R3M: A Universal Visual Representation for Robot Manipulation",
      "authors": "Ashvin Nair et al.",
      "year": 2022,
      "arxiv_id": "2203.12601",
      "role": "Gap Identification",
      "relationship_sentence": "R3M’s empirical success with temporal contrastive pretraining on large-scale internet videos motivates the paper’s core question and theory: when does temporal contrastive video pretraining actually recover task-relevant latent state, especially in the presence of distractors?"
    },
    {
      "title": "A Theoretical Analysis of Contrastive Unsupervised Representation Learning",
      "authors": "Aaditya Saunshi et al.",
      "year": 2019,
      "arxiv_id": "1902.09229",
      "role": "Extension",
      "relationship_sentence": "This paper’s generalization bounds for contrastive learning provide the theoretical machinery that is extended to the temporal/video and latent-MDP setting to prove upper bounds for temporal contrastive objectives used in video pretraining."
    },
    {
      "title": "Curiosity-driven Exploration by Self-supervised Prediction",
      "authors": "Deepak Pathak et al.",
      "year": 2017,
      "arxiv_id": "1705.05363",
      "role": "Gap Identification",
      "relationship_sentence": "By diagnosing the 'noisy-TV' failure of prediction-based objectives in the presence of exogenous stochastic processes, this work directly motivates the paper’s formal exogenous-noise model and analysis of why forward/contrastive objectives can fail."
    }
  ],
  "synthesis_narrative": "Contrastive Predictive Coding introduced a temporal InfoNCE objective that aligns nearby time steps while separating negatives, crystallizing the modern temporal contrastive formulation used to learn video representations. CURL adapted this CPC-style loss to pixel-based reinforcement learning, demonstrating that contrastive video pretraining can yield strong policy learning and establishing a canonical objective-architecture regime. In parallel, World Models coupled autoencoding with latent forward prediction to learn compact dynamics from video, while Dreamer strengthened this paradigm by training latent dynamics models with reconstruction to plan and control from pixels. R3M scaled temporal contrastive pretraining to large internet video corpora for manipulation, showcasing robust downstream control gains and highlighting the promise of video-only pretraining. On the theory side, Saunshi et al. provided generalization guarantees for contrastive learning under multi-view assumptions, offering tools to reason about risk bounds for contrastive objectives. Complementarily, Pathak et al. revealed the “noisy-TV” pitfall: predictive objectives can be hijacked by exogenous stochasticity unrelated to control, foreshadowing failures in realistic videos with temporally correlated distractors. Together, these works posed an open question: under what precise conditions do autoencoding, temporal contrastive, and forward modeling from videos recover the latent MDP state relevant for control? The current paper synthesizes CPC-style temporal contrastive objectives, forward modeling practices from World Models/Dreamer, and contrastive learning theory to derive upper bounds under i.i.d. noise and to formalize exogenous temporally correlated noise that induces failure. This yields principled conditions and limitations for video pretraining, theoretically grounding recent empirical successes while explaining their brittleness to distractors.",
  "target_paper": {
    "title": "Towards Principled Representation Learning from Videos for Reinforcement Learning",
    "authors": "Dipendra Misra, Akanksha Saran, Tengyang Xie, Alex Lamb, John Langford",
    "conference": "ICLR",
    "year": 2024,
    "presentation_type": "spotlight",
    "keywords": "Reinforcement Learning, Representation Learning",
    "abstract": "We study pre-training representations for decision-making using video data, which is abundantly available for tasks such as game agents and software testing. Even though significant empirical advances have been made on this problem, a theoretical understanding remains absent. We initiate the theoretical investigation into principled approaches for representation learning and focus on learning the latent state representations of the underlying MDP using video data. We study two types of settings: one where there is iid noise in the observation, and a more challenging setting where there is also the presence of exogenous noise, which is non-iid noise that is temporally correlated, such as the motion of people or cars in the background. We study three commonly used approaches: autoencoding, temporal contrastive learning, and forward modeling. We prove upper bounds for temporal contrastive learning and forward modeling in the presence of only iid noise. We show that these approaches can le",
    "openreview_id": "3mnWvUZIXt",
    "forum_id": "3mnWvUZIXt"
  },
  "analysis_timestamp": "2026-01-06T10:40:54.620276"
}