{
  "prior_works": [
    {
      "title": "Optimal Memorization with ReLU Neural Networks",
      "authors": "Lijia Yu et al.",
      "year": 2023,
      "arxiv_id": "unknown",
      "role": "Extension",
      "relationship_sentence": "This prior work gave an explicit O(Nn)-parameter ReLU construction for exact (non-robust) memorization of any finite dataset, which the current paper directly extends by redesigning the construction to control Lipschitz constants and achieve optimal robust memorization."
    },
    {
      "title": "The Expressive Power of Neural Networks: A View from the Width",
      "authors": "Zhou Lu et al.",
      "year": 2017,
      "arxiv_id": "1709.02540",
      "role": "Foundation",
      "relationship_sentence": "Its width-based expressivity results (e.g., minimal width n+1 phenomena for nontrivial functions) underpin the paper’s lower-bound arguments on the network width required for optimal robust memorization in n dimensions."
    },
    {
      "title": "Approximating Continuous Functions by ReLU Nets of Minimal Width",
      "authors": "Boris Hanin et al.",
      "year": 2017,
      "arxiv_id": "1710.11278",
      "role": "Foundation",
      "relationship_sentence": "The minimal-width and topological constraints identified here are used as technical building blocks to derive the paper’s width lower bounds when robustness constraints are imposed."
    },
    {
      "title": "Spectrally-Normalized Margin Bounds for Neural Networks",
      "authors": "Peter L. Bartlett et al.",
      "year": 2017,
      "arxiv_id": "1706.08498",
      "role": "Inspiration",
      "relationship_sentence": "By explicitly linking classifier margins and Lipschitz/spectral norms, this work motivates the paper’s use of Lipschitz control to certify robustness up to budgets tied to the data’s separation bound."
    },
    {
      "title": "Training a 3-Node Neural Network is NP-Complete",
      "authors": "Avrim Blum et al.",
      "year": 1993,
      "arxiv_id": null,
      "role": "Foundation",
      "relationship_sentence": "This classic NP-completeness template for training small neural networks is adapted to establish the paper’s NP-hardness results for computing ReLU networks that achieve robust memorization under structural constraints."
    },
    {
      "title": "Certified Adversarial Robustness via Randomized Smoothing",
      "authors": "Jeremy M. Cohen et al.",
      "year": 2019,
      "arxiv_id": "1902.02918",
      "role": "Related Problem",
      "relationship_sentence": "As a leading certification approach that formalizes robustness radii, it frames the robustness objective and highlights the gap that the paper fills by giving worst-case, constructive robust memorization up to half the separation bound without stochastic smoothing."
    }
  ],
  "synthesis_narrative": "Yu, Gao, and Zhang previously provided an explicit two-layer ReLU design with O(Nn) parameters that exactly interpolates any finite dataset, establishing constructive, size-optimal memorization without robustness guarantees. Lu et al. showed that width governs expressivity and identified fundamental minimal-width thresholds (on the order of the input dimension), while Hanin and Sellke refined minimal-width constraints and topological limitations for ReLU networks; together these width results delineate hard limits any construction must respect. Bartlett, Foster, and Telgarsky connected margins to Lipschitz/spectral control, formalizing how Lipschitz constants certify stability around data and paving the way to tie robust radii to geometric separation. Blum and Rivest’s NP-completeness proof for training small neural networks offers a reduction template demonstrating intrinsic computational intractability of certain training targets. Cohen, Rosenfeld, and Kolter’s randomized smoothing crystallized the notion of certified radii, highlighting certification goals but through stochastic means rather than exact worst-case constructions.\n\nAgainst this backdrop, the synthesis was natural: explicit, size-optimal memorization constructions could, in principle, be upgraded to guarantee robustness if their Lipschitz properties were controlled relative to the dataset’s separation. The width limitations clarified what architectures could possibly achieve such guarantees, and classic NP-hardness templates suggested the right reductions to capture the computational barrier of robust memorization. The result is a constructive, parameter-efficient ReLU architecture that achieves robustness up to half the separation bound, alongside matching width lower bounds and NP-hardness results, closing the gap between memorization expressivity and certified robustness.",
  "target_paper": {
    "title": "OPTIMAL ROBUST MEMORIZATION WITH RELU NEURAL NETWORKS",
    "authors": "Lijia Yu, Xiao-Shan Gao, Lijun Zhang",
    "conference": "ICLR",
    "year": 2024,
    "presentation_type": "spotlight",
    "keywords": "Memorization, expressive power of network, optimal robust memorization, computation complexity, Lipschitz constant",
    "abstract": "Memorization with neural networks is to study the expressive power of neural networks to interpolate a finite classification data set, which is closely related to the generalizability of deep learning. However, the important problem of robust memorization has not been thoroughly studied. In this paper, several basic problems about robust memorization are solved. First, we prove that it is NP-hard to compute neural networks with certain simple structures, which are robust memorization. A network hypothesis space is called optimal robust memorization for a data set if it can achieve robust memorization for any budget less than half the separation bound of the data set. Second, we explicitly construct neural networks with O(N n) parameters for optimal robust memorization of any data set with dimension n and size N . We also give a lower bound for the width of networks to achieve optimal robust memorization. Finally, we explicitly construct neural networks with\nO(N n log n) parameters for ",
    "openreview_id": "47hDbAMLbc",
    "forum_id": "47hDbAMLbc"
  },
  "analysis_timestamp": "2026-01-06T12:18:59.226758"
}