{
  "prior_works": [
    {
      "title": "Score-Based Generative Modeling through Stochastic Differential Equations",
      "authors": "Yang Song et al.",
      "year": 2020,
      "arxiv_id": "arXiv:2011.13456",
      "role": "Extension",
      "relationship_sentence": "This work provides the SDE-based generative framework and reverse-time sampling that SDE-EDG directly adapts to synthesize continuous-interpolated samples between sparse timestamps for constructing an infinitely fine-grained distribution trajectory."
    },
    {
      "title": "CSDI: Conditional Score-based Diffusion Models for Probabilistic Time Series Imputation",
      "authors": "Yuta Tashiro et al.",
      "year": 2021,
      "arxiv_id": "arXiv:2107.03502",
      "role": "Inspiration",
      "relationship_sentence": "CSDI shows that score-based diffusion can impute unobserved time points from sparse observations, inspiring SDE-EDG’s use of SDE-driven interpolation to bridge temporal gaps between EDG domains."
    },
    {
      "title": "Latent ODEs for Irregularly-Sampled Time Series",
      "authors": "Yulia Rubanova et al.",
      "year": 2019,
      "arxiv_id": "arXiv:1907.03907",
      "role": "Foundation",
      "relationship_sentence": "Latent ODEs establish the idea of learning continuous latent trajectories from sparse time-stamped observations, which SDE-EDG generalizes to stochastic latent dynamics at the distribution level under temporal shift."
    },
    {
      "title": "TrajectoryNet: A Dynamic Optimal Transport Network for Modeling Cellular Dynamics",
      "authors": "Alexander Tong et al.",
      "year": 2020,
      "arxiv_id": null,
      "role": "Related Problem",
      "relationship_sentence": "TrajectoryNet learns continuous flows between time-stamped empirical distributions, a paradigm SDE-EDG adapts to EDG by replacing deterministic CNF/ODE flows with SDE-based latent trajectories to avoid overfitting with few timestamps."
    },
    {
      "title": "Diffusion Schrödinger Bridge with Applications to Score-Based Generative Modeling",
      "authors": "Guillaume De Bortoli et al.",
      "year": 2021,
      "arxiv_id": null,
      "role": "Inspiration",
      "relationship_sentence": "By formulating stochastic bridges that interpolate between endpoint distributions using score information, this work motivates SDE-EDG’s bridge-style interpolation between consecutive domains to densify the temporal trajectory."
    },
    {
      "title": "WILDS: A Benchmark of In-the-Wild Distribution Shifts",
      "authors": "Pang Wei Koh et al.",
      "year": 2021,
      "arxiv_id": "arXiv:2012.07421",
      "role": "Foundation",
      "relationship_sentence": "WILDS formalizes temporally evolving distribution shifts in realistic datasets (e.g., time-indexed domains), grounding the EDG problem setting that SDE-EDG targets and highlighting the scarcity of timestamps in practice."
    }
  ],
  "synthesis_narrative": "Score-based generative modeling through stochastic differential equations showed how a forward diffusion and reverse-time SDE can generate samples along a continuous time axis, establishing a principled way to traverse intermediate times between observed snapshots. Building on this, CSDI demonstrated that score-based diffusion can impute missing time points from sparse observations, directly evidencing that diffusion/SDE machinery can bridge temporal gaps. Latent ODEs introduced the notion of learning continuous latent trajectories from irregularly sampled data, enabling interpolation and extrapolation from few timestamps via latent dynamics. TrajectoryNet extended continuous-time modeling to distributional snapshots, learning flows that connect empirical distributions across observed times with CNF/ODE dynamics. Diffusion Schrödinger bridges further showed that stochastic bridges guided by scores can interpolate between endpoint distributions, offering a robust alternative to deterministic flows when data are sparse or noisy. Complementing these modeling advances, WILDS crystallized real-world, time-indexed distribution shifts that motivate methods capable of generalizing to unseen future domains despite limited timestamps.\nTogether these works reveal a gap: deterministic flows and per-series imputers falter when only a few domain timestamps exist and the goal is distribution-level generalization to future times. The present paper synthesizes score-SDE generation, bridge-style interpolation, and continuous latent dynamics to learn a stochastic latent trajectory of the evolving distribution, densifying the timeline with continuous-interpolated samples (an infinitely fine grid) and thereby mitigating overfitting to sparse timestamps and improving EDG generalization.",
  "target_paper": {
    "title": "Latent Trajectory Learning for Limited Timestamps under Distribution Shift over Time",
    "authors": "QIUHAO Zeng, Changjian Shui, Long-Kai Huang, Peng Liu, Xi Chen, Charles Ling, Boyu Wang",
    "conference": "ICLR",
    "year": 2024,
    "presentation_type": "oral",
    "keywords": "Distribution Shift, Temporal Distribution Shift",
    "abstract": "Distribution shifts over time are common in real-world machine-learning applications. This scenario is formulated as Evolving Domain Generalization (EDG), where models aim to generalize well to unseen target domains in a time-varying system by learning and leveraging the underlying evolving pattern of the distribution shifts across domains. However, existing methods encounter challenges due to the limited number of timestamps (every domain corresponds to a timestamp) in EDG datasets, leading to difficulties in capturing evolving dynamics and risking overfitting to the sparse timestamps, which hampers their generalization and adaptability to new tasks. To address this limitation, we propose a novel approach SDE-EDG that collects the Infinitely Fined-Grid Evolving Trajectory (IFGET) of the data distribution with continuous-interpolated samples to bridge temporal gaps (intervals between two successive timestamps). Furthermore, by leveraging the inherent capacity of Stochastic Differential",
    "openreview_id": "bTMMNT7IdW",
    "forum_id": "bTMMNT7IdW"
  },
  "analysis_timestamp": "2026-01-06T18:30:38.076943"
}