{
  "prior_works": [
    {
      "title": "Learning a Single Convolutional Super-Resolution Network for Multiple Degradations (SRMD)",
      "authors": "Kai Zhang et al.",
      "year": 2018,
      "arxiv_id": null,
      "role": "Foundation",
      "relationship_sentence": "SRMD formalized SR over a continuous degradation-parameter space, a notion SEAL leverages by clustering this space to form representative evaluation cases rather than conditioning a model on it."
    },
    {
      "title": "Designing a Practical Degradation Model for Deep Blind Image Super-Resolution (BSRGAN)",
      "authors": "Kai Zhang et al.",
      "year": 2021,
      "arxiv_id": null,
      "role": "Gap Identification",
      "relationship_sentence": "BSRGAN’s high-order synthetic degradation pipeline defines the expansive real-world degradation space that SEAL systematically partitions, and its reliance on small random test samples is the explicit evaluation weakness SEAL addresses."
    },
    {
      "title": "Real-ESRGAN: Training Real-World Blind Super-Resolution with Pure Synthetic Data",
      "authors": "Xintao Wang et al.",
      "year": 2021,
      "arxiv_id": "2107.10833",
      "role": "Baseline",
      "relationship_sentence": "Real-ESRGAN popularized high-order, multi-step degradations and random-case testing; SEAL converts these ad-hoc samples into clustered, coverage-measured test suites and uses Real-ESRGAN as a primary baseline within its protocol."
    },
    {
      "title": "DASR: Degradation-Aware Super-Resolution",
      "authors": "Wang et al.",
      "year": 2021,
      "arxiv_id": null,
      "role": "Related Problem",
      "relationship_sentence": "DASR’s idea of explicitly representing and grouping degradations to handle varied conditions informs SEAL’s strategy of clustering degradation configurations to analyze performance distribution across distinct degradation regimes."
    },
    {
      "title": "NTIRE 2020 Challenge on Real-World Image Super-Resolution: Methods and Results",
      "authors": "Andreas Lugmayr et al.",
      "year": 2020,
      "arxiv_id": null,
      "role": "Gap Identification",
      "relationship_sentence": "The NTIRE Real-World SR challenge exposed inconsistency and limited coverage in evaluating diverse degradations, which SEAL replaces with a principled, coarse-to-fine, cluster-based evaluation to ensure distributional representativeness."
    },
    {
      "title": "Toward Real-World Single Image Super-Resolution: A New Benchmark (RealSR)",
      "authors": "Cai et al.",
      "year": 2019,
      "arxiv_id": null,
      "role": "Foundation",
      "relationship_sentence": "The RealSR benchmark highlighted the mismatch between synthetic/bicubic metrics and real-world performance, motivating SEAL’s emphasis on distribution-aware test construction and comprehensive coverage of real degradations."
    }
  ],
  "synthesis_narrative": "SRMD introduced the pivotal idea that super-resolution should be considered over a continuous degradation parameter space, explicitly encoding blur kernels and noise to model diverse conditions. Building on this, BSRGAN proposed a high-order synthetic pipeline that better mimics real-world degradations through multi-step processes, effectively enlarging the degradation space but typically assessing performance on small, randomly sampled cases. Real-ESRGAN further popularized this high-order synthetic paradigm for blind SR, cementing random-case testing as common practice. In parallel, degradation-aware approaches like DASR learned explicit degradation representations and grouped domains to adapt models to varied conditions, indicating that structure in the degradation space can be exploited. Community evaluations, exemplified by the NTIRE 2020 Real-World SR challenge, and data efforts like the RealSR benchmark, revealed inconsistencies and a mismatch between standard metrics and real-world outcomes, underscoring insufficient coverage of the true degradation distribution. Collectively, these works created an expansive, parameterized degradation landscape and showed that both models and evaluations need to respect its structure. SEAL synthesizes these insights by clustering the high-dimensional degradation space to produce a representative, comprehensive test set and introduces a coarse-to-fine protocol that quantifies both distributional coverage and performance distribution. This closes the evaluation gap left by random-case testing, enabling fair, consistent, and distribution-aware assessment of Real-SR methods shaped by high-order degradation modeling.",
  "target_paper": {
    "title": "SEAL: A Framework for Systematic Evaluation of Real-World Super-Resolution",
    "authors": "Wenlong Zhang, Xiaohui Li, Xiangyu Chen, Xiaoyun Zhang, Yu Qiao, Xiao-Ming Wu, Chao Dong",
    "conference": "ICLR",
    "year": 2024,
    "presentation_type": "spotlight",
    "keywords": "Image super-resolution; Real-World super-resolution",
    "abstract": "Real-world Super-Resolution (Real-SR) methods focus on dealing with diverse real-world images and have attracted increasing attention in recent years. The key idea is to use a complex and high-order degradation model to mimic real-world degradations. \nAlthough they have achieved impressive results in various scenarios, they are faced with the obstacle of evaluation. Currently, these methods are only assessed by their average performance on a small set of degradation cases randomly selected from a large space, which fails to provide a comprehensive understanding of their overall performance and often yields inconsistent and potentially misleading results.\nTo overcome the limitation in evaluation, we propose SEAL, a framework for systematic evaluation of real-SR. In particular, we cluster the extensive degradation space to create a set of representative degradation cases, which serves as a comprehensive test set. Next, we propose a coarse-to-fine evaluation protocol to measure the distri",
    "openreview_id": "CGlczSBBSj",
    "forum_id": "CGlczSBBSj"
  },
  "analysis_timestamp": "2026-01-06T23:00:16.867463"
}