{
  "prior_works": [
    {
      "title": "Equality of Opportunity in Supervised Learning",
      "authors": "Moritz Hardt et al.",
      "year": 2016,
      "arxiv_id": "1610.02413",
      "role": "Foundation",
      "relationship_sentence": "By introducing Equalized Odds/Opportunity and showing they can be enforced via post-hoc group-specific thresholding of scores, this work established the post-processing paradigm that the current paper generalizes and characterizes as Bayes-optimal via bias-score rules."
    },
    {
      "title": "A Reductions Approach to Fair Classification",
      "authors": "Alekh Agarwal et al.",
      "year": 2018,
      "arxiv_id": "1803.02453",
      "role": "Extension",
      "relationship_sentence": "The reductions framework casts DP/EOp/EO as constrained risk minimization with Lagrange multipliers, a structure the current paper leverages to derive finite sufficient statistics (bias scores) and a closed-form post-hoc optimal modification instead of retraining."
    },
    {
      "title": "The Cost of Fairness in Binary Classification",
      "authors": "Aditya Menon et al.",
      "year": 2018,
      "arxiv_id": null,
      "role": "Inspiration",
      "relationship_sentence": "Their Bayes-risk analysis showed that optimal DP/EOp solutions amount to thresholding a modified score, directly motivating the paper’s instance-level bias score that formalizes this modification and extends it to EO with a simple linear rule."
    },
    {
      "title": "Classification with Fairness Constraints: A Meta-Algorithm with Provable Guarantees",
      "authors": "L. Elisa Celis et al.",
      "year": 2019,
      "arxiv_id": null,
      "role": "Baseline",
      "relationship_sentence": "As a leading baseline that enforces group-fairness via cost-sensitive learning and randomized post-processing, this method is supplanted here by a deterministic bias-score post-hoc rule with a Bayes-optimal characterization."
    },
    {
      "title": "Decoupled Classifiers for Group-Fairness",
      "authors": "Cynthia Dwork et al.",
      "year": 2018,
      "arxiv_id": null,
      "role": "Related Problem",
      "relationship_sentence": "By advocating per-group decision rules to reconcile accuracy and fairness, this work foreshadowed the paper’s design that achieves the same effect post-hoc with a single global rule over bias scores rather than training separate models."
    },
    {
      "title": "On Fairness and Calibration",
      "authors": "Geoff Pleiss et al.",
      "year": 2017,
      "arxiv_id": null,
      "role": "Gap Identification",
      "relationship_sentence": "Their result that calibrated scores cannot satisfy Equalized Odds without group-dependent thresholds highlighted the need for principled post-hoc threshold adjustments that the bias-score rule systematizes and proves optimal."
    }
  ],
  "synthesis_narrative": "Equality of Opportunity in Supervised Learning introduced Equalized Odds and Equal Opportunity and showed that fairness can be achieved by post-hoc group-specific thresholding of calibrated scores, establishing a powerful paradigm for black-box adjustments. The Cost of Fairness in Binary Classification then analyzed Bayes risk under statistical fairness, revealing that optimal fair decisions correspond to thresholding modified versions of the class-probability score. A Reductions Approach to Fair Classification reframed DP/EOp/EO as constrained ERM solved via Lagrangian multipliers, providing a practical and theoretically grounded route—through cost-sensitive classification—to navigate accuracy–fairness trade-offs. Classification with Fairness Constraints operationalized these ideas into a meta-algorithm that often relies on randomized post-processing or retraining to meet constraints with guarantees. Decoupled Classifiers for Group-Fairness emphasized that per-group decision rules can recover accuracy under constraints, advocating structural adjustments aligned with group membership. On Fairness and Calibration exposed the incompatibility between calibration and Equalized Odds, underscoring the necessity of group-dependent thresholds and motivating post-hoc adjustments rather than purely calibrated scoring.\nCollectively, these works suggested that optimal fairness often amounts to simple threshold shifts derived from a constrained optimization view, yet they lacked a unified, instance-level quantity that yields provably Bayes-optimal post-hoc rules across DP, EOp, and EO (and their compositions). The current paper synthesizes these insights by deriving bias scores—finite sufficient statistics from the Lagrangian characterization—and proving that thresholding a single bias score (DP/EOp) or fitting a two-parameter linear rule (EO) is Bayes-optimal, delivering a simple, deterministic post-hoc procedure that preserves accuracy while satisfying group-fairness constraints, even with multiple sensitive attributes.",
  "target_paper": {
    "title": "Post-hoc bias scoring is optimal for fair classification",
    "authors": "Wenlong Chen, Yegor Klochkov, Yang Liu",
    "conference": "ICLR",
    "year": 2024,
    "presentation_type": "spotlight",
    "keywords": "group fairness, post-hoc fair classification, Bayes optimal classifier, accuracy-fairness trade-off",
    "abstract": "We consider a binary classification problem under group fairness constraints, which can be one of Demographic Parity (DP), Equalized Opportunity (EOp), or Equalized Odds (EO). We propose an explicit characterization of Bayes optimal classifier under the fairness constraints, which turns out to be a simple modification rule of the unconstrained classifier. Namely, we introduce a novel instance-level measure of bias, which we call bias score, and the modification rule is a simple linear rule on top of the finite amount of bias scores. Based on this characterization, we develop a post-hoc approach that allows us to adapt to fairness constraints while maintaining high accuracy. In the case of DP and EOp constraints, the modification rule is thresholding a single bias score, while in the case of EO constraints we are required to fit a linear modification rule with 2 parameters. The method can also be applied for composite group-fairness criteria, such as ones involving several sensitive att",
    "openreview_id": "FM5xfcaR2Y",
    "forum_id": "FM5xfcaR2Y"
  },
  "analysis_timestamp": "2026-01-06T10:47:17.669893"
}