{
  "prior_works": [
    {
      "title": "DreamFusion: Text-to-3D using 2D Diffusion",
      "authors": "Ben Poole et al.",
      "year": 2022,
      "arxiv_id": "2209.14988",
      "role": "Foundation",
      "relationship_sentence": "DreamFusion introduced score distillation sampling (SDS) for text-to-3D optimization with random timesteps, and DreamFlow directly replaces this high-variance, random-timestep loss with a probability-flow-based generative sampling procedure using a fixed schedule."
    },
    {
      "title": "Score-Based Generative Modeling through Stochastic Differential Equations",
      "authors": "Yang Song et al.",
      "year": 2021,
      "arxiv_id": "2011.13456",
      "role": "Foundation",
      "relationship_sentence": "DreamFlow’s core algorithm explicitly approximates the probability flow ODE from this work to deterministically transport noisy multi-view renders toward the text-conditioned image manifold during optimization."
    },
    {
      "title": "Denoising Diffusion Implicit Models",
      "authors": "Jiaming Song et al.",
      "year": 2020,
      "arxiv_id": "2010.02502",
      "role": "Inspiration",
      "relationship_sentence": "DreamFlow leverages a deterministic denoising trajectory with a predetermined timestep schedule akin to DDIM, turning the T2I diffusion prior into a low-variance generator rather than a stochastic, random-timestep loss."
    },
    {
      "title": "SDEdit: Image Synthesis and Editing with Stochastic Differential Equations",
      "authors": "Chenlin Meng et al.",
      "year": 2021,
      "arxiv_id": "2108.01073",
      "role": "Inspiration",
      "relationship_sentence": "By interpreting each render as a source image and applying scheduled denoising to translate it toward the target text, DreamFlow generalizes SDEdit’s image-to-image diffusion paradigm to synchronized multi-view updates for 3D optimization."
    },
    {
      "title": "Magic3D: High-Resolution Text-to-3D Content Creation",
      "authors": "Chen-Hsuan Lin et al.",
      "year": 2023,
      "arxiv_id": "2211.10440",
      "role": "Extension",
      "relationship_sentence": "DreamFlow adopts and extends Magic3D’s coarse-to-fine optimization blueprint, integrating probability-flow-based updates into a three-stage pipeline to efficiently reach 1024×1024 quality."
    },
    {
      "title": "ProlificDreamer: High-Fidelity and Diverse Text-to-3D Generation with Variational Score Distillation",
      "authors": "Wang et al.",
      "year": 2023,
      "arxiv_id": "2305.16213",
      "role": "Gap Identification",
      "relationship_sentence": "By highlighting SDS’s instability, slow convergence, and mode collapse, ProlificDreamer motivates DreamFlow’s variance-reducing shift from random-timestep score matching to probability-flow-driven generative sampling without training a 3D diffusion prior."
    }
  ],
  "synthesis_narrative": "Score distillation sampling (SDS) from DreamFusion established the now-standard formulation of optimizing a 3D representation by backpropagating through a pre-trained text-to-image diffusion model, but its stochastic use of random timesteps yields high-variance gradients and slow convergence. Independently, score-based generative modeling introduced the probability flow ODE, providing a deterministic trajectory that shares marginals with the reverse-time SDE and enabling controlled transport on the data manifold. DDIM operationalized this idea into a practical deterministic sampler with fixed timestep schedules that generates high-quality images in far fewer steps. SDEdit further showed that diffusion sampling with a prescribed schedule can act as an image-to-image translator: injecting noise and then denoising can steer an input toward a target while preserving structure. In parallel, Magic3D demonstrated that a coarse-to-fine pipeline—optimizing at low resolution before high-resolution refinement—substantially boosts fidelity and efficiency for text-to-3D. Finally, ProlificDreamer diagnosed SDS pathologies (instability, mode collapse) and proposed VSD, underscoring the need for variance reduction but at the cost of learning a 3D prior.\nThese threads suggest replacing random-timestep score matching with deterministic probability-flow–aligned sampling and using diffusion as a multi-view image-to-image translator during 3D optimization. Building on the coarse-to-fine blueprint, DreamFlow synthesizes these insights: it approximates the probability flow with a predetermined schedule to provide low-variance, stepwise multi-view updates and embeds this into a three-stage pipeline that scales efficiently to high resolution, achieving faster, higher-quality text-to-3D generation without training new diffusion priors.",
  "target_paper": {
    "title": "DreamFlow: High-quality text-to-3D generation by Approximating Probability Flow",
    "authors": "Kyungmin Lee, Kihyuk Sohn, Jinwoo Shin",
    "conference": "ICLR",
    "year": 2024,
    "presentation_type": "spotlight",
    "keywords": "Text-to-3D generation, Diffusion model, Score Distillation Sampling",
    "abstract": "Recent progress in text-to-3D generation has been achieved through the utilization of score distillation methods: they make use of the pre-trained text-to-image (T2I) diffusion models by distilling via the diffusion model training objective. However, such an approach inevitably results in the use of random timesteps at each update, which increases the variance of the gradient and ultimately prolongs the optimization process. In this paper, we propose to enhance the text-to-3D optimization by leveraging the T2I diffusion prior in the generative sampling process with a predetermined timestep schedule. To this end, we interpret text-to-3D optimization as a multi-view image-to-image translation problem, and propose a solution by approximating the probability flow. By leveraging the proposed novel optimization algorithm, we design DreamFlow, a practical three-stage coarse-to-fine text-to-3D optimization framework that enables fast generation of high-quality and high-resolution (i.e., 1024×1",
    "openreview_id": "GURqUuTebY",
    "forum_id": "GURqUuTebY"
  },
  "analysis_timestamp": "2026-01-06T09:44:38.607009"
}