{
  "prior_works": [
    {
      "title": "Norm-based capacity control in neural networks",
      "authors": "Behnam Neyshabur et al.",
      "year": 2015,
      "arxiv_id": "1507.06426",
      "role": "Foundation",
      "relationship_sentence": "This work introduced the path-norm as a rescaling-invariant complexity measure and derived generalization bounds for layered ReLU networks, which the present paper generalizes to arbitrary DAGs with biases, skip connections, and order-statistics operations while recovering or improving those bounds."
    },
    {
      "title": "Path-SGD: Path-Normalized Optimization in Deep Neural Networks",
      "authors": "Behnam Neyshabur et al.",
      "year": 2015,
      "arxiv_id": "1506.02617",
      "role": "Extension",
      "relationship_sentence": "Path-SGD provided the dynamic-programming machinery to compute and manipulate path-based quantities in layered ReLU nets, which this paper extends to efficient, invariant path-norm computation on general DAG topologies and nodes implementing order-statistics."
    },
    {
      "title": "Spectrally-normalized margin bounds for neural networks",
      "authors": "Peter L. Bartlett et al.",
      "year": 2017,
      "arxiv_id": "1706.08498",
      "role": "Baseline",
      "relationship_sentence": "This paper’s product-of-operator-norm generalization bounds serve as the principal non–path-norm baseline that the new toolkit contrasts with and surpasses in sharpness on layered networks while extending applicability to modern architectures."
    },
    {
      "title": "Deep Residual Learning for Image Recognition",
      "authors": "Kaiming He et al.",
      "year": 2016,
      "arxiv_id": "1512.03385",
      "role": "Foundation",
      "relationship_sentence": "By introducing skip connections and residual summation, this work defined the architectural motif the new toolkit explicitly targets, motivating a rescaling-invariant path-norm that remains well-defined and computable in residual DAGs and enabling the ImageNet ResNet bound evaluations."
    },
    {
      "title": "Sorting out Lipschitz function approximation",
      "authors": "Cem Anil et al.",
      "year": 2019,
      "arxiv_id": "1811.05381",
      "role": "Related Problem",
      "relationship_sentence": "This paper formalized GroupSort as an order-statistics-based activation central to 1-Lipschitz architectures, and the new toolkit directly incorporates such order-statistics nodes into its path-norm definition and contraction-based analysis."
    },
    {
      "title": "Maxout Networks",
      "authors": "Ian J. Goodfellow et al.",
      "year": 2013,
      "arxiv_id": "1302.4389",
      "role": "Related Problem",
      "relationship_sentence": "By introducing max-based units that select among linear responses, this work motivates treating max pooling/maxout as order-statistics operations, which the new path-norm framework explicitly accommodates within its general DAG analysis."
    }
  ],
  "synthesis_narrative": "Path-norms were introduced as scale-invariant measures of complexity for ReLU networks, with Neyshabur et al. showing they yield generalization bounds sharper than weight-operator products on layered architectures while respecting neuron-wise rescaling symmetries. Building on that notion, Path-SGD provided concrete dynamic-programming rules to compute and manipulate path-based quantities efficiently in layered feed-forward networks, cementing the utility and invariance of path-wise formulations for analysis and optimization. In contrast, Bartlett, Foster, and Telgarsky established spectrally-normalized margin bounds based on products of operator norms, a widely used baseline that is often less sharp but broadly applicable. Meanwhile, He et al. introduced residual connections, turning modern networks into general DAGs with skip-add edges that break many layer-wise analyses. In parallel, Anil et al. formalized GroupSort as an order-statistics activation central to Lipschitz-controlled networks, and Goodfellow et al. popularized max-based units (maxout), motivating analyses that treat max pooling and related layers as explicit order-statistics operations. Together these works defined path-wise capacity control, efficient path aggregation, and the modern architectural primitives—residual summation and order-statistics layers—but left a gap: no unified, computable, rescaling-invariant path-norm framework for general DAGs with biases, skips, and order-statistics. The present paper fills this by extending path aggregation beyond layered graphs, embedding order-statistics into the analysis via contraction-style arguments, and delivering generalization bounds that recover or improve prior path-norm results while applying to ResNets and GroupSort/MaxPool networks; as a result, it enables a practical evaluation of path-norm guarantees on large-scale architectures like ImageNet ResNets.",
  "target_paper": {
    "title": "A path-norm toolkit for modern networks: consequences, promises and challenges",
    "authors": "Antoine Gonon, Nicolas Brisebarre, Elisa Riccietti, Rémi Gribonval",
    "conference": "ICLR",
    "year": 2024,
    "presentation_type": "spotlight",
    "keywords": "ReLU neural networks, path-norm, generalization, contraction lemma, peeling",
    "abstract": "This work introduces the first toolkit around path-norms that fully encompasses general DAG ReLU networks with biases, skip connections and any operation based on the extraction of order statistics: max pooling, GroupSort etc.\nThis toolkit notably allows us to establish generalization bounds for modern neural networks that are not only the most widely applicable path-norm based ones, but also recover or beat the sharpest known bounds of this type. \nThese extended path-norms further enjoy the usual benefits of path-norms: ease of computation,  invariance under the symmetries of the network, and improved sharpness on layered fully-connected networks compared to the product of operator norms, another complexity measure most commonly used.\n\nThe versatility of the toolkit and its ease of implementation allow us to challenge the concrete promises of path-norm-based generalization bounds, by numerically evaluating the sharpest known bounds for ResNets on ImageNet.",
    "openreview_id": "hiHZVUIYik",
    "forum_id": "hiHZVUIYik"
  },
  "analysis_timestamp": "2026-01-06T15:09:08.617748"
}