{
  "prior_works": [
    {
      "title": "Geometric deep learning of protein molecular surfaces",
      "authors": "Pablo Gainza et al.",
      "year": 2020,
      "arxiv_id": "",
      "role": "Inspiration",
      "relationship_sentence": "This work introduced the notion of protein surface “microenvironments” encoded by a small set of physicochemical and geometric features, a concept MAPE-PPI generalizes to residue-centric, sequence–structure-aware microenvironments with a richer learnable vocabulary."
    },
    {
      "title": "Fast end-to-end learning on protein surfaces (dMaSIF)",
      "authors": "Freyr Sverrisson et al.",
      "year": 2021,
      "arxiv_id": "",
      "role": "Gap Identification",
      "relationship_sentence": "dMaSIF learned surface descriptors for partner search but remained surface-only and constrained by limited channels, motivating MAPE-PPI to integrate sequence context and expand beyond hand-crafted/low-cardinality microenvironment features."
    },
    {
      "title": "Learning from Protein Structure with Geometric Vector Perceptrons",
      "authors": "Bowen Jing et al.",
      "year": 2021,
      "arxiv_id": "2009.01411",
      "role": "Foundation",
      "relationship_sentence": "GVP-GNN provided the residue-level scalar–vector representation to encode local 3D geometry that MAPE-PPI leverages to capture structural context within each residue’s microenvironment."
    },
    {
      "title": "D-SCRIPT: Structure-aware protein–protein interaction prediction from sequences",
      "authors": "Joseph Sledzieski et al.",
      "year": 2021,
      "arxiv_id": "",
      "role": "Gap Identification",
      "relationship_sentence": "By showing strong sequence-only PPI prediction with a proxy contact map while lacking explicit 3D structural context, D-SCRIPT highlights the limitation MAPE-PPI addresses by directly embedding structure-informed microenvironments."
    },
    {
      "title": "PIPR: Protein–Protein Interaction Prediction via Siamese Residual RCNN",
      "authors": "Minghao Zeng et al.",
      "year": 2019,
      "arxiv_id": "",
      "role": "Baseline",
      "relationship_sentence": "PIPR is a prominent sequence-only baseline that MAPE-PPI surpasses by introducing microenvironment-aware embeddings that fuse sequence with structural context."
    },
    {
      "title": "dMaSIF-Search: Learning surface fingerprints for protein–protein partner search",
      "authors": "Freyr Sverrisson et al.",
      "year": 2022,
      "arxiv_id": "",
      "role": "Baseline",
      "relationship_sentence": "As an efficient structure-based partner search method built on microenvironment-like surface fingerprints, dMaSIF-Search is the primary structural baseline whose efficiency/expressivity trade-offs MAPE-PPI improves via a richer, residue-level microenvironment embedding."
    }
  ],
  "synthesis_narrative": "Protein interaction modeling on 3D surfaces crystallized around the idea of local microenvironments: small patches characterized by geometric and physicochemical signals. Gainza et al. operationalized this with MaSIF, encoding surface patches using a compact set of hand-crafted channels to recognize binding sites and perform partner search. dMaSIF advanced this by learning surface descriptors end-to-end and enabling efficient large-scale retrieval, but its representation remained surface-only and effectively limited in channel diversity. In parallel, Jing et al. introduced GVP-GNN, a residue-centric architecture that jointly processes scalar and vector features to capture local 3D geometry, offering a principled way to encode structural context beyond surfaces. On the sequence side, D-SCRIPT demonstrated that strong PPI signals can be extracted from sequences by inducing a proxy contact map, yet it exposed the weakness of omitting explicit structural context. Earlier sequence-only models like PIPR set the baseline for deep PPI prediction but reinforced the need to move beyond purely sequential cues. dMaSIF-Search, specifically, highlighted how precomputable microenvironment fingerprints can make partner screening efficient at scale, albeit with limited expressivity.\nCollectively, these works suggest a clear opportunity: unify the efficiency of microenvironment-based partner search with a richer, residue-level representation that explicitly fuses 3D geometry and sequence chemistry. Building on GVP’s structural encoding, addressing MaSIF/dMaSIF’s small or surface-only vocabularies, and surpassing sequence-only baselines like D-SCRIPT and PIPR, the next step is to learn a compact yet expressive microenvironment embedding that can be precomputed per protein and matched efficiently for accurate, scalable PPI prediction.",
  "target_paper": {
    "title": "MAPE-PPI: Towards Effective and Efficient Protein-Protein Interaction Prediction via Microenvironment-Aware Protein Embedding",
    "authors": "Lirong Wu, Yijun Tian, Yufei Huang, Siyuan Li, Haitao Lin, Nitesh V Chawla, Stan Z. Li",
    "conference": "ICLR",
    "year": 2024,
    "presentation_type": "spotlight",
    "keywords": "Bioinformatics, Protein-Protein Interaction, Protein Sequence-Structure Co-Modeling",
    "abstract": "Protein-Protein Interactions (PPIs) are fundamental in various biological processes and play a key role in life activities. The growing demand and cost of experimental PPI assays require computational methods for efficient PPI prediction. While existing methods rely heavily on protein sequence for PPI prediction, it is the protein structure that is the key to determine the interactions. To take both protein modalities into account, we define the microenvironment of an amino acid residue by its sequence and structural contexts, which describe the surrounding chemical properties and geometric features. In addition, microenvironments defined in previous work are largely based on experimentally assayed physicochemical properties, for which the \"vocabulary\" is usually extremely small. This makes it difficult to cover the diversity and complexity of microenvironments. In this paper, we propose Microenvironment-Aware Protein Embedding for PPI prediction (MPAE-PPI), which encodes microenvironm",
    "openreview_id": "itGkF993gz",
    "forum_id": "itGkF993gz"
  },
  "analysis_timestamp": "2026-01-06T12:14:41.887988"
}