{
  "prior_works": [
    {
      "title": "Illuminating Search Spaces by Mapping Elites",
      "authors": "Mouret et al.",
      "year": 2015,
      "arxiv_id": "1504.04909",
      "role": "Foundation",
      "relationship_sentence": "This paper established the Quality-Diversity (QD) paradigm and archive-based illumination framework that CCQD operates within and seeks to make more sample-efficient."
    },
    {
      "title": "Covariance Matrix Adaptation for the Rapid Illumination of Behavior Space (CMA-ME)",
      "authors": "Fontaine et al.",
      "year": 2020,
      "arxiv_id": null,
      "role": "Baseline",
      "relationship_sentence": "CMA-ME is a primary QD baseline that improves sample efficiency via stronger selection/variation, which CCQD complements by reducing search dimensionality through cooperative coevolution and can be instantiated atop."
    },
    {
      "title": "Differentiable Quality Diversity",
      "authors": "Fontaine et al.",
      "year": 2021,
      "arxiv_id": null,
      "role": "Baseline",
      "relationship_sentence": "DQD leverages gradients to accelerate QD but still operates on full high-dimensional policies, providing a strong sample-efficiency baseline that CCQD improves upon by structurally decomposing the policy into coevolved subcomponents."
    },
    {
      "title": "Cooperative coevolution: An architecture for evolving coadapted subcomponents",
      "authors": "Potter et al.",
      "year": 2000,
      "arxiv_id": null,
      "role": "Inspiration",
      "relationship_sentence": "This work introduced the cooperative coevolutionary framework of decomposing a solution into interacting subcomponents evolved in separate subpopulations, directly inspiring CCQD’s representation/decision split and cooperative evaluation."
    },
    {
      "title": "Differential grouping for large-scale global optimization",
      "authors": "Omidvar et al.",
      "year": 2014,
      "arxiv_id": null,
      "role": "Gap Identification",
      "relationship_sentence": "By showing that identifying and separating interacting variables is critical for large-scale optimization, this work motivates CCQD’s view of policy search in QD as a large-scale problem addressed via principled decomposition."
    }
  ],
  "synthesis_narrative": "Mapping Elites introduced the illumination paradigm at the heart of Quality-Diversity: maintaining an archive indexed by behavior descriptors to discover many diverse, high-performing solutions rather than a single optimum. Subsequent advances such as CMA-ME demonstrated that stronger selection and variation—importing covariance adaptation from CMA-ES—can markedly accelerate illumination in parameter spaces typical of policy search. Differentiable Quality Diversity further increased sample efficiency by exploiting gradients of both the objective and behavior descriptors to guide search, while still operating on the full, high-dimensional policy parameterization. In parallel, the cooperative coevolution literature established that decomposing complex solutions into coadapted subcomponents and evolving them in separate subpopulations enables more effective search by reducing dimensionality and coordinating via joint evaluation. Differential grouping in large-scale optimization made explicit that detecting and mitigating variable interactions is pivotal: optimization difficulty often stems from entangled variables that should be separated to make progress.\nTogether, these works revealed two complementary levers for sample-efficient QD in policy search: enhanced operators (CMA-style adaptation, gradients) and structural problem simplification through decomposition. The opportunity was to bring cooperative coevolution’s principled decomposition to QD-RL’s large policy networks: splitting representation and decision layers into coordinated subpopulations to downscale the search space while remaining compatible with modern QD operators. This synthesis naturally yields a framework that can plug into MAP-Elites-style archives and inherit operator improvements, yet addresses the previously underexplored large-scale bottleneck that constrained their sample-efficiency gains.",
  "target_paper": {
    "title": "Sample-Efficient Quality-Diversity by Cooperative Coevolution",
    "authors": "Ke Xue, Ren-Jian Wang, Pengyi Li, Dong Li, Jianye HAO, Chao Qian",
    "conference": "ICLR",
    "year": 2024,
    "presentation_type": "spotlight",
    "keywords": "Quality-Diversity, Reinforcement Learning, Evolutionary Algorithms",
    "abstract": "Quality-Diversity (QD) algorithms, as a subset of evolutionary algorithms, have emerged as a powerful optimization paradigm with the aim of generating a set of high-quality and diverse solutions. Although QD has demonstrated competitive performance in reinforcement learning, its low sample efficiency remains a significant impediment for real-world applications. Recent research has primarily focused on augmenting sample efficiency by refining selection and variation operators of QD. However, one of the less considered yet crucial factors is the inherently large-scale issue of the QD optimization problem. In this paper, we propose a novel Cooperative Coevolution QD (CCQD) framework, which decomposes a policy network naturally into two types of layers, corresponding to representation and decision respectively, and thus simplifies the problem significantly. The resulting two (representation and decision) subpopulations are coevolved cooperatively. CCQD can be implemented with different sel",
    "openreview_id": "JDud6zbpFv",
    "forum_id": "JDud6zbpFv"
  },
  "analysis_timestamp": "2026-01-06T13:55:30.567437"
}