{
  "prior_works": [
    {
      "title": "SoftGym: Benchmarking Deep Reinforcement Learning for Deformable Object Manipulation",
      "authors": "Yufei Lin et al.",
      "year": 2020,
      "arxiv_id": null,
      "role": "Baseline",
      "relationship_sentence": "SoftGym established the standard cloth-centric deformable manipulation tasks but uses a non-differentiable simulator with limited thin-shell material models, serving as the primary environment this work seeks to supersede with a differentiable, multi-material thin-shell platform."
    },
    {
      "title": "PlasticineLab: A Soft-Body Manipulation Benchmark with Differentiable Physics",
      "authors": "Zhuoran Huang et al.",
      "year": 2021,
      "arxiv_id": null,
      "role": "Inspiration",
      "relationship_sentence": "PlasticineLab demonstrated that differentiable physics enables gradient-based policy learning and system identification for deformable manipulation, directly motivating a differentiable environment specialized for thin-shell materials rather than volumetric soft bodies."
    },
    {
      "title": "DiffPD: Differentiable Projective Dynamics",
      "authors": "Huang et al.",
      "year": 2021,
      "arxiv_id": null,
      "role": "Extension",
      "relationship_sentence": "DiffPD provides the differentiable optimization-based simulator the authors adapt by incorporating thin-shell energies, frictional robot–sheet contacts, and heterogeneous material parameters to create a thin-shell–specific differentiable pipeline."
    },
    {
      "title": "Discrete Shells",
      "authors": "Eitan Grinspun et al.",
      "year": 2003,
      "arxiv_id": null,
      "role": "Foundation",
      "relationship_sentence": "Discrete Shells introduced the bending energy and thin-shell modeling principles that underpin the physical formulation adopted to represent cloth, paper, and bag-like materials in a differentiable simulation setting."
    },
    {
      "title": "ChainQueen: A Real-Time Differentiable Physical Simulator for Soft Robotics",
      "authors": "Yuanming Hu et al.",
      "year": 2019,
      "arxiv_id": null,
      "role": "Inspiration",
      "relationship_sentence": "ChainQueen validated real-time differentiable simulation for soft-matter control and inverse problems, inspiring the use of end-to-end gradients for learning thin-shell manipulation skills and material properties."
    },
    {
      "title": "SpeedFolding: Learning Efficient Bimanual Folding of Real Garments",
      "authors": "Dan Seita et al.",
      "year": 2022,
      "arxiv_id": null,
      "role": "Gap Identification",
      "relationship_sentence": "SpeedFolding’s task-specific, imitation-driven cloth-folding pipeline highlights the narrow material/task coverage and heuristic dependence of prior thin-shell manipulation approaches that this work addresses with a general-purpose, differentiable thin-shell simulator."
    }
  ],
  "synthesis_narrative": "SoftGym defined widely used deformable manipulation tasks—especially cloth flattening and folding—but relies on a non-differentiable simulator and a single family of cloth models, constraining gradient-based learning and broader material coverage. PlasticineLab proved the power of differentiable physics for deformable-object control and system identification by leveraging end-to-end gradients in a benchmark, albeit for volumetric soft bodies rather than thin sheets. DiffPD introduced a differentiable projective-dynamics framework where implicit integration and energy-based formulations enable stable gradients through contact-rich dynamics, and it is readily adapted to elastic models beyond simple mass–spring systems. Discrete Shells provided the core thin-shell energy—particularly the discrete bending model—that has become the standard for simulating cloth, paper, and other sheet-like materials with physically grounded behavior. ChainQueen further established the feasibility and benefits of real-time differentiable simulation for manipulation tasks, demonstrating gradient-based control on deformable media. In parallel, SpeedFolding showcased high-performance cloth folding via heuristic/imitation-heavy pipelines, underscoring that many thin-shell manipulation systems remain narrow in scope and not easily extensible across materials or tasks. Together, these works reveal both the promise and the gaps: differentiable simulators enable powerful learning and identification but were not tailored to thin shells, while thin-shell environments lacked differentiability and material diversity. The present work synthesizes differentiable, energy-based simulation (DiffPD) with thin-shell modeling (Discrete Shells), informed by the task settings from SoftGym and the end-to-end learning promise shown by ChainQueen/PlasticineLab, to deliver a unified differentiable platform that scales across thin-shell materials and manipulation tasks.",
  "target_paper": {
    "title": "Thin-Shell Object Manipulations With Differentiable Physics Simulations",
    "authors": "Yian Wang, Juntian Zheng, Zhehuan Chen, Zhou Xian, Gu Zhang, Chao Liu, Chuang Gan",
    "conference": "ICLR",
    "year": 2024,
    "presentation_type": "spotlight",
    "keywords": "differentiable physics simulation, thin-shell object manipulation",
    "abstract": "In this work, we aim to teach robots to manipulate various thin-shell materials. \nPrior works studying thin-shell object manipulation mostly rely on heuristic policies or learn policies from real-world video demonstrations, and only focus on limited material types and tasks (e.g., cloth unfolding). However, these approaches face significant challenges when extended to a wider variety of thin-shell materials and a diverse range of tasks.\nOn the other hand, while virtual simulations are shown to be effective in diverse robot skill learning and evaluation, prior thin-shell simulation environments only support a subset of thin-shell materials, which also limits their supported range of tasks. \nTo fill in this gap, we introduce ThinShellLab - a fully differentiable simulation platform tailored for robotic interactions with diverse thin-shell materials possessing varying material properties, enabling flexible thin-shell manipulation skill learning and evaluation. Building on top of our devel",
    "openreview_id": "KsUh8MMFKQ",
    "forum_id": "KsUh8MMFKQ"
  },
  "analysis_timestamp": "2026-01-06T10:14:07.107945"
}