{
  "prior_works": [
    {
      "title": "Efficient Sampling Set Selection for Bandlimited Graph Signals",
      "authors": "A. Anis et al.",
      "year": 2016,
      "arxiv_id": "1501.02744",
      "role": "Baseline",
      "relationship_sentence": "This work formalized sampling and reconstruction of bandlimited graph signals via Laplacian eigenprojectors and sampling-set design that requires eigendecompositions—precisely the spectral dependence the current paper replaces by a graphon-level Poincaré inequality and consistency guarantees that avoid recomputing spectra as graphs grow."
    },
    {
      "title": "Signals on Graphs: Uncertainty Principle and Sampling",
      "authors": "M. Tsitsvero et al.",
      "year": 2016,
      "arxiv_id": "1507.08822",
      "role": "Gap Identification",
      "relationship_sentence": "By characterizing uniqueness sets and cut-off frequencies for Paley–Wiener spaces on graphs using the graph Fourier basis, this paper exposes the limitation that sampling guarantees hinge on graph-specific spectra, motivating the present graphon-based uniqueness and consistency results."
    },
    {
      "title": "Sampling of Band-limited Functions on Combinatorial Graphs",
      "authors": "I. Pesenson",
      "year": 2008,
      "arxiv_id": "",
      "role": "Extension",
      "relationship_sentence": "Pesenson introduced Poincaré-type inequalities to certify uniqueness sets for Paley–Wiener spaces on graphs, and the current paper extends this line by proving an analogous Poincaré inequality for graphon signals and deriving uniqueness of sampling sets at the graphon level."
    },
    {
      "title": "Large Networks and Graph Limits",
      "authors": "L. Lovász",
      "year": 2012,
      "arxiv_id": "",
      "role": "Foundation",
      "relationship_sentence": "This book established the graphon framework and convergence notions for dense graph sequences, which the present work uses to formulate graphon signals, define Paley–Wiener spaces via graphon operators, and prove sampling-set consistency along convergent graph sequences."
    },
    {
      "title": "Graphon Signal Processing: Foundations and Tools",
      "authors": "L. Ruiz et al.",
      "year": 2020,
      "arxiv_id": "",
      "role": "Foundation",
      "relationship_sentence": "By defining graphon operators, spectra, and a Fourier transform on graphons, this work provides the harmonic-analysis machinery that enables the present paper’s definition of graphon Paley–Wiener spaces and its graphon-level sampling theory."
    },
    {
      "title": "Consistency of spectral clustering in stochastic block models",
      "authors": "J. Lei et al.",
      "year": 2015,
      "arxiv_id": "",
      "role": "Related Problem",
      "relationship_sentence": "This paper’s analysis linking graph spectra to population limit operators underpins the present work’s use of spectral clustering connections to relate sampling sets to limiting structure and to establish consistency from graph sequences to the graphon."
    }
  ],
  "synthesis_narrative": "Anis, Gadde, and Ortega showed how to sample and reconstruct bandlimited graph signals by projecting onto Laplacian eigenspaces and selecting sampling sets with explicit spectral criteria, and Tsitsvero, Barbarossa, and Di Lorenzo characterized uniqueness sets and cut-off frequencies for Paley–Wiener spaces through the graph Fourier basis. These works crystallized the role of spectral projectors in sampling guarantees but tied them to graph-specific eigendecompositions. Earlier, Pesenson developed a complementary viewpoint: Poincaré-type inequalities on graphs can certify uniqueness sets for bandlimited spaces without explicitly invoking eigenvectors, revealing an alternative functional-analytic route to sampling guarantees. Lovász’s graphon framework then provided a rigorous limit object for dense graph sequences and associated integral operators, enabling asymptotic reasoning about large graphs. Building on this, Ruiz and co-authors introduced graphon signal processing tools—operators, spectra, and a graphon Fourier transform—establishing the harmonic analysis needed to speak of Paley–Wiener spaces in the graphon domain. Finally, Lei and Rinaldo’s spectral clustering consistency connected empirical graph spectra to limit operators, clarifying how spectral structures converge under graphon models. Together, these strands exposed a gap: practical graph sampling theory lacked a limit-object formulation that both certifies uniqueness via functional inequalities and ensures sampling-set stability as graphs grow. The present paper synthesizes Pesenson’s Poincaré-based uniqueness insight with graphon harmonic analysis to prove a Poincaré inequality for graphon signals, uses it to characterize unique sampling sets for graphon Paley–Wiener spaces, and, leveraging spectral convergence ideas from clustering, establishes that unique sampling sets on convergent graph sequences are consistent with the graphon limit—yielding a scalable sampling algorithm for large graphs.",
  "target_paper": {
    "title": "A Poincaré Inequality and Consistency Results for Signal Sampling on Large Graphs",
    "authors": "Thien Le, Luana Ruiz, Stefanie Jegelka",
    "conference": "ICLR",
    "year": 2024,
    "presentation_type": "spotlight",
    "keywords": "large-scale graphs, signal sampling, graphons",
    "abstract": "Large-scale graph machine learning is challenging as the complexity of learning models scales with the graph size. Subsampling the graph is a viable alternative, but sampling on graphs is nontrivial as graphs are non-Euclidean. Existing graph sampling techniques require not only computing the spectra of large matrices but also repeating these computations when the graph changes, e.g., grows. In this paper, we introduce a signal sampling theory for a type of graph limit---the graphon. We prove a Poincaré inequality for graphon signals and show that complements of node subsets satisfying this inequality are unique sampling sets for Paley-Wiener spaces of graphon signals. Exploiting connections with spectral clustering and Gaussian elimination, we prove that such sampling sets are consistent in the sense that unique sampling sets on a convergent graph sequence converge to unique sampling sets on the graphon. We then propose a related graphon signal sampling algorithm for large graphs, and",
    "openreview_id": "l3qtSNsPvC",
    "forum_id": "l3qtSNsPvC"
  },
  "analysis_timestamp": "2026-01-06T16:49:07.927102"
}