{
  "prior_works": [
    {
      "title": "Tensor Field Networks: Rotation- and translation-equivariant neural networks for 3D point clouds",
      "authors": "Nathaniel Thomas et al.",
      "year": 2018,
      "arxiv_id": "1802.08219",
      "role": "Foundation",
      "relationship_sentence": "Introduced using Clebsch–Gordan-projected tensor products of SO(3) irreps to enforce E(3) equivariance, which is exactly the operation re-expressed via Gaunt coefficients and accelerated in the Fourier basis by the current work."
    },
    {
      "title": "Cormorant: Covariant molecular neural networks",
      "authors": "Brandon J. Anderson et al.",
      "year": 2019,
      "arxiv_id": "1906.04015",
      "role": "Gap Identification",
      "relationship_sentence": "Showed that stacking higher-order spherical tensor products with Clebsch–Gordan projection causes steep computational scaling in molecular settings, the specific bottleneck the new Gaunt/Fourier formulation targets."
    },
    {
      "title": "Clebsch–Gordan Nets: a fully Fourier space spherical CNN",
      "authors": "Risi Kondor et al.",
      "year": 2018,
      "arxiv_id": "1806.09231",
      "role": "Extension",
      "relationship_sentence": "Formulated equivariant nonlinearities as Clebsch–Gordan tensor products in spherical harmonic space, a construction recast through Gaunt integrals and made efficient here by changing to a 2D Fourier basis."
    },
    {
      "title": "e3nn: Euclidean Neural Networks",
      "authors": "Mario Geiger et al.",
      "year": 2022,
      "arxiv_id": "2207.09453",
      "role": "Baseline",
      "relationship_sentence": "Provides the de facto TensorProduct layer implementing CG-based irrep couplings in modern E(3) networks; the proposed method serves as a drop-in faster replacement for this core operation."
    },
    {
      "title": "SE(3)-Transformers: 3D Roto-Translation Equivariant Attention Networks",
      "authors": "Fabian B. Fuchs et al.",
      "year": 2020,
      "arxiv_id": "2006.10503",
      "role": "Related Problem",
      "relationship_sentence": "Relies on CG-based tensor products to couple features in equivariant attention and thus embodies the same tensor-product bottleneck alleviated by the accelerated Gaunt/Fourier formulation."
    },
    {
      "title": "Spherical CNNs",
      "authors": "Carlos Esteves et al.",
      "year": 2018,
      "arxiv_id": "1709.04893",
      "role": "Inspiration",
      "relationship_sentence": "Demonstrated that operations on spherical signals can be computed efficiently by moving between spherical harmonics and 2D Fourier grids via FFTs, directly motivating the Fourier-basis acceleration of spherical-function multiplications underlying tensor products."
    },
    {
      "title": "A novel sampling theorem on the sphere",
      "authors": "Jason D. McEwen et al.",
      "year": 2011,
      "arxiv_id": "",
      "role": "Foundation",
      "relationship_sentence": "Established an exact sampling theorem and fast spherical harmonic transforms that separate azimuthal Fourier modes, enabling the practical change of basis from spherical harmonics to a 2D Fourier representation leveraged for efficient multiplication."
    }
  ],
  "synthesis_narrative": "Rotation- and translation-equivariant modeling in 3D widely relies on coupling irreducible SO(3) representations through Clebsch–Gordan-projected tensor products, formalized for point clouds by Tensor Field Networks, which crystallized the operation used throughout E(3)-equivariant models. Cormorant pushed such spherical tensor couplings to higher orders for molecular learning and made explicit the severe computational scaling incurred by repeated CG-based tensor products. In parallel, Clebsch–Gordan Nets developed fully Fourier-space spherical CNNs where equivariant nonlinearities are realized as CG tensor products in the spherical harmonic domain, highlighting that equivariant coupling is equivalent to multiplying spherical functions and projecting back. The e3nn framework standardized these CG-based TensorProduct operators, making them the prevailing building block—and practical bottleneck—across modern E(3) architectures. From the signal-processing side, Spherical CNNs showed that spherical operations can be executed efficiently by leveraging FFTs on 2D longitude–latitude grids, while McEwen and Wiaux established sampling theorems and fast SHTs that separate azimuthal Fourier modes, enabling practical changes of basis between spherical harmonics and 2D Fourier representations. Together, these works expose a clear opportunity: CG-based tensor products are the correctness-preserving mechanism for equivariance, but their cost explodes with order; meanwhile, multiplying spherical functions can be accelerated in Fourier-like bases. The present paper synthesizes these insights by exploiting the equivalence between CG couplings and Gaunt integrals to view tensor products as spherical-function multiplication, then changing basis to a 2D Fourier representation where this multiplication can be computed far more efficiently, yielding a drop-in acceleration for CG-based layers in e3nn-style and SE(3)-Transformer models.",
  "target_paper": {
    "title": "Enabling Efficient Equivariant Operations in the Fourier Basis via Gaunt Tensor Products",
    "authors": "Shengjie Luo, Tianlang Chen, Aditi S. Krishnapriyan",
    "conference": "ICLR",
    "year": 2024,
    "presentation_type": "spotlight",
    "keywords": "Equivariant Operations; Tensor Product; Change of basis; Spherical Harmonics; Fourier Basis; equivariant neural networks",
    "abstract": "Developing equivariant neural networks for the E(3) group plays an important role in modeling 3D data across real-world applications. Enforcing this equivariance primarily involves the tensor products of irreducible representations (irreps). However, the computational complexity of such operations increases significantly as higher-order tensors are used. In this work, we propose a systematic approach to substantially accelerate the computation of the tensor products of irreps. We mathematically connect the commonly used Clebsch-Gordan coefficients to the Gaunt coefficients, which are integrals of products of three spherical harmonics. Through Gaunt coefficients, the tensor product of irreps becomes equivalent to the multiplication between spherical functions represented by spherical harmonics. This perspective further allows us to change the basis for the equivariant operations from spherical harmonics to a 2D Fourier basis. Consequently, the multiplication between spherical functions ",
    "openreview_id": "mhyQXJ6JsK",
    "forum_id": "mhyQXJ6JsK"
  },
  "analysis_timestamp": "2026-01-06T23:29:12.817881"
}