{
  "prior_works": [
    {
      "title": "Ordinary differential equations, transport theory and Sobolev spaces",
      "authors": "R. J. DiPerna et al.",
      "year": 1989,
      "arxiv_id": "",
      "role": "Foundation",
      "relationship_sentence": "This work establishes that solutions of the continuity (transport) equation can be represented as pushforwards of an initial density by Lagrangian flow maps, which LFlows adopt to model ρ_t via time-conditioned diffeomorphisms."
    },
    {
      "title": "Variational Inference with Normalizing Flows",
      "authors": "Danilo Jimenez Rezende et al.",
      "year": 2015,
      "arxiv_id": "1505.05770",
      "role": "Foundation",
      "relationship_sentence": "The change-of-variables formulation for transforming a base density through invertible maps is the probabilistic backbone LFlows use to represent time-varying densities via diffeomorphic transformations."
    },
    {
      "title": "Density Estimation using Real NVP",
      "authors": "Laurent Dinh et al.",
      "year": 2017,
      "arxiv_id": "1605.08803",
      "role": "Extension",
      "relationship_sentence": "LFlows extend coupling-based normalizing flows by conditioning the diffeomorphic transform on time and differentiating it to obtain an analytic velocity field consistent with the induced density evolution."
    },
    {
      "title": "Neural Ordinary Differential Equations",
      "authors": "Ricky T. Q. Chen et al.",
      "year": 2018,
      "arxiv_id": "1806.07366",
      "role": "Gap Identification",
      "relationship_sentence": "By modeling density dynamics via ODE-defined flows that require numerical solvers and divergence computations, this work motivates LFlows’ solver-free parameterization that yields velocities directly from the time-dependent diffeomorphism."
    },
    {
      "title": "FFJORD: Free-form Continuous Dynamics for Scalable Reversible Generative Models",
      "authors": "Will Grathwohl et al.",
      "year": 2019,
      "arxiv_id": "1810.01367",
      "role": "Gap Identification",
      "relationship_sentence": "FFJORD highlights the computational burden of CNFs (ODE integration and stochastic trace estimators), which LFlows avoid by constructing closed-form time-conditioned diffeomorphisms with analytic velocities."
    },
    {
      "title": "Physics-Informed Neural Networks: A Deep Learning Framework for Solving Forward and Inverse Problems Involving Nonlinear PDEs",
      "authors": "Maziar Raissi et al.",
      "year": 2019,
      "arxiv_id": "1711.10561",
      "role": "Baseline",
      "relationship_sentence": "As the dominant baseline enforcing PDEs via residual penalties, PINNs’ reliance on optimization over PDE constraints motivates LFlows’ design that guarantees the continuity equation without penalty terms or solvers."
    },
    {
      "title": "Flow Matching for Generative Modeling",
      "authors": "Yaron Lipman et al.",
      "year": 2022,
      "arxiv_id": "2210.02747",
      "role": "Inspiration",
      "relationship_sentence": "By framing density evolution as transport along a learned vector field satisfying the continuity equation, this work inspires LFlows’ continuity-equation-centric view, while LFlows obtain the vector field analytically from a time-conditioned diffeomorphism."
    }
  ],
  "synthesis_narrative": "Classical transport theory showed that solutions to the continuity equation can be represented by Lagrangian flow maps pushing forward an initial density, establishing a precise link between a vector field, its induced diffeomorphism, and density evolution. Normalizing flows operationalized this change-of-variables perspective for probabilistic modeling, enabling densities to be expressed through parameterized invertible transformations with tractable Jacobian determinants. Real NVP introduced practical, stable diffeomorphic architectures via coupling layers, making large-scale invertible maps feasible. In parallel, Neural ODEs and their continuous normalizing flow instantiations modeled dynamics by integrating vector fields, computing the instantaneous change in log-density via divergence, while FFJORD further demonstrated free-form continuous dynamics yet at the cost of expensive ODE solvers and stochastic trace estimators. PINNs approached PDE learning by minimizing residuals of governing equations, trading exact constraint satisfaction for penalty-based enforcement that can be unstable and computationally demanding. Flow Matching later emphasized learning vector fields whose induced flows transport densities along time-consistent paths that satisfy the continuity equation. Together these threads revealed that exact mass conservation arises naturally from diffeomorphic pushforwards, but existing methods either enforce PDEs approximately or rely on costly numerical solvers. The natural next step is to directly parameterize a time-conditioned diffeomorphism so that density evolution follows from change-of-variables, and to derive the velocity analytically as the time derivative of the map composed with its inverse—thereby guaranteeing the continuity equation without PDE penalties or ODE integration while retaining the expressivity of modern flow architectures.",
  "target_paper": {
    "title": "Lagrangian Flow Networks for Conservation Laws",
    "authors": "Fabricio Arend Torres, Marcello Massimo Negri, Marco Inversi, Jonathan Aellen, Volker Roth",
    "conference": "ICLR",
    "year": 2024,
    "presentation_type": "spotlight",
    "keywords": "Physics-informed Neural Network, Fluid Dynamics, Conservation Law, Partial Differential Equation, Conditional Normalizing Flows, Bird-Migration",
    "abstract": "We introduce Lagrangian Flow Networks (LFlows) for modeling fluid densities and velocities continuously in space and time.\nBy construction, the proposed LFlows satisfy the continuity equation,\na PDE describing mass conservation in its differential form. \nOur model is based on the insight that solutions to the continuity equation can be expressed as\ntime-dependent density transformations via differentiable and invertible maps.\nThis follows from classical theory of the existence and uniqueness of Lagrangian flows for smooth vector fields.\nHence, we model fluid densities by transforming a base density with parameterized diffeomorphisms conditioned on time.\nThe key benefit compared to methods relying on numerical ODE solvers or PINNs is that the analytic expression of the velocity is always consistent with changes in density.\nFurthermore, we require neither expensive numerical solvers, nor additional penalties to enforce the PDE.\nLFlows show higher predictive accuracy in density modeling t",
    "openreview_id": "Nshk5YpdWE",
    "forum_id": "Nshk5YpdWE"
  },
  "analysis_timestamp": "2026-01-06T10:52:50.216177"
}