{
  "prior_works": [
    {
      "title": "Bayesian Flow Networks",
      "authors": "Yuxuan Song et al.",
      "year": 2023,
      "arxiv_id": "",
      "role": "Extension",
      "relationship_sentence": "GeoBFN directly extends the BFN idea of learning probability flows in the parameter space of explicit distributions by instantiating it for 3D molecular geometries and adding SE(3)-equivariant parameter inter-dependencies to keep densities invariant to rigid motions."
    },
    {
      "title": "GeoDiff: a Geometric Diffusion Model for Molecular Conformation Generation",
      "authors": "Minkai Xu et al.",
      "year": 2022,
      "arxiv_id": "2203.02923",
      "role": "Baseline",
      "relationship_sentence": "GeoBFN targets the same 3D conformation generation task as GeoDiff but replaces coordinate/angle noising with distribution-parameter flows to address the multi-modality and noise sensitivity GeoDiff struggles with."
    },
    {
      "title": "Equivariant Diffusion for Molecule Generation in 3D",
      "authors": "Emiel Hoogeboom et al.",
      "year": 2022,
      "arxiv_id": "",
      "role": "Baseline",
      "relationship_sentence": "Building on this work’s E(3)-equivariant diffusion for 3D molecules, GeoBFN preserves SE(3)-invariant density modeling by enforcing equivariant dependencies among distribution parameters rather than injecting noise in coordinates."
    },
    {
      "title": "GeoMol: Torsional Geometric Generation of Molecular 3D Conformations",
      "authors": "Octavian-Eugen Ganea et al.",
      "year": 2021,
      "arxiv_id": "",
      "role": "Foundation",
      "relationship_sentence": "GeoMol crystallized the formulation of conformation generation with torsion-centric parameterization, highlighting multimodal geometry and motivating GeoBFN’s choice to model diverse modes in a differentiable parameter space."
    },
    {
      "title": "E(n) Equivariant Graph Neural Networks",
      "authors": "Victor Garcia Satorras et al.",
      "year": 2021,
      "arxiv_id": "2102.09844",
      "role": "Extension",
      "relationship_sentence": "GeoBFN adopts EGNN-style equivariant message passing to couple the parameters of its output distributions so that the learned density remains SE(3)-consistent while capturing inter-atomic dependencies."
    },
    {
      "title": "Stochastic Interpolants: Bridging Normalizing Flows and Denoising Diffusion Models",
      "authors": "Michael D. Albergo and Eric Vanden-Eijnden",
      "year": 2022,
      "arxiv_id": "",
      "role": "Inspiration",
      "relationship_sentence": "The concept of learning generative probability paths via interpolants underpins GeoBFN’s training of Bayesian flows over distribution parameters instead of simulating noisy coordinate dynamics."
    },
    {
      "title": "GEOM: Energy-Annotated Molecular Conformations for Property Prediction and Molecular Generation",
      "authors": "Samuel Axelrod and Rafael Gomez-Bombarelli",
      "year": 2020,
      "arxiv_id": "",
      "role": "Foundation",
      "relationship_sentence": "GEOM defined the multi-conformer, highly multimodal benchmark that concretely motivates GeoBFN’s unified probabilistic treatment of diverse molecular geometry modes."
    }
  ],
  "synthesis_narrative": "Bayesian Flow Networks introduced learning probability flows in the parameter space of explicit distributions, offering a path to generative modeling that avoids injecting noise directly in data space and enabling calibrated probabilistic outputs. In 3D molecular conformation generation, GeoDiff established diffusion-based training over coordinates or torsion angles, showing strong results but also revealing sensitivity to noise and difficulties capturing highly multimodal conformer ensembles. Equivariant Diffusion for Molecule Generation extended diffusion with E(3)-equivariance, demonstrating the importance of SE(3)-consistent dynamics for stable 3D structures. GeoMol emphasized torsion-centric parameterizations and highlighted the intrinsic multimodality of conformers, arguing for representations and models that can handle diverse geometry modes. EGNN provided a lightweight, expressive E(n)-equivariant message-passing mechanism to model inter-atomic dependencies while preserving rigid-motion symmetry. Stochastic Interpolants unified flows and diffusion through learned probability paths, suggesting training objectives that operate on continuous interpolations rather than noisy SDEs. The GEOM dataset crystallized the problem setting by providing energy-annotated, multi-conformer benchmarks that stress-test mode coverage and stability. Together, these works expose a gap: diffusion on coordinates can be noise-fragile and mode-limiting even with equivariance, while flow-based formulations promise stability but lack a multimodal, SE(3)-aware parameterization. Synthesizing these insights, the current work carries BFN into 3D geometry by learning equivariant interdependencies among distribution parameters, thereby maintaining SE(3)-invariant densities and unifying probabilistic modeling across modalities to robustly capture multimodal molecular geometries.",
  "target_paper": {
    "title": "Unified Generative Modeling of 3D Molecules with Bayesian Flow Networks",
    "authors": "Yuxuan Song, Jingjing Gong, Hao Zhou, Mingyue Zheng, Jingjing Liu, Wei-Ying Ma",
    "conference": "ICLR",
    "year": 2024,
    "presentation_type": "oral",
    "keywords": "Drug Design, Molecule Generation, Deep Learning, Computational Biology",
    "abstract": "Advanced generative model (\\textit{e.g.}, diffusion model) derived from simplified continuity assumptions of data distribution, though showing promising progress, has been difficult to apply directly to geometry generation applications due to the \\textit{multi-modality} and \\textit{noise-sensitive} nature of molecule geometry. \nThis work introduces Geometric Bayesian Flow Networks (GeoBFN), which naturally fits molecule geometry by modeling diverse modalities in the differentiable parameter space of distributions. GeoBFN maintains the SE-(3) invariant density modeling property by incorporating equivariant inter-dependency modeling on parameters of distributions and unifying the probabilistic modeling of different modalities. \nThrough optimized training and sampling techniques, we demonstrate that GeoBFN achieves state-of-the-art performance on multiple 3D molecule generation benchmarks in terms of generation quality (90.87\\% molecule stability in QM9 and 85.6\\% atom stability in GEOM-D",
    "openreview_id": "NSVtmmzeRB",
    "forum_id": "NSVtmmzeRB"
  },
  "analysis_timestamp": "2026-01-06T14:50:11.357722"
}