{
  "prior_works": [
    {
      "title": "Fourier Features Let Networks Learn High Frequency Functions in Low Dimensional Domains",
      "authors": "Matthew Tancik et al.",
      "year": 2020,
      "arxiv_id": "2006.10739",
      "role": "Baseline",
      "relationship_sentence": "This work established sinusoidal Fourier feature mappings for coordinates as a strong default for implicit coordinate MLPs, which the current paper treats as the main baseline (DFS-style sin/cos on lon/lat) that it generalizes to the sphere."
    },
    {
      "title": "Implicit Neural Representations with Periodic Activation Functions",
      "authors": "Vincent Sitzmann et al.",
      "year": 2020,
      "arxiv_id": "2006.09661",
      "role": "Extension",
      "relationship_sentence": "SIREN introduced periodic activations that enable MLPs to represent high-frequency signals, and the current paper directly builds on this by employing SirenNets as a learned, data-adaptive alternative to fixed DFS features for geographic coordinates."
    },
    {
      "title": "Spherical CNNs",
      "authors": "Carlos Esteves et al.",
      "year": 2018,
      "arxiv_id": "1801.10130",
      "role": "Inspiration",
      "relationship_sentence": "By showing that spherical harmonics provide a native basis for signals on the sphere and avoid planar projection artifacts (e.g., near the poles), this paper motivates replacing planar Fourier encodings with spherical harmonic bases for global geodata."
    },
    {
      "title": "Gauge Equivariant Convolutional Networks on Spheres",
      "authors": "Taco S. Cohen et al.",
      "year": 2019,
      "arxiv_id": "1902.04615",
      "role": "Inspiration",
      "relationship_sentence": "This work formalized harmonic processing on spherical domains and highlighted the pitfalls of treating global signals as planar, directly motivating the use of spherical harmonic bases for location encoding."
    },
    {
      "title": "Presence-Only Geographic Priors for Fine-Grained Image Recognition",
      "authors": "Oisin Mac Aodha et al.",
      "year": 2019,
      "arxiv_id": "1906.05272",
      "role": "Foundation",
      "relationship_sentence": "By framing species distribution priors on the sphere and demonstrating large gains from explicit geographic representations, this paper established the problem setting and need for strong global location encoders targeted by the current work."
    },
    {
      "title": "Random Features for Large-Scale Kernel Machines",
      "authors": "Ali Rahimi et al.",
      "year": 2007,
      "arxiv_id": null,
      "role": "Foundation",
      "relationship_sentence": "The random Fourier feature principle underlying sinusoidal coordinate mappings provides the theoretical basis that DFS-style encodings build on and that the current paper generalizes to spherical harmonics and learned sinusoidal networks."
    }
  ],
  "synthesis_narrative": "Fourier feature mappings demonstrated that projecting low-dimensional coordinates through sinusoidal bases allows simple MLPs to capture high-frequency structure, providing a practical template for encoding spatial inputs. Sinusoidal representation networks extended this idea by using periodic activations, turning the network itself into a learned harmonic function approximator rather than relying solely on fixed input encodings. Concurrently, work on spherical CNNs established that spherical harmonics are a native basis for signals on the sphere and help avoid distortions that arise from planar treatments of global data, while gauge-equivariant CNNs on spheres further systematized harmonic processing on curved domains and emphasized the pitfalls of Euclidean assumptions near poles and seams. In ecological modeling, presence-only geographic priors for fine-grained recognition made clear that explicit, global-scale geographic representations significantly improve predictive performance, underscoring the need for robust, domain-aligned location encoders. The theoretical grounding for using sinusoidal projections traces back to random Fourier features, which formalized the link between sin/cos mappings and kernel approximation.\nTogether, these works exposed a gap: fixed planar Fourier encodings (e.g., DFS on lon/lat) succeed broadly but misrepresent spherical topology and lack architectural guidance, while spherical harmonic processing and periodic networks offer principled, high-frequency function approximation directly on the sphere. Building on these insights, the current paper marries spherical harmonic bases with sinusoidal representation networks, yielding a native spherical location encoder and a learned, data-adaptive alternative to DFS that addresses pole artifacts and clarifies the role of network architecture.",
  "target_paper": {
    "title": "Geographic Location Encoding with Spherical Harmonics and Sinusoidal Representation Networks",
    "authors": "Marc Rußwurm, Konstantin Klemmer, Esther Rolf, Robin Zbinden, Devis Tuia",
    "conference": "ICLR",
    "year": 2024,
    "presentation_type": "spotlight",
    "keywords": "Location Encoding, Positional Encoding, Implicit Neural Representations, Species Distribution Modeling",
    "abstract": "Learning representations of geographical space is vital for any machine learning model that integrates geolocated data, spanning application domains such as remote sensing, ecology, or epidemiology. Recent work embeds coordinates using sine and cosine projections based on Double Fourier Sphere (DFS) features. These embeddings assume a rectangular data domain even on global data, which can lead to artifacts, especially at the poles. At the same time, little attention has been paid to the exact design of the neural network architectures with which these functional embeddings are combined. This work proposes a novel location encoder for globally distributed geographic data that combines spherical harmonic basis functions, natively defined on spherical surfaces, with sinusoidal representation networks (SirenNets) that can be interpreted as learned Double Fourier Sphere embedding. We systematically evaluate positional embeddings and neural network architectures across various benchmarks and",
    "openreview_id": "PudduufFLa",
    "forum_id": "PudduufFLa"
  },
  "analysis_timestamp": "2026-01-06T14:57:43.094935"
}