{
  "prior_works": [
    {
      "title": "Realistic Evaluation of Deep Semi-Supervised Learning Algorithms",
      "authors": "Avital Oliver et al.",
      "year": 2018,
      "arxiv_id": "1804.09170",
      "role": "Foundation",
      "relationship_sentence": "This work established standardized, fair SSL evaluation practices and strong-baseline comparisons, directly shaping this paper’s unified re-implementation ethos and motivating its extension of realistic evaluation to open environments via RAC."
    },
    {
      "title": "OpenMatch: Open-set Consistency Regularization for Semi-Supervised Learning with Outliers",
      "authors": "Kuniaki Saito et al.",
      "year": 2021,
      "arxiv_id": null,
      "role": "Foundation",
      "relationship_sentence": "By formalizing open-set SSL where unlabeled data contain unknown classes and proposing inlier-only consistency, OpenMatch defined the label-space mismatch setting that this paper generalizes and evaluates systematically with robustness curves."
    },
    {
      "title": "AdaMatch: A Unified Approach to Semi-Supervised Learning and Domain Adaptation",
      "authors": "David Berthelot et al.",
      "year": 2021,
      "arxiv_id": "2106.04732",
      "role": "Related Problem",
      "relationship_sentence": "AdaMatch explicitly targets distribution shift between labeled and unlabeled data, providing both a method and setting that this paper incorporates as a key open-environment scenario in its benchmarks and theoretical analysis."
    },
    {
      "title": "FixMatch: Simplifying Semi-Supervised Learning with Consistency and Confidence Thresholding",
      "authors": "Kihyuk Sohn et al.",
      "year": 2020,
      "arxiv_id": "2001.07685",
      "role": "Baseline",
      "relationship_sentence": "As a dominant consistency-based SSL method using confidence-thresholded pseudo-labels, FixMatch serves as a primary baseline whose robustness breakdown under open-environment mismatches this paper quantifies with RAC and explains theoretically."
    },
    {
      "title": "ReMixMatch: Semi-Supervised Learning with Distribution Alignment and Augmentation",
      "authors": "David Berthelot et al.",
      "year": 2019,
      "arxiv_id": "1911.09785",
      "role": "Gap Identification",
      "relationship_sentence": "Its distribution alignment mechanism presumes matched class distributions between labeled and unlabeled sets, a key assumption this paper relaxes and stress-tests by varying label- and feature-space mismatches in open environments."
    },
    {
      "title": "Benchmarking Neural Network Robustness to Common Corruptions and Perturbations",
      "authors": "Dan Hendrycks and Thomas Dietterich",
      "year": 2019,
      "arxiv_id": "1903.12261",
      "role": "Inspiration",
      "relationship_sentence": "The corruption-severity sweeps and area-under-curve style summarization in ImageNet-C directly inspired this paper’s Robustness Analysis Curve to systematically quantify SSL performance as openness/shift severity increases."
    },
    {
      "title": "A theory of learning from different domains",
      "authors": "Shai Ben-David et al.",
      "year": 2010,
      "arxiv_id": "0902.3430",
      "role": "Foundation",
      "relationship_sentence": "Its domain adaptation generalization bounds via divergence measures underpin this paper’s theoretical framework decomposing SSL generalization under distribution and label-space mismatches in open environments."
    }
  ],
  "synthesis_narrative": "Prior SSL work established both methodological norms and the fragility of common assumptions. Realistic Evaluation of Deep Semi-Supervised Learning Algorithms codified fair protocols—strong supervised baselines, careful tuning, and standardized pipelines—ensuring claims about SSL hold under practical scrutiny. FixMatch introduced confidence-thresholded consistency with strong/weak augmentations, becoming the dominant template for modern SSL. ReMixMatch added distribution alignment and advanced augmentation, but implicitly leaned on matched class distributions between labeled and unlabeled sets. OpenMatch formalized open-set SSL where unknown-class outliers exist in unlabeled data, proposing inlier-only consistency and concretely exposing the label-space mismatch regime. AdaMatch unified SSL with domain adaptation to explicitly confront feature distribution shift between labeled and unlabeled data via alignment and adaptive targets. Outside SSL, ImageNet-C pioneered corruption-severity sweeps and area-under-curve summaries to quantify robustness across controlled shift levels. Theoretically, Ben-David et al. derived generalization bounds under domain divergence, isolating source risk and discrepancy terms that guide analysis under distribution mismatch.\nTogether, these works revealed that canonical SSL assumptions—matched distributions and shared label spaces—are routinely violated in practice, yet evaluation and theory lacked a unified treatment for such open environments. Building on the evaluation rigor of Oliver et al. and robustness-curve methodology from ImageNet-C, while drawing settings from OpenMatch and AdaMatch, the current paper synthesizes a Robustness Analysis Curve metric and a divergence-based theoretical framework, and re-implements key SSL baselines (e.g., FixMatch/ReMixMatch) to systematically benchmark and explain SSL robustness as open-environment mismatch varies.",
  "target_paper": {
    "title": "Realistic Evaluation of Semi-supervised Learning Algorithms in Open Environments",
    "authors": "Lin-Han Jia, Lan-Zhe Guo, Zhi Zhou, Yu-Feng Li",
    "conference": "ICLR",
    "year": 2024,
    "presentation_type": "spotlight",
    "keywords": "Semi-Supervised Learning; Robustness; Open Environments",
    "abstract": "Semi-supervised learning (SSL) is a powerful paradigm for leveraging unlabeled data and has been proven to be successful across various tasks. Conventional SSL studies typically assume close environment scenarios where labeled and unlabeled examples are independently sampled from the same distribution. However, real-world tasks often involve open environment scenarios where the data distribution, label space, and feature space could differ between labeled and unlabeled data. This inconsistency introduces robustness challenges for SSL algorithms. In this paper, we first propose several robustness metrics for SSL based on the Robustness Analysis Curve (RAC), secondly, we establish a theoretical framework for studying the generalization performance and robustness of SSL algorithms in open environments, thirdly, we re-implement widely adopted SSL algorithms within a unified SSL toolkit and evaluate their performance on proposed open environment SSL benchmarks, including both image, text, a",
    "openreview_id": "RvUVMjfp8i",
    "forum_id": "RvUVMjfp8i"
  },
  "analysis_timestamp": "2026-01-06T06:30:14.552551"
}