{
  "prior_works": [
    {
      "title": "Portfolio Selection",
      "authors": "Harry Markowitz",
      "year": 1952,
      "arxiv_id": null,
      "role": "Foundation",
      "relationship_sentence": "The hyperportfolio task directly generalizes Markowitz’s portfolio selection by treating heterogeneous societal time series as investable assets and evaluating agent decisions with risk–return criteria."
    },
    {
      "title": "ReAct: Synergizing Reasoning and Acting in Language Models",
      "authors": "Shunyu Yao et al.",
      "year": 2022,
      "arxiv_id": "2210.03629",
      "role": "Inspiration",
      "relationship_sentence": "The Analyst-Assistant-Actuator architecture operationalizes ReAct’s thought–action–observation loop by separating analysis, tool use, and execution into coordinated roles for decision-making on time series."
    },
    {
      "title": "Chain-of-Thought Prompting Elicits Reasoning in Large Language Models",
      "authors": "Jason Wei et al.",
      "year": 2022,
      "arxiv_id": "2201.11903",
      "role": "Foundation",
      "relationship_sentence": "The Hypothesis & Proof prompting builds on Chain-of-Thought by structuring step-by-step reasoning into an explicit hypothesis followed by a formal, evidence-grounded justification."
    },
    {
      "title": "Precise Zero-shot Dense Retrieval without Relevance Labels (HyDE)",
      "authors": "Luyu Gao et al.",
      "year": 2022,
      "arxiv_id": "2212.10496",
      "role": "Inspiration",
      "relationship_sentence": "HyDE’s idea of generating a hypothetical document to guide retrieval directly inspires using a hypothesized claim to steer searches in news/knowledge bases and then constructing a proof."
    },
    {
      "title": "Self-Ask: A Simple Approach for Improving Multi-Step Reasoning by Decomposing Problems into Subquestions",
      "authors": "Ofir Press et al.",
      "year": 2022,
      "arxiv_id": "2210.03350",
      "role": "Inspiration",
      "relationship_sentence": "The Hypothesis & Proof procedure adopts Self-Ask’s decomposition-and-search pattern by breaking societal analyses into verifiable subclaims queried via tools before committing to an action."
    },
    {
      "title": "Reflexion: Language Agents with Verbal Reinforcement Learning",
      "authors": "Noah Shinn et al.",
      "year": 2023,
      "arxiv_id": "2303.11366",
      "role": "Gap Identification",
      "relationship_sentence": "Reflexion’s episodic self-improvement highlights the need for a persistent, real-world setting and long-horizon evaluation, motivating a lifelong environment with external knowledge and time-series feedback."
    },
    {
      "title": "FinRL: A Deep Reinforcement Learning Library for Automated Stock Trading in Quantitative Finance",
      "authors": "Xiao-Yang Liu et al.",
      "year": 2021,
      "arxiv_id": "2011.09607",
      "role": "Related Problem",
      "relationship_sentence": "FinRL’s backtested decision-making on financial time series provides the direct paradigm that is generalized from market assets to thousands of societal series under a unified portfolio-style evaluation."
    }
  ],
  "synthesis_narrative": "Portfolio theory established that decisions over time series can be evaluated via risk–return trade-offs, formalized by Markowitz as portfolio selection. In parallel, tool-augmented language agents showed how to interleave reasoning and external actions: ReAct introduced a thought–action–observation loop that couples deliberation with search and environment feedback. Chain-of-Thought revealed that eliciting explicit, stepwise reasoning improves complex analysis, while HyDE demonstrated that generating a hypothesis-like surrogate text can steer retrieval to the most informative evidence. Self-Ask further refined multi-step reasoning by decomposing questions into subproblems and using targeted searches to verify intermediate claims. Reflexion argued that agents benefit from iterative self-improvement across episodes, pointing to the need for persistent memory and longitudinal feedback rather than single-shot tasks. In time-series decision-making, FinRL operationalized backtested actions over financial signals, illustrating how real-world streams can serve as an objective feedback channel for agent performance.\nTogether these strands suggested a natural opportunity: combine explicit hypothesis-driven reasoning, retrieval-verified evidence, and tool-mediated action with a rigorous, backtestable objective over time series. By extending portfolio selection beyond markets to diverse societal indicators, the hyperportfolio formulation provides scalable, reliable evaluation. Structuring agents into distinct roles mirrors ReAct’s deliberate act loops while incorporating CoT-style reasoning, HyDE-guided retrieval, and Self-Ask verification to ground analyses in real sources. Embedding this within a persistent environment addresses Reflexion’s call for lifelong improvement, yielding agents that analyze real-world text and act on time series with objective, longitudinal feedback.",
  "target_paper": {
    "title": "SocioDojo: Building Lifelong Analytical Agents with Real-world Text and Time Series",
    "authors": "Junyan Cheng, Peter Chin",
    "conference": "ICLR",
    "year": 2024,
    "presentation_type": "spotlight",
    "keywords": "Large Langauge Models, Agent, Prompt Tunning, Time series forcasting",
    "abstract": "We introduce SocioDojo, an open-ended lifelong learning environment for developing ready-to-deploy autonomous agents capable of performing human-like analysis and decision-making on societal topics such as economics, finance, politics, and culture. It consists of (1) information sources from news, social media, reports, etc., (2) a knowledge base built from books, journals, and encyclopedias, plus a toolbox of Internet and knowledge graph search interfaces, (3) 30K high-quality time series in finance, economy, society, and polls, which support a novel task called \"hyperportfolio\", that can reliably and scalably evaluate societal analysis and decision-making power of agents, inspired by portfolio optimization with time series as assets to \"invest\". We also propose a novel Analyst-Assistant-Actuator architecture for the hyperportfolio task, and a Hypothesis & Proof prompting for producing in-depth analyses on input news, articles, etc. to assist decision-making. We perform experiments an",
    "openreview_id": "s9z0HzWJJp",
    "forum_id": "s9z0HzWJJp"
  },
  "analysis_timestamp": "2026-01-06T16:41:58.335744"
}