{
  "prior_works": [
    {
      "title": "Approximating K-means-type Clustering via Semidefinite Programming",
      "authors": "Peng et al.",
      "year": 2007,
      "arxiv_id": "",
      "role": "Foundation",
      "relationship_sentence": "The paper adopts the Peng–Wei SDP relaxation as the convex k-means formulation and then solves a nonnegative low-rank restriction of this exact SDP."
    },
    {
      "title": "Clustering Subgaussian Mixtures via Semidefinite Programming",
      "authors": "Mixon et al.",
      "year": 2017,
      "arxiv_id": "",
      "role": "Foundation",
      "relationship_sentence": "This work establishes the statistical optimality and exact recovery conditions for the Peng–Wei k-means SDP, which the new algorithm is designed to match while being computationally scalable."
    },
    {
      "title": "A Nonlinear Programming Algorithm for Solving Semidefinite Programs via Low-Rank Factorization",
      "authors": "Burer et al.",
      "year": 2003,
      "arxiv_id": "",
      "role": "Inspiration",
      "relationship_sentence": "The method directly uses the Burer–Monteiro low-rank factorization to turn the k-means SDP into a tractable nonconvex optimization over low-rank factors with nonnegativity."
    },
    {
      "title": "The Nonconvex Burer–Monteiro Approach Works on Smooth Semidefinite Programs",
      "authors": "Boumal et al.",
      "year": 2018,
      "arxiv_id": "",
      "role": "Inspiration",
      "relationship_sentence": "Global optimality insights for Burer–Monteiro factorizations motivate the paper’s use of low-rank nonconvex optimization to retain SDP-level guarantees, adapted here to include nonnegativity constraints."
    },
    {
      "title": "On the Equivalence of Nonnegative Matrix Factorization and Spectral Clustering",
      "authors": "Ding et al.",
      "year": 2005,
      "arxiv_id": "",
      "role": "Related Problem",
      "relationship_sentence": "The equivalence between orthogonality-constrained NMF and clustering suggests the NMF-like structure used in the proposed nonnegative low-rank parameterization of the SDP."
    },
    {
      "title": "SymNMF: Nonnegative Low-Rank Approximation for Clustering",
      "authors": "Kuang et al.",
      "year": 2015,
      "arxiv_id": "",
      "role": "Baseline",
      "relationship_sentence": "Symmetric NMF provides the practical, scalable clustering template whose simplicity the new method emulates while supplying the missing SDP-level statistical guarantees."
    }
  ],
  "synthesis_narrative": "The Peng–Wei relaxation formulated k-means as a semidefinite program, providing a clean convex surrogate for the combinatorial objective with an assignment-matrix interpretation that later works could analyze. Building on this formulation, results on subgaussian mixtures showed that the k-means SDP achieves exact recovery and near-optimal statistical separation conditions, establishing the benchmark statistical guarantees for convex relaxations of k-means. Independently, the Burer–Monteiro factorization proposed replacing the SDP variable by a low-rank product to obtain a scalable nonconvex program, and subsequent theory on the Burer–Monteiro landscape demonstrated that, under mild conditions, such factorizations can avoid spurious local minima and recover SDP optima. In parallel, NMF-based clustering advanced practical simplicity: the equivalence between orthogonality-constrained NMF and spectral clustering clarified why nonnegativity and low-rank structure induce cluster assignments, and SymNMF provided an efficient algorithmic template for large-scale clustering, albeit without rigorous statistical optimality.\n\nTogether, these strands reveal a gap and an opportunity: SDPs deliver optimal statistical guarantees yet are computationally prohibitive, while NMF is scalable but lacks theory. By taking the Peng–Wei k-means SDP as the target of statistical optimality, importing the Burer–Monteiro low-rank parameterization to make it scalable, and imposing nonnegativity in an NMF-like factorization aligned with clustering structure, the current work synthesizes these ideas to produce an algorithm as simple as SymNMF yet provably matching the SDP’s optimal recovery guarantees.",
  "target_paper": {
    "title": "Statistically Optimal $K$-means Clustering via Nonnegative Low-rank Semidefinite Programming",
    "authors": "Yubo Zhuang, Xiaohui Chen, Yun Yang, Richard Y. Zhang",
    "conference": "ICLR",
    "year": 2024,
    "presentation_type": "oral",
    "keywords": "clustering, Burer-Monteiro, semidefinite programming",
    "abstract": "$K$-means clustering is a widely used machine learning method for identifying patterns in large datasets. Recently, semidefinite programming (SDP) relaxations have been proposed for solving the $K$-means optimization problem, which enjoy strong statistical optimality guarantees. However, the prohibitive cost of implementing an SDP solver renders these guarantees inaccessible to practical datasets. In contrast, nonnegative matrix factorization (NMF) is a simple clustering algorithm widely used by machine learning practitioners, but it lacks a solid statistical underpinning and theoretical guarantees. In this paper, we consider an NMF-like algorithm that solves a nonnegative low-rank restriction of the SDP-relaxed $K$-means formulation using a nonconvex Burer--Monteiro factorization approach. The resulting algorithm is as simple and scalable as state-of-the-art NMF algorithms while also enjoying the same strong statistical optimality guarantees as the SDP. In our experiments, we observe ",
    "openreview_id": "v7ZPwoHU1j",
    "forum_id": "v7ZPwoHU1j"
  },
  "analysis_timestamp": "2026-01-07T00:07:10.718583"
}