{
  "prior_works": [
    {
      "title": "Mirror Descent and Nonlinear Projected Subgradient Methods for Convex Optimization",
      "authors": "Amir Beck et al.",
      "year": 2003,
      "arxiv_id": null,
      "role": "Foundation",
      "relationship_sentence": "This paper provides the mirror descent framework with Bregman divergences that the authors adopt to formalize how the choice of distance (geometry) determines synaptic update dynamics and thus stationary weight distributions."
    },
    {
      "title": "Exponentiated Gradient versus Gradient Descent for Linear Predictors",
      "authors": "Jyrki Kivinen et al.",
      "year": 1997,
      "arxiv_id": null,
      "role": "Extension",
      "relationship_sentence": "By showing that KL-based mirror descent yields multiplicative (exponentiated) updates, this work supplies the concrete non-Euclidean geometry the authors extend to synaptic plasticity to explain log-normal weight statistics."
    },
    {
      "title": "Natural Gradient Works Efficiently in Learning",
      "authors": "Shun-ichi Amari",
      "year": 1998,
      "arxiv_id": null,
      "role": "Inspiration",
      "relationship_sentence": "Amari’s formulation of learning as gradient flow in a non-Euclidean (Riemannian) metric directly motivates the paper’s central premise that the geometry of parameter space—not just update rules—governs learning behavior and outcomes."
    },
    {
      "title": "Multiplicative dynamics underlie the emergence of the log-normal distribution of spine sizes",
      "authors": "Yoav Loewenstein et al.",
      "year": 2011,
      "arxiv_id": null,
      "role": "Foundation",
      "relationship_sentence": "Their evidence that synaptic spine sizes evolve via multiplicative dynamics producing log-normal distributions supplies the empirical signature the authors target and connect to a specific mirror-descent geometry."
    },
    {
      "title": "The log-dynamic brain: how skewed distributions affect network operations",
      "authors": "György Buzsáki et al.",
      "year": 2014,
      "arxiv_id": null,
      "role": "Foundation",
      "relationship_sentence": "This review establishes the ubiquity and functional significance of log-normal-like, heavy-tailed distributions (including synaptic strengths), providing the empirical constraint that guides the paper’s geometric analysis."
    },
    {
      "title": "Backpropagation and the brain",
      "authors": "Timothy P. Lillicrap et al.",
      "year": 2020,
      "arxiv_id": null,
      "role": "Gap Identification",
      "relationship_sentence": "By surveying biologically plausible approximations to gradient descent that implicitly assume Euclidean geometry, this work delineates the key limitation the authors address by relaxing the Euclidean assumption via mirror descent."
    }
  ],
  "synthesis_narrative": "Mirror descent, as formalized by Beck and Teboulle, frames optimization updates as steepest descent with respect to a chosen Bregman divergence, making the geometry of parameter space an explicit modeling choice. Kivinen and Warmuth’s exponentiated gradient instantiates this idea with a KL-based mirror map that yields multiplicative updates, demonstrating how non-Euclidean geometry changes the qualitative behavior of learning dynamics. Amari’s natural gradient further elevates geometry to a first-class object by placing learning on a Riemannian manifold, establishing that non-Euclidean metrics can be the principled, invariant way to describe parameter updates. On the empirical side, Loewenstein and colleagues showed that synaptic spine sizes follow multiplicative dynamics that generate log-normal distributions, while Buzsáki and Mizuseki documented the prevalence and functional importance of heavy-tailed, log-normal-like distributions across neural systems, including synaptic strengths. In contrast, Lillicrap and co-authors surveyed biologically plausible learning rules as approximations to gradient descent that largely inherit an implicit Euclidean geometry assumption. Together, these works reveal a gap: empirical synaptic statistics suggest multiplicative, non-Euclidean dynamics, while much theory assumes Euclidean updates. The synthesis naturally asks how the choice of geometry determines long-run synaptic statistics. By importing mirror descent’s Bregman geometry and the exponentiated-gradient intuition into synaptic plasticity, the paper shows that non-Euclidean geometries predict log-normal weight distributions and proposes experimental tests for synaptic geometry, directly aligning theory with observed synaptic statistics.",
  "target_paper": {
    "title": "Synaptic Weight Distributions Depend on the Geometry of Plasticity",
    "authors": "Roman Pogodin, Jonathan Cornford, Arna Ghosh, Gauthier Gidel, Guillaume Lajoie, Blake Aaron Richards",
    "conference": "ICLR",
    "year": 2024,
    "presentation_type": "spotlight",
    "keywords": "synaptic weight distributions, synaptic plasticity, biologically plausible learning, mirror descent",
    "abstract": "A growing literature in computational neuroscience leverages gradient descent and learning algorithms that approximate it to study synaptic plasticity in the brain. However, the vast majority of this work ignores a critical underlying assumption: the choice of distance for synaptic changes - i.e. the geometry of synaptic plasticity. Gradient descent assumes that the distance is Euclidean, but many other distances are possible, and there is no reason that biology necessarily uses Euclidean geometry. Here, using the theoretical tools provided by mirror descent, we show that the distribution of synaptic weights will depend on the geometry of synaptic plasticity. We use these results to show that experimentally-observed log-normal weight distributions found in several brain areas are not consistent with standard gradient descent (i.e. a Euclidean geometry), but rather with non-Euclidean distances. Finally, we show that it should be possible to experimentally test for different synaptic geo",
    "openreview_id": "x5txICnnjC",
    "forum_id": "x5txICnnjC"
  },
  "analysis_timestamp": "2026-01-06T10:28:22.403994"
}