{
  "prior_works": [
    {
      "title": "Dynamical Movement Primitives: Learning Attractor Models for Motor Behaviors",
      "authors": "Auke Ijspeert et al.",
      "year": 2013,
      "arxiv_id": null,
      "role": "Foundation",
      "relationship_sentence": "FLD replaces the hand-crafted phase-driven basis of rhythmic DMPs with a learned Fourier latent dynamical system that preserves periodic structure while capturing spatial–temporal coupling for interpolation across motions."
    },
    {
      "title": "Probabilistic Movement Primitives",
      "authors": "Anastasios Paraschos et al.",
      "year": 2013,
      "arxiv_id": null,
      "role": "Foundation",
      "relationship_sentence": "Adopting the idea of low-dimensional distributions over trajectories, FLD directly addresses ProMPs’ limited expressivity for complex periodic/quasi-periodic behaviors by learning a continuous Fourier-parameterized latent dynamics that generalizes across sparse demonstrations."
    },
    {
      "title": "Phase-Functioned Neural Networks for Character Control",
      "authors": "Daniel Holden et al.",
      "year": 2017,
      "arxiv_id": null,
      "role": "Inspiration",
      "relationship_sentence": "Building on the phase-conditioning insight of PFNNs, FLD generalizes phase to a learned latent with Fourier dynamics, decoupling phase from pose and enabling smooth interpolation to unseen targets."
    },
    {
      "title": "DeepMimic: Example-Guided Deep Reinforcement Learning of Physics-Based Character Skills",
      "authors": "Xue Bin Peng et al.",
      "year": 2018,
      "arxiv_id": "1804.02717",
      "role": "Baseline",
      "relationship_sentence": "Targeting the same physics-based tracking setting as DeepMimic, FLD replaces per-clip reference tracking with a structured Fourier latent motion model to overcome coverage sparsity and enable continuous interpolation."
    },
    {
      "title": "Deep learning for universal linear embeddings of nonlinear dynamics",
      "authors": "Nathaniel Lusch et al.",
      "year": 2018,
      "arxiv_id": "1712.09707",
      "role": "Extension",
      "relationship_sentence": "FLD extends Koopman-style autoencoding by constraining the latent evolution to harmonic (Fourier) dynamics, yielding a simple, linearizable latent that better captures periodic/quasi-periodic motion structure."
    },
    {
      "title": "AMP: Adversarial Motion Priors for Stylized Physics-Based Character Control",
      "authors": "Xue Bin Peng et al.",
      "year": 2021,
      "arxiv_id": null,
      "role": "Gap Identification",
      "relationship_sentence": "FLD addresses AMP’s lack of explicit temporal structure and dependence on dense motion priors by introducing an explicit Fourier latent dynamics that generalizes from sparse data while preserving motion periodicities."
    },
    {
      "title": "Implicit Neural Representations with Periodic Activation Functions (SIREN)",
      "authors": "Vincent Sitzmann et al.",
      "year": 2020,
      "arxiv_id": "2006.09661",
      "role": "Inspiration",
      "relationship_sentence": "Leveraging SIREN’s insight that sinusoidal bases efficiently encode periodic signals, FLD parameterizes motion in a Fourier latent space to stably learn and reconstruct periodic and quasi-periodic dynamics."
    }
  ],
  "synthesis_narrative": "Rhythmic dynamic movement primitives established that periodic motions can be encoded with a phase-driven dynamical system, but relied on hand-crafted bases that do not capture rich spatial–temporal coupling. Probabilistic Movement Primitives extended this line with distributions over trajectories, enabling variability and interpolation, though expressivity and scalability to complex periodic/quasi-periodic behaviors remained limited. Phase-Functioned Neural Networks showed that conditioning on a continuous phase variable can drive high-fidelity locomotion controllers, highlighting phase as a powerful motion coordinate. In physics-based character control, DeepMimic demonstrated robust RL tracking from motion clips, while its clip-centric design struggled when reference coverage is sparse. Adversarial Motion Priors improved generalization via learned motion priors, yet lacked explicit temporal structure to guarantee coherent interpolation across styles and frequencies. Parallel advances in Koopman autoencoders revealed that nonlinear dynamics can be encoded into latent spaces with simple, often linear evolution, and SIREN showed that sinusoidal parameterizations are especially effective for representing periodic signals. Together, these works point to a gap: controllers need an explicit, low-dimensional, temporally structured latent that both respects periodic/quasi-periodic dynamics and supports interpolation under sparse data. The natural synthesis is to learn a Koopman-inspired latent where dynamics are constrained to harmonic/Fourier evolution, using sinusoidal structure to encode spatial–temporal relations while providing a continuous parameterization for control. This yields a motion model that bridges PFNN-style phase conditioning with DeepMimic/AMP tracking, enabling robust online tracking and generalization to unseen targets from limited demonstrations.",
  "target_paper": {
    "title": "FLD: Fourier Latent Dynamics for Structured Motion Representation and Learning",
    "authors": "Chenhao Li, Elijah Stanger-Jones, Steve Heim, Sang bae Kim",
    "conference": "ICLR",
    "year": 2024,
    "presentation_type": "spotlight",
    "keywords": "latent dynamics, motion representation and generation, representation learning, reinforcement learning",
    "abstract": "Motion trajectories offer reliable references for physics-based motion learning but suffer from sparsity, particularly in regions that lack sufficient data coverage. To address this challenge, we introduce a self-supervised, structured representation and generation method that extracts spatial-temporal relationships in periodic or quasi-periodic motions. The motion dynamics in a continuously parameterized latent space enable our method to enhance the interpolation and generalization capabilities of motion learning algorithms. The motion learning controller, informed by the motion parameterization, operates online tracking of a wide range of motions, including targets unseen during training. With a fallback mechanism, the controller dynamically adapts its tracking strategy and automatically resorts to safe action execution when a potentially risky target is proposed. By leveraging the identified spatial-temporal structure, our work opens new possibilities for future advancements in gene",
    "openreview_id": "xsd2llWYSA",
    "forum_id": "xsd2llWYSA"
  },
  "analysis_timestamp": "2026-01-06T18:17:27.441529"
}