{
  "prior_works": [
    {
      "title": "Quasi-oracle estimation of heterogeneous treatment effects",
      "authors": "Xinkun Nie and Stefan Wager",
      "year": 2021,
      "arxiv_id": "1712.04912",
      "role": "Extension",
      "relationship_sentence": "This work introduced the orthogonal R-loss that provides a computable surrogate objective for CATE and is repurposed and benchmarked here as a central model-selection criterion (with careful tuning of its nuisance estimates)."
    },
    {
      "title": "Recursive partitioning for heterogeneous causal effects",
      "authors": "Susan Athey and Guido Imbens",
      "year": 2016,
      "arxiv_id": "",
      "role": "Foundation",
      "relationship_sentence": "By proposing the transformed outcome approach used to proxy treatment effects from observed data, this paper supplied the factual-only “tau-risk” style metric that is systematically evaluated and tuned in the present analysis."
    },
    {
      "title": "Doubly Robust Policy Evaluation and Learning",
      "authors": "Miroslav Dudík, John Langford, and Lihong Li",
      "year": 2011,
      "arxiv_id": "1103.4601",
      "role": "Foundation",
      "relationship_sentence": "Their IPS/DR estimators for off-policy value are directly used as value-based surrogate selection metrics by scoring CATE models through induced policies, which this work rigorously benchmarks and tunes."
    },
    {
      "title": "Real-World Uplift Modeling with Significance and Policy Control",
      "authors": "Nicholas J. Radcliffe and Patrick D. Surry",
      "year": 2011,
      "arxiv_id": "",
      "role": "Foundation",
      "relationship_sentence": "They introduced uplift curves and the Qini/AUUC family of metrics that serve as practical, widely used selection criteria, which this paper includes as key baselines for model selection without counterfactuals."
    },
    {
      "title": "Metalearners for estimating heterogeneous treatment effects using machine learning",
      "authors": "Sören R. Künzel, Jasjeet S. Sekhon, Peter J. Bickel, and Bin Yu",
      "year": 2019,
      "arxiv_id": "1706.03461",
      "role": "Baseline",
      "relationship_sentence": "This paper formalized the S-/T-/X-learners that constitute the primary CATE model families between which the surrogate metrics select, providing core baselines for the empirical comparisons."
    },
    {
      "title": "Double/debiased machine learning for treatment and structural parameters",
      "authors": "Victor Chernozhukov et al.",
      "year": 2018,
      "arxiv_id": "1608.00060",
      "role": "Foundation",
      "relationship_sentence": "Its Neyman-orthogonal scores and cross-fitting principles underpin the doubly robust, orthogonalized risks (including R-loss/DR value) and motivate the paper’s emphasis on careful nuisance estimation and hyperparameter tuning."
    }
  ],
  "synthesis_narrative": "Orthogonal learning for treatment effects established a computable surrogate risk: Nie and Wager’s R-loss provides an objective that depends only on observed outcomes and nuisance functions, enabling out-of-sample scoring of CATE models. Athey and Imbens earlier introduced the transformed outcome idea, turning observed data and propensities into a proxy label for treatment effect, which underlies tau-risk style factual-only selection. In parallel, off-policy evaluation advanced practical value-based surrogates: Dudík, Langford, and Li’s IPS/DR estimators estimate counterfactual policy value from observational data, furnishing natural criteria to rank CATE models via induced treat-versus-not-treat decisions. Uplift modeling supplied operational evaluation curves—Radcliffe and Surry’s Qini/AUUC—that summarize incremental impact and are often used to choose among uplift/CATE models. On the modeling side, Künzel et al. unified the S-/T-/X-learner meta-frameworks that produce a diverse set of CATE predictors among which selection is necessary. Finally, Chernozhukov et al.’s orthogonalization and cross-fitting formalized robust nuisance estimation, directly supporting both R-loss and DR-style selection metrics. Together these strands yielded multiple, competing surrogate selection criteria—orthogonal risk, transformed-outcome risk, uplift curves, and policy-value estimators—yet with limited head-to-head evaluation and unclear sensitivity to nuisance and tuning. The current work naturally synthesizes this landscape by benchmarking these specific surrogates across prominent CATE learners, systematically tuning their nuisance/hyperparameters (guided by orthogonalization principles), and augmenting evaluation with more realistic generative data—thereby revealing when each surrogate best aligns with true CATE accuracy and proposing improved model-selection strategies.",
  "target_paper": {
    "title": "Empirical Analysis of Model Selection for Heterogeneous Causal Effect Estimation",
    "authors": "Divyat Mahajan, Ioannis Mitliagkas, Brady Neal, Vasilis Syrgkanis",
    "conference": "ICLR",
    "year": 2024,
    "presentation_type": "spotlight",
    "keywords": "Heterogeneous Treatment Effect Estimation, Conditional Average Treatment Effect, Causal Inference, Model Selection",
    "abstract": "We study the problem of model selection in causal inference, specifically for conditional average treatment effect (CATE) estimation. Unlike machine learning, there is no perfect analogue of cross-validation for model selection as we do not observe the counterfactual potential outcomes. Towards this, a variety of surrogate metrics have been proposed for CATE model selection that use only observed data. However, we do not have a good understanding regarding their effectiveness due to limited comparisons in prior studies. We conduct an extensive empirical analysis to benchmark the surrogate model selection metrics introduced in the literature, as well as the novel ones introduced in this work. We ensure a fair comparison by tuning the hyperparameters associated with these metrics via AutoML, and provide more detailed trends by incorporating realistic datasets via generative modeling. Our analysis suggests novel model selection strategies based on careful hyperparameter selection of CATE ",
    "openreview_id": "yuy6cGt3KL",
    "forum_id": "yuy6cGt3KL"
  },
  "analysis_timestamp": "2026-01-06T07:31:39.665591"
}