{
  "prior_works": [
    {
      "title": "A computational fluid mechanics solution to the Monge–Kantorovich mass transfer problem",
      "authors": [
        "Jean-David Benamou",
        "Yann Brenier"
      ],
      "year": 2000,
      "role": "Theoretical foundation: dynamic OT",
      "relationship_sentence": "This paper’s Benamou–Brenier formulation underpins viewing transport as a time-dependent flow minimizing kinetic energy, the dynamic perspective that the new work extends to the entropic (Schrödinger bridge) setting and discretizes algorithmically."
    },
    {
      "title": "Sinkhorn Distances: Lightspeed Computation of Optimal Transport",
      "authors": [
        "Marco Cuturi"
      ],
      "year": 2013,
      "role": "Foundational entropic OT and computation",
      "relationship_sentence": "Cuturi’s entropic regularization popularized scalable OT and directly connects to Schrödinger bridges as dynamic entropic OT; the new method targets this same entropic regime but avoids Sinkhorn/mini-batch pitfalls in high dimensions."
    },
    {
      "title": "A survey of the Schrödinger problem and some of its connections with optimal transport",
      "authors": [
        "Christian Léonard"
      ],
      "year": 2014,
      "role": "Conceptual link between SB and (entropic) OT",
      "relationship_sentence": "Léonard’s survey formalizes the Schrödinger bridge as the dynamic, entropy-regularized counterpart of OT, providing the conceptual backbone for designing algorithms that compute SB maps rather than generic transport heuristics."
    },
    {
      "title": "Iterative Bregman Projections for Regularized Transportation Problems",
      "authors": [
        "Jean-David Benamou",
        "Guillaume Carlier",
        "Marco Cuturi",
        "Luca Nenna",
        "Gabriel Peyré"
      ],
      "year": 2015,
      "role": "Algorithmic template for entropic OT/SB via projections",
      "relationship_sentence": "This work develops iterative projection schemes (Sinkhorn-like) for entropic transport; the new paper pursues an alternative flow-based discretization to compute Schrödinger bridges that is better suited to high-dimensional, data-rich regimes."
    },
    {
      "title": "Diffusion Schrödinger Bridge",
      "authors": [
        "Valentin De Bortoli",
        "James Thornton",
        "Jeremy Heng",
        "Arnaud Doucet"
      ],
      "year": 2021,
      "role": "High-dimensional SB via score-based models",
      "relationship_sentence": "DSB introduced practical SB computation with score-based diffusion models but requires repeatedly training DDM-like scores in alternating procedures; the new work is a direct response, designing a flow discretization that eliminates such repeated trainings."
    },
    {
      "title": "Score-Based Generative Modeling through Stochastic Differential Equations",
      "authors": [
        "Yang Song",
        "Jascha Sohl-Dickstein",
        "Diederik P. Kingma",
        "Abhishek Kumar",
        "Stefano Ermon",
        "Ben Poole"
      ],
      "year": 2021,
      "role": "Methodological backbone for DDM/score flows",
      "relationship_sentence": "The SDE view of diffusion models and associated probability flow ODEs is the modeling machinery leveraged by prior SB/OT procedures that train score or velocity fields; the new algorithm reframes this machinery into a single flow discretization to avoid multiple DDM trainings."
    }
  ],
  "synthesis_narrative": "The paper’s core contribution—a single-flow discretization to compute Schrödinger bridges (SB) for unpaired data translation without repeatedly training diffusion-like models—sits at the intersection of dynamic optimal transport (OT), entropic regularization, and score/flow-based generative modeling. The dynamic OT viewpoint of Benamou and Brenier established transport as a time-dependent flow minimizing kinetic energy, which directly motivates constructing transport maps as velocity fields. Entropic OT, popularized computationally by Cuturi’s Sinkhorn approach, and its rigorous connection to SB synthesized in Léonard’s survey, shift this dynamic view to the entropy-regularized regime where SB is the target object. Iterative Bregman projection methods (Benamou–Carlier–Cuturi–Nenna–Peyré) provided scalable static/dynamic entropic OT solvers, yet their reliance on batch couplings or discretized projections is challenging in high dimensions. On the generative modeling side, score-based diffusion via SDEs (Song et al.) supplied practical tools to learn probability flows from data; leveraging these, the Diffusion Schrödinger Bridge (De Bortoli et al., 2021) made SB computation feasible but at the cost of alternately retraining score/velocity fields across iterations. The present work unifies these lines by deriving and discretizing a principled flow whose fixed point is the SB, thereby inheriting the desirable properties of OT/SB while sidestepping repeated DDM-style trainings and the inaccuracies of mini-batch entropic OT. In doing so, it preserves the theoretical fidelity of dynamic entropic transport and the scalability of modern flow/diffusion learning, tailored to unpaired translation tasks.",
  "analysis_timestamp": "2026-01-06T23:42:49.035305"
}