{
  "prior_works": [
    {
      "title": "Expectation Propagation for Approximate Bayesian Inference",
      "authors": "T. Minka",
      "year": 2001,
      "role": "Foundational algorithm",
      "relationship_sentence": "Introduced EP’s moment-matching updates and site/cavity mechanics, the starting point that the paper reinterprets as natural-gradient steps on a variational objective."
    },
    {
      "title": "Expectation Consistent Approximate Inference",
      "authors": "M. Opper, O. Winther",
      "year": 2005,
      "role": "Variational/energy view of EP",
      "relationship_sentence": "Provided an energy/variational objective whose stationary points correspond to EP fixed points, enabling the paper’s derivation that EP moment matching performs natural-gradient optimization."
    },
    {
      "title": "Power Expectation Propagation",
      "authors": "T. Minka",
      "year": 2004,
      "role": "Generalization via α-divergences and damping",
      "relationship_sentence": "Generalized EP to fractional/α-updates, a key precursor for viewing EP updates as optimizing α-divergence objectives and motivating stable, tunable update rules that the paper unifies under a natural-gradient lens."
    },
    {
      "title": "Stochastic Expectation Propagation",
      "authors": "Y. Li, J. M. Hernández-Lobato, R. E. Turner",
      "year": 2015,
      "role": "Stochastic EP variant",
      "relationship_sentence": "Demonstrated EP-style updates with data subsampling and stochasticity, highlighting instability/tuning issues that the paper resolves by recasting updates as natural-gradient steps suited to noisy MC estimates."
    },
    {
      "title": "Black-box α-divergence Minimization",
      "authors": "J. M. Hernández-Lobato, Y. Li, et al.",
      "year": 2016,
      "role": "MC-friendly α-divergence optimization",
      "relationship_sentence": "Showed how to optimize α-divergence objectives with Monte Carlo estimators, directly informing the paper’s MC-amenable EP variants and their link between EP-style matching and variational optimization."
    },
    {
      "title": "Conjugate-Computation Variational Inference: Converting Inference in Non-Conjugate Models to Inference in Conjugate Ones",
      "authors": "M. E. Khan, W. Lin",
      "year": 2017,
      "role": "Natural-gradient VI with EP-like updates",
      "relationship_sentence": "Connected natural-gradient VI to EP-like moment updates, supporting the paper’s central claim that EP moment matching is a natural-gradient step and guiding single-sample stable estimators."
    },
    {
      "title": "Natural Gradient Works Efficiently in Learning",
      "authors": "S.-i. Amari",
      "year": 1998,
      "role": "Information geometry foundation",
      "relationship_sentence": "Provides the information-geometric basis for natural-gradient optimization that underpins the paper’s reinterpretation of EP updates and their robustness under noisy Monte Carlo estimates."
    }
  ],
  "synthesis_narrative": "The core contribution of “Fearless Stochasticity in Expectation Propagation” is to recast EP’s moment-matching updates as natural-gradient steps on a variational objective, which in turn yields EP variants that remain stable and sample-efficient even with extremely noisy (single-sample) Monte Carlo estimates. This builds directly on the foundational mechanics of EP (Minka, 2001), where site/cavity construction and moment matching define the update rule, and on the variational/energy characterizations of EP fixed points (Opper & Winther, 2005), which supply the objective that the authors optimize. Power EP (Minka, 2004) further links EP to α-divergences and fractional/damped updates, foreshadowing the paper’s unification of stability and tuning within an optimization perspective. \n\nPractical black-box and stochastic lines of work exposed the fragility of naive MC-based EP. Stochastic Expectation Propagation (Li et al., 2015) introduced stochastic site updates for scalability but suffered tuning and stability challenges, while Black-box α-divergence Minimization (Hernández-Lobato et al., 2016) showed how to optimize α-objectives with MC gradients, hinting at MC-compatible EP-like procedures. The decisive conceptual bridge comes from natural-gradient variational inference: Amari (1998) provides the information-geometric foundations, and Khan & Lin (2017) illuminate how EP-like updates emerge as natural-gradient steps, especially in conjugate structures. \n\nSynthesizing these strands, the paper formalizes EP moment matching as natural-gradient optimization of a suitable variational objective and designs update rules inherently robust to MC noise, eliminating reliance on debiasing while improving the speed–accuracy–tuning trade-offs. This yields EP variants that retain EP’s accuracy benefits yet are “fearless” under stochastic estimation.",
  "analysis_timestamp": "2026-01-07T00:02:04.750146"
}