{
  "prior_works": [
    {
      "title": "Capital-Labor Substitution and Economic Efficiency",
      "authors": "Kenneth J. Arrow; Hollis B. Chenery; Bagicha S. Minhas; Robert M. Solow",
      "year": 1961,
      "role": "Foundational functional form (CES/power-mean aggregator)",
      "relationship_sentence": "Introduced the CES aggregator, mathematically equivalent to a weighted power mean, providing the precise parametric family of aggregators that this paper sets out to learn and analyze."
    },
    {
      "title": "On the Measurement of Inequality",
      "authors": "Anthony B. Atkinson",
      "year": 1970,
      "role": "Normative foundation for isoelastic/power-mean social welfare functions",
      "relationship_sentence": "Established the inequality-aversion interpretation of isoelastic (power-mean) social welfare functions, directly motivating the paper’s modeling choice and the interpretation of the learned parameters."
    },
    {
      "title": "The Bargaining Problem",
      "authors": "John F. Nash",
      "year": 1950,
      "role": "Special-case welfare aggregator (geometric mean/Nash social welfare)",
      "relationship_sentence": "Identified the geometric mean (limit p→0 of the power mean) as a principled welfare aggregator, a key special case subsumed by the learned family and used as a conceptual and empirical benchmark."
    },
    {
      "title": "Learning from Revealed Preferences",
      "authors": "O. Beigman; R. Vohra",
      "year": 2006,
      "role": "Learning-theoretic framework for inferring economic objectives from decisions",
      "relationship_sentence": "Provided the blueprint for casting economic rationales as learnable function classes with sample complexity guarantees, which this paper instantiates for social welfare functions and extends to noisy labels and comparisons."
    },
    {
      "title": "Rank Centrality: Ranking from Pairwise Comparisons",
      "authors": "Sahand Negahban; Sewoong Oh; Devavrat Shah",
      "year": 2012,
      "role": "Statistical learning from noisy pairwise comparisons",
      "relationship_sentence": "Developed core methodology and concentration tools for learning from noisy pairwise comparisons, informing the paper’s comparison-based task of learning to order welfare values W(u) and its polynomial sample complexity analysis."
    },
    {
      "title": "Simple, Robust, and Optimal Estimation in Pairwise Comparison Models",
      "authors": "Nihar B. Shah; Martin J. Wainwright",
      "year": 2016,
      "role": "Noise-robust algorithms and minimax theory for pairwise comparisons",
      "relationship_sentence": "Characterized robustness and optimality under realistic noise in pairwise models, guiding the paper’s treatment of noisy welfare-comparison feedback and its algorithmic design."
    },
    {
      "title": "A Voting-Based System for Ethical Decision Making",
      "authors": "V. Noothigattu; S. N. S. Gaikwad; E. Awad; S. Dsouza; I. Rahwan; A. Ravindran; A. D. Procaccia",
      "year": 2018,
      "role": "Precedent for learning normative aggregation from human judgments",
      "relationship_sentence": "Demonstrated that one can learn aggregation rules to imitate societal/policymaker judgments from data, a conceptual precursor to learning parametric social welfare functions from decisions and pairwise comparisons."
    }
  ],
  "synthesis_narrative": "The paper’s core contribution—learning social welfare functions (SWFs) from data with provable sample complexity and practical algorithms—stands on two pillars: the normative/economic grounding of the target family and learning-theoretic tools for supervision via scalar labels and pairwise comparisons. On the modeling side, Arrow–Chenery–Minhas–Solow (1961) introduced the CES aggregator, equivalent to a weighted power mean, while Atkinson (1970) tied the exponent to inequality aversion, providing both the functional form and interpretability this paper leverages. Nash (1950) further supplies a canonical special case (geometric mean), anchoring the family with a principled welfare benchmark encompassed by the power mean limits.\n\nOn the learning side, Beigman and Vohra (2006) established a paradigm for inferring economic objectives from observed choices with PAC-style guarantees, which the present work adapts to SWFs, including robustness to noisy supervision. For the comparison-based task—learning from judgments of the form W(u) versus W(v)—Negahban, Oh, and Shah (2012) furnish statistical techniques for learning from noisy pairwise comparisons, while Shah and Wainwright (2016) provide noise-robust algorithms and minimax theory that inform both modeling of noise and performance guarantees. Finally, Noothigattu et al. (2018) demonstrate the feasibility and value of learning normative aggregation rules from human judgments, closely mirroring the paper’s objective of imitating a policymaker’s rationale. Together, these works directly enable the paper’s main results: polynomial sample complexity and practical algorithms for learning power-mean SWFs from both numeric welfare labels and pairwise welfare comparisons under noise.",
  "analysis_timestamp": "2026-01-06T23:39:42.965265"
}