{
  "prior_works": [
    {
      "title": "Gaussian-Process Factor Analysis for Low-Dimensional Single-Trial Analysis of Neural Population Activity",
      "authors": "Byron M. Yu, John P. Cunningham, Gopal Santhanam, Stephen I. Ryu, Krishna V. Shenoy",
      "year": 2009,
      "role": "Established single-trial latent trajectory modeling for neural populations, showing that low-dimensional latent dynamics can explain population activity.",
      "relationship_sentence": "CTDS inherits the latent trajectory paradigm of GPFA but explicitly partitions the latent space by cell type and imposes biologically motivated sign constraints absent in GPFA."
    },
    {
      "title": "Black Box Variational Inference for State Space Models",
      "authors": "Evan Archer, Iain Murray, John P. Cunningham",
      "year": 2016,
      "role": "Provided scalable variational inference for latent linear dynamical systems with point-process (Poisson) observations widely used for spike train modeling.",
      "relationship_sentence": "CTDS builds on LDS/PLDS foundations and inference machinery exemplified by Archer et al., extending them with cell-type-specific latents and sign-constrained dynamics/emissions."
    },
    {
      "title": "Inferring single-trial neural population dynamics using sequential auto-encoders (LFADS)",
      "authors": "Chethan Pandarinath, Daniel J. O’Shea, Jonathan Widrich, David J. Sussillo, and colleagues",
      "year": 2018,
      "role": "Demonstrated powerful latent dynamical systems for neural data and the value of modeling inputs/perturbations to explain single-trial activity.",
      "relationship_sentence": "CTDS adopts the core idea that latent dynamics explain neural population activity and extends interpretability by tying distinct latents to excitatory vs inhibitory classes to predict cell-specific perturbations."
    },
    {
      "title": "Recurrent Switching Linear Dynamical Systems",
      "authors": "Scott W. Linderman, Matthew J. Johnson, Ryan P. Adams, Liam Paninski, David M. Blei, Emily P. Fox",
      "year": 2017,
      "role": "Introduced structured LDS variants that capture interacting latent processes and regime-dependent dynamics, influencing interpretable, modular latent designs.",
      "relationship_sentence": "CTDS follows this line of structured latent modeling but specializes it to cell-type modules, replacing switching with biologically constrained, sign-structured E/I interactions."
    },
    {
      "title": "Training Excitatory-Inhibitory Recurrent Neural Networks for Cognitive Tasks",
      "authors": "H. Francis Song, Guangyu R. Yang, Xiao-Jing Wang",
      "year": 2016,
      "role": "Showed that imposing Dale’s law (sign constraints for E vs I units) in recurrent models yields biologically plausible dynamics and interpretability.",
      "relationship_sentence": "CTDS imports Dale’s-law-style sign constraints into a probabilistic LDS framework, ensuring E latents exert positive and I latents negative effects on other latents and emissions."
    },
    {
      "title": "Excitatory and Inhibitory Interactions in Localized Populations of Model Neurons",
      "authors": "Hugh R. Wilson, Jack D. Cowan",
      "year": 1972,
      "role": "Classical population-level dynamical framework establishing E–I interactions and their signed influence on population activity.",
      "relationship_sentence": "CTDS operationalizes Wilson–Cowan’s E–I interaction principles in a modern latent state-space model by enforcing sign-consistent coupling among cell-type-specific latents."
    },
    {
      "title": "Demixed principal component analysis of neural population data",
      "authors": "Ilya Kobak, Wieland Brendel, Christian Constantinidis, Claudia Brochier, Marcus Vinck, Stefano Panzeri, Christian K. Machens",
      "year": 2016,
      "role": "Introduced demixing to attribute latent components to specific factors for interpretability in population analyses.",
      "relationship_sentence": "CTDS embodies a dynamical, cell-type-focused demixing: it disentangles latent subspaces by biological class while modeling their constrained interactions over time."
    }
  ],
  "synthesis_narrative": "CTDS emerges at the intersection of latent dynamical systems for neural populations and biologically grounded E/I network principles. Foundational latent models such as GPFA and LDS/PLDS (with scalable variational inference) established that population activity can be captured by low-dimensional latent trajectories, while LFADS further showed how dynamical priors and inferred inputs explain single-trial variability and perturbations. Parallel advances in structured state-space models, exemplified by recurrent switching LDS, highlighted how modular, interpretable latent structures and constrained interactions improve explanatory power.\n\nOn the biological side, classic Wilson–Cowan theory and modern E/I RNNs trained under Dale’s law demonstrated that excitatory and inhibitory populations exert sign-consistent influences that shape circuit dynamics and computation. CTDS fuses these threads: it defines separate latent variables tied to identified cell classes and imposes sign constraints on both dynamics and emissions so that excitatory latents have positive and inhibitory latents negative effects. This design directly encodes Dale’s principle into a probabilistic LDS, providing interpretable decompositions of circuit activity and principled predictions of cell-type-specific perturbations. Finally, the demixing ethos of dPCA informs CTDS’s insistence on factorized, interpretable subspaces—here organized by biology rather than task variables—while retaining full latent dynamical coupling. The result is a model that advances beyond generic latent dynamics by binding latent structure to cell identity and biophysical constraints, enabling new insights into the functional roles of distinct cell classes.",
  "analysis_timestamp": "2026-01-06T23:33:35.530334"
}