{
  "prior_works": [
    {
      "title": "Microsoft COCO: Common Objects in Context",
      "authors": "Lin et al.",
      "year": 2014,
      "role": "Benchmark template and evaluation standard",
      "relationship_sentence": "COCO directly shaped SARDet-100K’s goal of a COCO-level large-scale detection benchmark and motivated its adoption of COCO-style JSON annotations and standardized mAP evaluation."
    },
    {
      "title": "DOTA: A Large-scale Dataset for Object Detection in Aerial Images",
      "authors": "Xia et al.",
      "year": 2018,
      "role": "Remote sensing dataset design precedent",
      "relationship_sentence": "DOTA provided a remote-sensing–specific precedent for large-scale, multi-class object detection benchmarks and influenced SARDet-100K’s dataset design and evaluation protocols in the aerial-imagery context."
    },
    {
      "title": "MMDetection: Open MMLab Detection Toolbox and Benchmark",
      "authors": "Chen et al.",
      "year": 2019,
      "role": "Toolbox foundation for reproducible baselines",
      "relationship_sentence": "MMDetection’s modular training/evaluation framework and COCO-compatible interfaces directly enabled SARDet-100K’s open-source toolkit and large-scale, reproducible benchmarking across many detectors."
    },
    {
      "title": "OpenSARShip: A Dataset Dedicated to Sentinel-1 Ship Detection",
      "authors": "Huang et al.",
      "year": 2018,
      "role": "Core source dataset aggregated",
      "relationship_sentence": "OpenSARShip contributed diverse Sentinel-1 maritime scenes and labels that were standardized and integrated as a key component of the multi-source SARDet-100K benchmark."
    },
    {
      "title": "HRSID: A High-Resolution SAR Images Dataset for Ship Detection",
      "authors": "Wang et al.",
      "year": 2021,
      "role": "Core source dataset aggregated",
      "relationship_sentence": "HRSID supplied high-resolution ship annotations that, once unified, expanded SARDet-100K’s scale and resolution diversity for robust maritime detection evaluation."
    },
    {
      "title": "SSDD: SAR Ship Detection Dataset",
      "authors": "Zhang et al.",
      "year": 2021,
      "role": "Core source dataset aggregated",
      "relationship_sentence": "SSDD’s widely used ship imagery and labels were a foundational ingredient that SARDet-100K standardized to alleviate fragmentation in SAR ship detection research."
    },
    {
      "title": "SAR-Aircraft-1.0: A Dataset for Aircraft Detection in SAR Images",
      "authors": "Li et al.",
      "year": 2022,
      "role": "Core source dataset aggregated (non-ship category)",
      "relationship_sentence": "SAR-Aircraft-1.0 provided non-maritime targets and helped SARDet-100K move beyond mono-category ship detection toward a multi-class SAR detection benchmark."
    }
  ],
  "synthesis_narrative": "SARDet-100K’s core contributions—unifying fragmented SAR detection datasets into a large-scale, COCO-level multi-class benchmark and releasing an open-source toolkit—draw directly on two lines of prior work: large-scale detection benchmarks/toolboxes and existing SAR detection datasets. First, COCO established the template for modern detection benchmarks, including scale, COCO-style JSON annotations, and standardized mAP metrics; SARDet-100K explicitly targets COCO-level scope and inherits its evaluation conventions. In remote sensing, DOTA demonstrated how to adapt large-scale object detection to aerial imagery, influencing SARDet-100K’s multi-class scope, data curation principles, and evaluation in a domain with unique viewing geometries. Operationally, MMDetection provided the modular, COCO-compatible training and evaluation infrastructure that SARDet-100K extends to ensure reproducible baselines and broad detector coverage. Second, the benchmark’s substance comes from consolidating established SAR detection datasets that were previously small, mono-class, and siloed. OpenSARShip (Sentinel-1) and HRSID contributed high-resolution maritime scenes, SSDD added a widely adopted ship corpus, and SAR-Aircraft-1.0 supplied non-ship categories, enabling true multi-class detection. Standardizing these sources into a single, quality-controlled benchmark enabled comprehensive cross-sensor and cross-category experiments. This consolidation, together with a unified toolkit, allowed the authors to rigorously expose the performance gap between RGB-pretrained models and SAR fine-tuning, a challenge that was difficult to quantify before the availability of a large, diverse SAR benchmark.",
  "analysis_timestamp": "2026-01-07T00:02:04.765403"
}