{
  "prior_works": [
    {
      "title": "A Random Polynomial-Time Algorithm for Approximating the Volume of Convex Bodies",
      "authors": "Martin Dyer, Alan M. Frieze, Ravi Kannan",
      "year": 1991,
      "role": "Foundational randomized algorithm for convex-body volume/sampling via Markov chains",
      "relationship_sentence": "Established the random-walk framework and polynomial-time baseline for uniform sampling from convex bodies that In-and-Out aims to match or improve while strengthening output guarantees."
    },
    {
      "title": "Random Walks in a Convex Body and an Improved Volume Algorithm",
      "authors": "László Lovász, Miklós Simonovits",
      "year": 1993,
      "role": "Conductance/isoperimetry framework for analyzing mixing of ball walk and related chains",
      "relationship_sentence": "Provided the conductance and isoperimetric analysis blueprint for convex-body samplers that the new diffusion-based proof departs from while still grounding rates in isoperimetric structure."
    },
    {
      "title": "Isoperimetric Problems for Convex Bodies and a Localization Lemma",
      "authors": "Ravi Kannan, László Lovász, Miklós Simonovits",
      "year": 1995,
      "role": "Isoperimetric constants and localization lemma (KLS framework) governing mixing/geometry",
      "relationship_sentence": "Directly connects mixing to functional isoperimetric quantities; In-and-Out’s convergence rate is expressed in terms of such constants, aligning the algorithmic analysis with KLS-type geometric controls."
    },
    {
      "title": "Hit-and-Run from a Corner: Rounding, Sampling and Integration for a Convex Body",
      "authors": "László Lovász, Santosh Vempala",
      "year": 2006,
      "role": "State-of-the-art random walk (hit-and-run) for uniform/log-concave sampling",
      "relationship_sentence": "Serves as the principal algorithmic baseline for convex-body sampling; the In-and-Out walk achieves comparable state-of-the-art runtime while providing stronger Rényi-divergence guarantees than classic hit-and-run analyses."
    },
    {
      "title": "Sampling from a Log-Concave Distribution with Projected Langevin Monte Carlo",
      "authors": "Sébastien Bubeck, Ronen Eldan, Joseph Lehec",
      "year": 2018,
      "role": "Diffusion-based MCMC for constrained convex sets",
      "relationship_sentence": "Introduced a Langevin/diffusion viewpoint for sampling under convex constraints, which In-and-Out extends to the uniform case with a novel in-out stochastic diffusion and rigorous divergence contraction guarantees."
    },
    {
      "title": "Nonasymptotic Convergence of the Unadjusted Langevin Algorithm",
      "authors": "Alain Durmus, Éric Moulines",
      "year": 2017,
      "role": "Nonasymptotic contraction in Wasserstein/KL for diffusion-inspired algorithms",
      "relationship_sentence": "Provides techniques for quantitative convergence of discretized diffusions that inform In-and-Out’s stochastic-diffusion analysis and its guarantees in Rényi (implying TV, W2, KL, χ²)."
    },
    {
      "title": "Generalization of an Inequality by Talagrand and Links with the Logarithmic Sobolev Inequality",
      "authors": "Felix Otto, Cédric Villani",
      "year": 2000,
      "role": "Functional inequalities linking transport, entropy, and diffusion contraction",
      "relationship_sentence": "Underpins the use of functional isoperimetric (Cheeger/LSI-type) constants to certify contraction of diffusions; In-and-Out leverages this paradigm to tie convergence directly to functional isoperimetry of the target."
    }
  ],
  "synthesis_narrative": "The In-and-Out algorithm builds on three intertwined threads: Markov-chain sampling for convex bodies, geometric isoperimetry, and diffusion-based convergence via functional inequalities. The classical works of Dyer–Frieze–Kannan and Lovász–Simonovits established polynomial-time sampling with conductance-based analysis for ball walk–type chains, inaugurating the modern framework for uniform convex-body sampling. The Kannan–Lovász–Simonovits isoperimetric program crystallized the role of functional isoperimetric quantities (Cheeger/KLS constants) in controlling mixing, a perspective the new paper embraces by expressing convergence rates in terms of such constants.\n\nOn the algorithmic side, hit-and-run (Lovász–Vempala) became the state-of-the-art random walk for convex bodies, serving as the benchmark that In-and-Out matches in runtime while surpassing in output guarantees. The methodological pivot comes from diffusion-based MCMC: Projected Langevin Monte Carlo (Bubeck–Eldan–Lehec) demonstrated that stochastic diffusions can be adapted to constrained convex sets, seeding the idea that algorithmic diffusions can outperform or complement classical walks. Nonasymptotic analyses of Langevin-type methods (Durmus–Moulines) provided techniques for quantifying contraction in divergences (Wasserstein/KL), which In-and-Out strengthens to Rényi divergence. Finally, the Otto–Villani bridge between logarithmic Sobolev/transport inequalities and diffusion contraction underlies the paper’s proof strategy: convergence is governed by functional isoperimetric constants of the stationary density. Together, these works directly inform the new in–out stochastic diffusion, its analysis in Rényi divergence, and its state-of-the-art complexity for uniform sampling from high-dimensional convex bodies.",
  "analysis_timestamp": "2026-01-06T23:33:36.276918"
}