{
  "prior_works": [
    {
      "title": "Hamiltonian systems and transformation in Hilbert space",
      "authors": "B. O. Koopman",
      "year": 1931,
      "role": "Foundational theory (Koopman operator)",
      "relationship_sentence": "Introduced the Koopman operator framework that linearizes nonlinear dynamics in function space, enabling spectral invariants that the paper leverages to operationalize dynamical equivalence."
    },
    {
      "title": "Analysis of fluid flows via spectral properties of the Koopman operator",
      "authors": "Igor Mezić",
      "year": 2013,
      "role": "Theoretical foundation (spectral invariants and conjugacy)",
      "relationship_sentence": "Established that Koopman spectra encode global dynamical features and are invariant under conjugacy, directly justifying the paper’s criterion of comparing Koopman eigenvalues to assess dynamical equivalence."
    },
    {
      "title": "Applied Koopmanism",
      "authors": "Marko Budišić, Ryan Mohr, Igor Mezić",
      "year": 2012,
      "role": "Methodological foundation (practical Koopman computation and invariants)",
      "relationship_sentence": "Surveyed computational approaches and highlighted how Koopman spectral objects behave under coordinate changes, guiding the paper’s use of operator-theoretic invariants to test topological conjugacy of training dynamics."
    },
    {
      "title": "A Data–Driven Approximation of the Koopman Operator: Extended Dynamic Mode Decomposition",
      "authors": "Matthew O. Williams, Ioannis G. Kevrekidis, Clarence W. Rowley",
      "year": 2015,
      "role": "Computational tool (estimating Koopman spectra from data)",
      "relationship_sentence": "Provides the EDMD algorithm the paper relies on to estimate Koopman eigenvalues from observed training trajectories, making the proposed equivalence test computationally tractable."
    },
    {
      "title": "Mirror Descent and Nonlinear Projected Subgradient Methods for Convex Optimization",
      "authors": "Amir Beck, Marc Teboulle",
      "year": 2003,
      "role": "Optimization theory (mirror descent and dual-coordinate view)",
      "relationship_sentence": "Formalized mirror descent via Bregman divergences and its interpretation as gradient descent in dual coordinates, furnishing the theoretical equivalence that the paper uses as a ground-truth validation case."
    },
    {
      "title": "Exponentiated Gradient versus Gradient Descent for Linear Predictors",
      "authors": "Jyrki Kivinen, Manfred K. Warmuth",
      "year": 1997,
      "role": "Canonical equivalence example (entropy-regularized MD vs GD)",
      "relationship_sentence": "Showed that exponentiated gradient (a mirror descent instance) is gradient descent in log-space, supplying a concrete, classical conjugacy-style equivalence mirrored by the paper’s Koopman-based test."
    },
    {
      "title": "Online Learning and Online Convex Optimization",
      "authors": "Shai Shalev-Shwartz",
      "year": 2012,
      "role": "Framework for OMD/OGD in the online setting",
      "relationship_sentence": "Unified OGD and OMD in the online regime and clarified their relationships via regularizers/mirror maps, underpinning the paper’s demonstration that its spectral test recovers the known OMD–OGD equivalence."
    }
  ],
  "synthesis_narrative": "The paper’s core contribution—identifying when distinct training procedures have equivalent dynamics via topological conjugacy—rests on two pillars: a precise notion of dynamical equivalence and a computable, data-driven test. Koopman’s original operator-theoretic formulation provided the lens to encode nonlinear dynamics linearly in function space, while Mezić’s development of Koopman spectral analysis established that spectral objects (eigenvalues/eigenfunctions) are invariants under conjugacy, making them suitable markers of equivalence. Applied Koopmanism further connected these invariants to practical computation and clarified their behavior under coordinate changes, directly shaping the paper’s choice of spectral criteria. The computational backbone comes from EDMD, which enables robust estimation of Koopman spectra from sampled training trajectories, allowing the proposed equivalence test to be executed on real optimization dynamics.\nOn the validation side, the optimization literature supplies canonical equivalences the method should recover. Beck and Teboulle’s mirror descent framework and its dual-coordinate interpretation, together with Kivinen and Warmuth’s exponentiated-gradient-as-gradient-descent-in-log-space result, offer concrete instances of algorithmic conjugacy. Shalev-Shwartz’s synthesis of online gradient descent and online mirror descent situates these relationships in the online learning setting used by the paper’s experiments. Together, these works directly enable the paper’s key idea: use Koopman spectral invariants, estimated from data, to detect when different training algorithms or parameterizations are topologically conjugate—and thus dynamically equivalent.",
  "analysis_timestamp": "2026-01-06T23:39:42.962558"
}