{
  "prior_works": [
    {
      "title": "Auto-Encoding Variational Bayes",
      "authors": "Diederik P. Kingma, Max Welling",
      "year": 2014,
      "role": "Foundational VAE objective and amortized inference",
      "relationship_sentence": "P‑VAE directly builds on the ELBO and amortized inference framework of AEVB, altering only the latent family (to Poisson spike counts) and inference dynamics while retaining the variational objective."
    },
    {
      "title": "β‑VAE: Learning Basic Visual Concepts with a Constrained Variational Framework",
      "authors": "Irina Higgins et al.",
      "year": 2017,
      "role": "Information bottleneck and cost interpretation of the KL term",
      "relationship_sentence": "P‑VAE’s metabolically grounded regularizer echoes β‑VAE’s KL-pressure idea, linking representational efficiency/sparsity to an explicit cost that shapes learned codes."
    },
    {
      "title": "Predictive coding in the visual cortex: a functional interpretation of some extra-classical receptive-field effects",
      "authors": "Rajesh P. N. Rao, David H. Ballard",
      "year": 1999,
      "role": "Predictive coding computational principle",
      "relationship_sentence": "The P‑VAE’s inference dynamics and error-correcting architecture are motivated by the Rao–Ballard predictive coding paradigm that marries top‑down generative predictions with bottom‑up residuals."
    },
    {
      "title": "An approximation of the error backpropagation algorithm in a predictive coding network",
      "authors": "James C. R. Whittington, Rafal Bogacz",
      "year": 2017,
      "role": "Link between predictive coding and variational/free-energy training",
      "relationship_sentence": "P‑VAE leverages the result that predictive coding minimizes a variational free energy, providing a theoretical bridge that justifies implementing a VAE with predictive-coding style inference updates."
    },
    {
      "title": "Emergence of simple-cell receptive field properties by learning a sparse code for natural images",
      "authors": "Bruno A. Olshausen, David J. Field",
      "year": 1996,
      "role": "Sparse coding normative objective and metabolic efficiency",
      "relationship_sentence": "P‑VAE’s Poisson‑induced metabolic cost/penalty explicitly connects to the sparse coding objective of Olshausen & Field, and the paper empirically verifies this sparsity relationship."
    },
    {
      "title": "Deep Exponential Families",
      "authors": "Rajesh Ranganath, Linpeng Tang, Laurent Charlin, David M. Blei",
      "year": 2015,
      "role": "Deep generative modeling with count distributions via variational inference",
      "relationship_sentence": "DEFs established variational training for deep generative models with Poisson/count structure, a key antecedent for P‑VAE’s choice of count-valued latent variables and VI-based learning."
    },
    {
      "title": "Neural Variational Inference and Learning in Belief Networks (NVIL)",
      "authors": "Andriy Mnih, Karol Gregor",
      "year": 2014,
      "role": "Gradient estimation for discrete latent variables",
      "relationship_sentence": "NVIL provided practical gradient estimators for models with discrete latents, informing how P‑VAE can train Poisson spike-count latents within an amortized variational framework."
    }
  ],
  "synthesis_narrative": "Poisson VAE (P‑VAE) integrates three strands of prior work: variational autoencoders, predictive coding, and sparse/efficient neural codes. Auto‑Encoding Variational Bayes supplied the ELBO and amortized inference template that P‑VAE preserves while changing the latent family to discrete Poisson spike counts. β‑VAE crystallized how the KL term acts as an information pressure shaping representations; P‑VAE reframes this pressure as a metabolically grounded spike‑rate cost that naturally arises from Poisson latents integrated with predictive coding, thereby tying representation quality to energetic efficiency. The predictive coding lineage—initiated by Rao & Ballard and formalized algorithmically by Whittington & Bogacz—provides the architectural and theoretical scaffolding for P‑VAE’s error‑correcting dynamics and its equivalence to variational free‑energy minimization, justifying a predictive‑coding interpretation of VAE training.\n\nOn the latent‑variable side, Deep Exponential Families demonstrated that deep generative models can be trained with count distributions via variational inference, legitimizing P‑VAE’s move from continuous Gaussians to count‑valued latents. Training discrete latents at scale draws on techniques like NVIL, which introduced practical low‑variance gradient estimators for non‑reparameterizable variables, informing how to optimize Poisson spike counts with amortized inference. Finally, Olshausen & Field’s sparse coding objective connects directly to P‑VAE’s emergent metabolic cost: the Poisson‑driven regularization mirrors classic sparsity penalties and explains the empirically observed sparse, high‑dimensional, linearly separable representations. Together, these works directly enable P‑VAE’s core contribution: a biologically grounded, predictive‑coding VAE with Poisson spike‑count latents that couples metabolic efficiency with modern variational learning.",
  "analysis_timestamp": "2026-01-06T23:39:42.955366"
}