{
  "prior_works": [
    {
      "title": "Investigating Causal Relations by Econometric Models and Cross-spectral Methods",
      "authors": "Clive W. J. Granger",
      "year": 1969,
      "role": "Foundational causal discovery method",
      "relationship_sentence": "MECD’s mask-based event prediction and leave-one-out testing directly follow the Granger causality principle of assessing whether removing a past signal reduces predictive power for a target, adapted here to event-level video reasoning."
    },
    {
      "title": "Neural Granger Causality for Nonlinear Time Series",
      "authors": "Alexander Tank; Ian Covert; Nicholas J. Foti; Ali Shojaie; Emily B. Fox",
      "year": 2018,
      "role": "Modern deep Granger framework",
      "relationship_sentence": "This work shows how to measure Granger-causal influence with nonlinear neural predictors and sparsity/ablation, informing MECD’s use of a learnable predictor plus masking to quantify causal impact between events."
    },
    {
      "title": "Detecting and quantifying causal associations in large nonlinear time series networks (PCMCI)",
      "authors": "Jakob Runge et al.",
      "year": 2019,
      "role": "High-dimensional temporal causal discovery",
      "relationship_sentence": "PCMCI formalizes causal discovery over temporally lagged variables at scale, motivating MECD’s structured search over chronologically distributed video events and its efficiency-minded alternative (mask-based prediction) to conditional testing."
    },
    {
      "title": "CLEVRER: Collision Events for Video Representation and Reasoning",
      "authors": "Kexin Yi; Chuang Gan; Yunzhu Li; Jiajun Wu; Antonio Torralba; Joshua B. Tenenbaum",
      "year": 2020,
      "role": "Causal video reasoning benchmark and modeling",
      "relationship_sentence": "CLEVRER introduced causal reasoning and counterfactual queries for videos via event abstractions; MECD generalizes this line from single short events to multi-event, long-horizon causal graph discovery in real videos."
    },
    {
      "title": "TVQA: Localized, Compositional Video Question Answering",
      "authors": "Jie Lei; Licheng Yu; Mohit Bansal; Tamara L. Berg",
      "year": 2018,
      "role": "Video-language grounding over long videos",
      "relationship_sentence": "TVQA’s setup of aligning long video segments with textual context informs MECD’s formulation that takes visual segments and textual event descriptions, while MECD moves beyond QA to explicit causal-graph discovery."
    },
    {
      "title": "Dense-Captioning Events in Videos",
      "authors": "Ranjay Krishna; Kenji Hata; Frederic Ren; Li Fei-Fei; Juan Carlos Niebles",
      "year": 2017,
      "role": "Event segmentation with natural language",
      "relationship_sentence": "By establishing temporally localized event proposals paired with captions, this work underpins MECD’s event-centric interface—taking segmented visual events plus textual descriptions as inputs for causal inference."
    },
    {
      "title": "TGIF-QA: Toward Spatio-Temporal Reasoning in Visual Question Answering",
      "authors": "Yunseok Jang; Yale Song; Youngjae Yu; Youngjin Kim; Gunhee Kim",
      "year": 2017,
      "role": "Early video QA with temporal reasoning",
      "relationship_sentence": "TGIF-QA catalyzed temporal reasoning in video QA, highlighting the limits of frame-level QA and motivating MECD’s shift from answering isolated questions to discovering structured multi-event causal relations."
    }
  ],
  "synthesis_narrative": "MECD’s core contribution—discovering structured causal relations among multiple events across long videos—sits at the intersection of causal discovery and video-language reasoning. On the causal side, Granger’s seminal notion of causality as predictive necessity directly inspires MECD’s operational test: mask an upstream event and measure how prediction of a downstream result degrades. Neural Granger extensions show that deep, nonlinear predictors can quantify such influences via learnable representations and ablations, while PCMCI motivates scalable, time-lag-aware causal discovery over many variables—principles MECD adapts to event nodes distributed over video timelines with an efficiency-focused masking strategy rather than exhaustive conditional tests.\nOn the video reasoning side, CLEVRER established video causal reasoning and counterfactual querying with explicit event abstractions, but within synthetic, single-event, short-horizon settings; MECD extends this to realistic, long videos and multi-event causal graphs explaining a final outcome. Foundational video-language works such as TVQA and TGIF-QA highlighted the mechanics of aligning temporal segments with language and the limitations of QA-only evaluation for deeper reasoning. Dense-Captioning Events in Videos contributed the event-centric paradigm—temporal segments paired with textual descriptions—that MECD adopts as its input representation. Collectively, these lines converge in MECD: a dataset and Granger-inspired framework that elevate video understanding from answering isolated questions to constructing comprehensive, event-level causal diagrams over extended narratives.",
  "analysis_timestamp": "2026-01-06T23:33:36.282926"
}