{
  "prior_works": [
    {
      "title": "Flow Matching for Generative Modeling",
      "authors": "Yaron Lipman et al.",
      "year": 2022,
      "role": "Foundational training paradigm",
      "relationship_sentence": "TFM builds directly on flow matching’s simulation-free velocity field regression, extending it from distributional flows to learning stochastic trajectory dynamics for Neural SDEs."
    },
    {
      "title": "Stochastic Interpolants: A Unified Framework for Flows and Diffusions",
      "authors": "MS Albergo, G Boffi, E Vanden-Eijnden",
      "year": 2022,
      "role": "Theoretical underpinning for pathwise objectives",
      "relationship_sentence": "The stochastic interpolants framework formalizes training via interpolated paths and conditional velocities, informing TFM’s necessary conditions for learning time-series trajectories and its objective on path space."
    },
    {
      "title": "Conditional Flow Matching: Simulation-Free Training of Continuous-Time Flows",
      "authors": "Alexander Tong et al.",
      "year": 2023,
      "role": "Algorithmic blueprint for simulation-free training",
      "relationship_sentence": "TFM adapts conditional flow matching to condition on observed time-series segments, enabling learning of Neural SDE drift/diffusion without backpropagating through SDE solvers."
    },
    {
      "title": "Rectified Flow: An Alternative to Score-Based Generative Models",
      "authors": "Zhijie Liu et al.",
      "year": 2023,
      "role": "Stability via reparameterized interpolants",
      "relationship_sentence": "TFM’s reparameterization trick echoes rectified flow’s insight that choosing simple, straight-line (or well-conditioned) interpolants yields stabler velocity regression and improved optimization."
    },
    {
      "title": "Latent ODEs for Irregularly-Sampled Time Series",
      "authors": "Yulia Rubanova, Ricky T. Q. Chen, David Duvenaud",
      "year": 2019,
      "role": "Continuous-time modeling for irregular clinical data",
      "relationship_sentence": "TFM inherits the latent continuous-time perspective for handling irregular sampling from Latent ODEs, but replaces adjoint-based training with flow-matching style, simulation-free learning."
    },
    {
      "title": "Neural Controlled Differential Equations for Irregular Time Series",
      "authors": "Patrick Kidger, James Morrill, James Foster, Terry Lyons",
      "year": 2020,
      "role": "Design principles for clinical time-series models",
      "relationship_sentence": "By framing clinical data as controlled paths, Neural CDEs influence TFM’s adaptation to irregular clinical records and motivate continuous-time architectures compatible with flow/trajectory matching."
    }
  ],
  "synthesis_narrative": "Trajectory Flow Matching (TFM) fuses insights from flow-based generative modeling with continuous-time sequence modeling to train Neural SDEs without backpropagating through stochastic solvers. The central idea—regressing a velocity field along interpolated trajectories in a simulation-free manner—traces directly to Flow Matching for Generative Modeling. Stochastic Interpolants provides the theoretical lens to define and analyze objectives on interpolated paths and conditional velocities, which TFM leverages to establish necessary conditions for learning time-series dynamics. Conditional Flow Matching contributes the practical blueprint for simulation-free training of continuous-time flows; TFM adapts this conditioning to observed time-series segments so the learned Neural SDE captures both drift and diffusion consistent with data. To improve stability, TFM’s reparameterization trick draws on Rectified Flow’s core insight: choosing well-conditioned (often straight-line or otherwise simplified) interpolants yields easier velocity regression and more robust optimization. On the application side, Latent ODEs and Neural CDEs shape TFM’s handling of irregularly sampled clinical data, providing architectural and modeling principles for continuous-time latent dynamics and controlled paths. Together, these works directly enable TFM’s key contribution: a simulation-free, stable training procedure for Neural SDEs that scales to irregular, stochastic clinical time series without differentiating through SDE simulations.",
  "analysis_timestamp": "2026-01-06T23:39:42.958243"
}