{
  "prior_works": [
    {
      "title": "A Contractive-Drift Framework for Markov Chain Convergence (as referenced by the authors)",
      "authors": "Yanlin Qu, Jose Blanchet, Peter W. Glynn",
      "year": 2023,
      "role": "Immediate theoretical precursor",
      "relationship_sentence": "DCDC directly operationalizes the Qu–Blanchet–Glynn 2023 framework by introducing and solving the Contractive Drift Equation (CDE), turning the framework’s analytic certificate into a computable, sample-based convergence bound in Wasserstein distance."
    },
    {
      "title": "Reflection couplings and contraction rates for diffusions",
      "authors": "Andreas Eberle",
      "year": 2016,
      "role": "Design of distance-like functions yielding Wasserstein contractivity",
      "relationship_sentence": "Eberle’s idea of crafting tailored distance functions for which the Markov semigroup contracts in Wasserstein directly motivates learning a distance/weight via the CDE so that the chain becomes contractive under the learned metric."
    },
    {
      "title": "Yet another look at Harris’ ergodic theorem",
      "authors": "Martin Hairer, Jonathan C. Mattingly, Jan C. Scheutzow",
      "year": 2011,
      "role": "Wasserstein-form Harris theory combining drift with (local) contractivity",
      "relationship_sentence": "DCDC’s contractive-drift certificate echoes Harris-type arguments in Wasserstein metrics that blend Lyapunov drift with contractivity, but makes the certificate constructive by solving the CDE from data."
    },
    {
      "title": "Ricci curvature of Markov chains on metric spaces",
      "authors": "Yann Ollivier",
      "year": 2009,
      "role": "Coarse Ricci curvature as a contraction criterion in Wasserstein distance",
      "relationship_sentence": "The notion that a suitable metric can render a Markov kernel contractive (positive curvature) underpins DCDC’s strategy of learning a metric/weight that maximizes contractivity via the CDE."
    },
    {
      "title": "Subgeometric rates of convergence of Markov processes in the Wasserstein metric",
      "authors": "Anatoly Yu. Butkovsky",
      "year": 2014,
      "role": "Drift-plus-contractivity framework in Wasserstein distance",
      "relationship_sentence": "Butkovsky’s quantitative synthesis of Lyapunov drift with local Wasserstein contractivity informs the CDE’s structure, which encodes exactly this balance and makes it estimable from samples."
    },
    {
      "title": "Path coupling: A technique for proving rapid mixing in Markov chains",
      "authors": "Russ Bubley, Martin E. Dyer",
      "year": 1997,
      "role": "Metric design and local-to-global contraction principle",
      "relationship_sentence": "DCDC’s focus on certifying pairwise contractivity via a learned distance mirrors the path-coupling paradigm of verifying local contraction to obtain global mixing bounds."
    },
    {
      "title": "Physics-Informed Neural Networks: A deep learning framework for solving forward and inverse problems involving nonlinear PDEs",
      "authors": "Maziar Raissi, Paris Perdikaris, George E. Karniadakis",
      "year": 2019,
      "role": "Sample-based neural solvers for operator equations",
      "relationship_sentence": "DCDC’s neural CDE solver adopts a PINN-style residual minimization using Monte Carlo samples of the Markov operator, enabling scalable, data-driven solutions to the contractive-drift equation."
    }
  ],
  "synthesis_narrative": "The key innovation of DCDC is to transform recent contractive-drift theory into a practical, sample-based calculator of convergence rates in Wasserstein distance. This rests directly on the Qu–Blanchet–Glynn (2023) framework that formulates convergence via a contractive drift certificate; DCDC introduces the Contractive Drift Equation (CDE) embodying that certificate and then solves it numerically. The theoretical lineage of this idea blends three streams: (i) Eberle’s reflection-coupling program, which shows that carefully designed distance-like functions can yield Wasserstein contraction; (ii) Harris-type results in Wasserstein metrics (Hairer–Mattingly–Scheutzow), which combine Lyapunov drift with local contractivity to obtain quantitative ergodicity; and (iii) curvature-based contraction (Ollivier) and drift-plus-contractivity analyses (Butkovsky), which formalize how an appropriate metric induces contraction of the Markov kernel. DCDC’s CDE can be viewed as a computable instantiation of these principles: learn a metric/weight function that enforces contractive drift and then translate it into explicit bounds. On the algorithmic side, path coupling provides the conceptual local-to-global contraction blueprint, while physics-informed neural networks supply a scalable methodology for solving operator equations from samples by minimizing residuals. Together, these works directly shape DCDC’s two components—its contractive-drift formulation and its neural solver—yielding the first general-purpose, sample-based tool to certify convergence of general-state-space Markov chains in Wasserstein distance.",
  "analysis_timestamp": "2026-01-07T00:02:04.741921"
}