{
  "prior_works": [
    {
      "title": "Stochastic Equations in Infinite Dimensions",
      "authors": "G. Da Prato, J. Zabczyk",
      "year": 1992,
      "role": "Theoretical foundation",
      "relationship_sentence": "Provides the infinite-dimensional Girsanov theorem and Hilbert-space SDE framework that this paper leverages to derive the conditioned SDE for function-valued processes."
    },
    {
      "title": "Time reversal of diffusions",
      "authors": "U. G. Haussmann, É. Pardoux",
      "year": 1986,
      "role": "Conceptual basis for score in drift",
      "relationship_sentence": "Establishes how reverse-time dynamics introduce a score (gradient log-density) term in the drift, a structural ingredient mirrored in the conditioned SDE derived here."
    },
    {
      "title": "Score-Based Generative Modeling through Stochastic Differential Equations",
      "authors": "Yang Song, Jascha Sohl-Dickstein, Diederik P. Kingma, Abhishek Kumar, Stefano Ermon, Ben Poole",
      "year": 2021,
      "role": "Methodological inspiration",
      "relationship_sentence": "Connects diffusion SDEs with score functions and reverse-time dynamics; this paper extends that score-in-drift principle to conditioning non-linear infinite-dimensional processes."
    },
    {
      "title": "Estimation of non-normalized statistical models by score matching",
      "authors": "Aapo Hyvärinen",
      "year": 2005,
      "role": "Estimation technique",
      "relationship_sentence": "Provides the score matching objective used here to learn the coefficients of the infinite-dimensional score after basis discretization."
    },
    {
      "title": "Guided proposals for simulating diffusion bridges",
      "authors": "Moritz Schauer, Frank van der Meulen, Harry van Zanten",
      "year": 2017,
      "role": "Conditioning of diffusions",
      "relationship_sentence": "Shows how conditioning can be achieved by drift adjustments derived via Girsanov for finite-dimensional diffusions; the present work generalizes this idea to infinite-dimensional, non-linear settings."
    },
    {
      "title": "Inverse problems: a Bayesian perspective",
      "authors": "Andrew M. Stuart",
      "year": 2010,
      "role": "Function-space conditioning framework",
      "relationship_sentence": "Develops rigorous Bayesian conditioning in infinite-dimensional spaces, informing the measure-theoretic treatment of observations without prior discretization adopted in this paper."
    },
    {
      "title": "Elliptic Fourier features of a closed contour",
      "authors": "F. P. Kuhl, C. R. Giardina",
      "year": 1982,
      "role": "Application-driven representation",
      "relationship_sentence": "Introduces the Fourier-basis representation for biological shapes used here to discretize function-valued trajectories and parameterize the learned score."
    }
  ],
  "synthesis_narrative": "The paper synthesizes three strands of prior work to deliver a principled method for conditioning non-linear diffusion processes directly in infinite-dimensional function spaces. First, the measure-theoretic and stochastic analysis backbone comes from Da Prato and Zabczyk’s treatment of Hilbert-space SDEs and the infinite-dimensional Girsanov theorem, which enables rigorous change-of-measure arguments on path space. Complementing this, the classical time-reversal theory of diffusions (Haussmann–Pardoux) clarifies how the score—gradient of the log-density—naturally appears in drift adjustments, anticipating the structural form of the conditioned SDE derived here. Second, recent advances in score-based generative modeling (Song et al.) operationalize this score-in-drift mechanism within SDEs; the present work extends that paradigm beyond finite-dimensional generative modeling to the conditioning of non-linear processes in infinite dimensions. To estimate the required score, the authors adopt Hyvärinen’s score matching, which allows learning without normalizing constants, and instantiate it after discretization in a chosen basis. Third, prior methods for conditioning diffusions via guided drifts (Schauer–van der Meulen–van Zanten) motivate the practical use of Girsanov-driven drift corrections, while Stuart’s Bayesian function-space perspective justifies conditioning without prior discretization. The application to evolutionary shape time series exploits the elliptic Fourier descriptor framework (Kuhl–Giardina) to represent function-valued shapes compactly, enabling practical score parameterization. Together, these works directly inform the paper’s core contribution: a Girsanov-based, score-driven SDE formulation for conditioning non-linear, infinite-dimensional stochastic processes.",
  "analysis_timestamp": "2026-01-06T23:42:49.028009"
}