{
  "prior_works": [
    {
      "title": "A Path Towards Autonomous Machine Intelligence",
      "authors": "Yann LeCun",
      "year": 2022,
      "role": "Conceptual foundation of JEPA objective",
      "relationship_sentence": "Brain-JEPA directly instantiates LeCun’s JEPA principle—predicting target embeddings from context without pixel/voxel reconstruction—to learn robust representations of fMRI dynamics."
    },
    {
      "title": "Self-Supervised Learning from Images with a Non-Contrastive Joint-Embedding Predictive Architecture (I-JEPA)",
      "authors": "Mahmoud Assran; Mathilde Caron; Piotr Bojanowski; Ishan Misra; Yann LeCun; et al.",
      "year": 2023,
      "role": "Architectural blueprint for JEPA training",
      "relationship_sentence": "Brain-JEPA adapts I-JEPA’s non-contrastive, predictive embedding framework to brain signals, extending its context–target masking and predictor–target setup to spatiotemporal fMRI."
    },
    {
      "title": "Masked Autoencoders Are Scalable Vision Learners (MAE)",
      "authors": "Kaiming He; Xinlei Chen; Saining Xie; Yanghao Li; Piotr Dollár; Ross Girshick",
      "year": 2022,
      "role": "Masking paradigm inspiration",
      "relationship_sentence": "Brain-JEPA’s spatiotemporal masking is motivated by MAE’s heavy masking strategy, repurposed from images to fMRI to enforce learning from partial observations."
    },
    {
      "title": "VideoMAE: Masked Autoencoders Are Data-Efficient Learners for Self-Supervised Video Pre-Training",
      "authors": "Zhan Tong; Yibing Song; Jue Wang; Limin Wang",
      "year": 2022,
      "role": "Spatiotemporal masking design precedent",
      "relationship_sentence": "The tailored spatiotemporal masking in Brain-JEPA builds on VideoMAE’s insight that tube-like temporal masking improves representation learning in sequential data, adapted here for heterogeneous fMRI patches."
    },
    {
      "title": "Situating the default-mode network along a principal gradient of macroscale cortical organization",
      "authors": "Daniel S. Margulies; et al.",
      "year": 2016,
      "role": "Functional gradient coordinate system for cortex",
      "relationship_sentence": "Brain Gradient Positioning leverages the principal functional gradients introduced by Margulies et al. to provide a biologically grounded positional encoding for ROIs."
    },
    {
      "title": "BrainSpace: a toolbox for the analysis of macroscale gradients in neuroimaging and connectomics datasets",
      "authors": "Roberto A. Vos de Wael; Ben D. Paquola; et al.",
      "year": 2020,
      "role": "Tools/methods to compute functional gradients",
      "relationship_sentence": "Brain-JEPA’s gradient-based positional encoding is operationalized by methods popularized in BrainSpace for robust estimation and alignment of cortical gradients across subjects."
    },
    {
      "title": "Local-Global Parcellation of the Human Cerebral Cortex from Intrinsic Functional Connectivity MRI",
      "authors": "Alexander Schaefer; Ru Kong; Evan M. Gordon; et al.",
      "year": 2018,
      "role": "ROI parcellation backbone",
      "relationship_sentence": "Brain-JEPA’s ROI tokens and their positional encodings build on widely used functionally defined parcellations (e.g., Schaefer atlas), which Brain Gradient Positioning augments with functional coordinates."
    }
  ],
  "synthesis_narrative": "Brain-JEPA’s core innovation marries the JEPA learning principle with neurobiologically grounded positional encoding and fMRI-specific masking. At the architectural level, LeCun’s JEPA concept and the concrete I-JEPA formulation supply the training objective and context–target predictor design that avoid reconstructing raw signals, enabling learning predictive embeddings directly from fMRI. The model’s spatiotemporal masking strategy is inspired by masked modeling advances: MAE established heavy random masking as a scalable self-supervised signal, while VideoMAE showed that temporally coherent (tube-like) masking can better exploit sequential structure. Brain-JEPA adapts these ideas to heterogeneous ROI time series, crafting a masking scheme aligned to fMRI’s spatial and temporal idiosyncrasies. The second pillar—Brain Gradient Positioning—derives from the macroscale functional gradient literature. Margulies et al. introduced principal gradients as a low-dimensional functional coordinate system of the cortex, and BrainSpace operationalized robust gradient computation and alignment across individuals. Brain-JEPA embeds ROIs within this gradient-based manifold to supply biologically meaningful positional encodings that surpass naive anatomical or index-based embeddings. Finally, widely adopted functional parcellations (Schaefer et al.) provide the ROI substrate that Brain-JEPA tokenizes and then enriches with gradient coordinates. Together, these lines of work directly shape Brain-JEPA’s key contribution: a JEPA-based foundation model for brain dynamics that couples functionally principled positional encoding with fMRI-tailored spatiotemporal masking to achieve strong generalization and transfer.",
  "analysis_timestamp": "2026-01-06T23:33:35.566553"
}