{
  "prior_works": [
    {
      "title": "Flows and Decompositions of Games: Harmonic and Potential Games",
      "authors": "E. Candogan, I. Menache, A. Ozdaglar, P. A. Parrilo",
      "year": 2011,
      "role": "Foundational game decomposition",
      "relationship_sentence": "This paper introduced the Hodge decomposition of finite games and formally defined harmonic games—the structural backbone that the present work leverages to generalize beyond 2-player zero-sum and analyze no-regret/FTRL dynamics on the full harmonic component."
    },
    {
      "title": "Learning in Games via Reinforcement and Regularization",
      "authors": "P. Mertikopoulos, W. H. Sandholm",
      "year": 2016,
      "role": "Continuous-time limit and invariants for regularized learning",
      "relationship_sentence": "It developed the continuous-time limits of regularized learning (including FTRL/mirror descent), identifying conserved quantities and Poincaré recurrence in zero-sum settings—techniques that this paper extends to establish recurrence for FTRL dynamics in general harmonic games."
    },
    {
      "title": "Cycles in Adversarial Regularized Learning",
      "authors": "P. Mertikopoulos, C. Papadimitriou, G. Piliouras",
      "year": 2018,
      "role": "Direct antecedent on cyclic/hamiltonian behavior of FTRL",
      "relationship_sentence": "Showed that FTRL in 2-player zero-sum games exhibits Hamiltonian dynamics and cycling, providing the immediate conceptual and technical springboard that this work generalizes from zero-sum to the full class of harmonic games, and contrasts with discrete-time pathologies."
    },
    {
      "title": "Evolutionary dynamics for bimatrix games: A Hamiltonian system?",
      "authors": "J. Hofbauer",
      "year": 1996,
      "role": "Hamiltonian structure and Poincaré recurrence in zero-sum",
      "relationship_sentence": "Established the Hamiltonian/volume-preserving nature of replicator dynamics in bimatrix zero-sum games, a classical precursor that underlies the recurrence perspective adopted here for regularized/no-regret dynamics on harmonic games."
    },
    {
      "title": "Online Learning with Predictable Sequences",
      "authors": "S. Rakhlin, K. Sridharan",
      "year": 2013,
      "role": "Introduction of optimism/extrapolation (OFTRL/OMD)",
      "relationship_sentence": "Introduced optimistic variants of FTRL/mirror descent via extrapolation, the key algorithmic idea this paper studies to counteract the adverse discrete-time behavior of vanilla FTRL in harmonic (conflicting-interest) games."
    },
    {
      "title": "Training GANs with Optimism",
      "authors": "C. Daskalakis, A. Ilyas, V. Syrgkanis, H. Zeng",
      "year": 2018,
      "role": "Optimistic mirror descent for saddle-point/zero-sum games",
      "relationship_sentence": "Demonstrated that optimistic/extrapolation steps can stabilize adversarial dynamics and achieve last-iterate convergence in bilinear zero-sum games, informing this paper’s use of extrapolation to mitigate non-convergence and trapping in harmonic games."
    },
    {
      "title": "The extragradient method for finding saddle points and other problems",
      "authors": "G. M. Korpelevich",
      "year": 1976,
      "role": "Classical extrapolation for monotone variational inequalities",
      "relationship_sentence": "Provides the foundational extrapolation principle (extra-gradient) that underlies modern optimistic methods; this paper leverages the same idea—predict-then-correct updates—to alter FTRL’s discrete-time geometry in harmonic games."
    }
  ],
  "synthesis_narrative": "The paper’s core contribution—characterizing the (non-)convergence of no-regret/FTRL learning in generalized harmonic games and showing how extrapolation alters these outcomes—rests on two intertwined lines of prior work. Structurally, the Hodge decomposition of games by Candogan et al. defined harmonic games as the orthogonal complement of potential games, giving a canonical space of conflicting-interest interactions to analyze. Dynamically, the continuous-time viewpoint on regularized learning (Mertikopoulos–Sandholm) and the classical Hamiltonian perspective on adversarial dynamics (Hofbauer) established that, in zero-sum games, regularized/replicator flows are volume-preserving and Poincaré recurrent—precluding convergence in last iterates. Building directly on this, Mertikopoulos, Papadimitriou, and Piliouras showed FTRL’s Hamiltonian cycling in 2-player zero-sum games, introducing invariants and tools that the present paper extends to the full harmonic class, proving recurrence in continuous time and diagnosing discrete-time pathologies (e.g., trapping) for vanilla FTRL. To remedy such issues, the paper turns to extrapolation. The optimism paradigm (Rakhlin–Sridharan) and its instantiation in adversarial/saddle-point settings (Daskalakis et al.) demonstrated that predict-then-correct steps tame rotational dynamics and yield last-iterate convergence in zero-sum models—ideas ultimately rooted in Korpelevich’s extragradient method for monotone variational inequalities. Together, these works provide the structural definition, dynamical invariants, and algorithmic mechanisms that enable this paper’s generalization from zero-sum to harmonic games and its analysis of extrapolated FTRL.",
  "analysis_timestamp": "2026-01-06T23:39:42.943725"
}