{
  "prior_works": [
    {
      "title": "Single Image Haze Removal Using Dark Channel Prior",
      "authors": "Kaiming He, Jian Sun, Xiaoou Tang",
      "year": 2011,
      "role": "Foundational physical prior and scattering model instantiation",
      "relationship_sentence": "The paper’s cooperative unfolding explicitly leverages the atmospheric scattering formulation (airlight and transmission) popularized by DCP, and its emphasis on prioritizing clearer (haze-free) regions echoes DCP’s local prior guiding reliable supervision."
    },
    {
      "title": "Non-Local Image Dehazing (Haze-Lines)",
      "authors": "Dana Berman, Shai Avidan",
      "year": 2016,
      "role": "Global coherence prior for real-world haze",
      "relationship_sentence": "The proposed coherence-based pseudo-label selection is conceptually aligned with Haze-Lines’ observation of global color-line coherence in hazy images, informing the use of global and local coherence as reliability cues for label quality."
    },
    {
      "title": "DehazeNet: An End-to-End System for Single Image Haze Removal",
      "authors": "Bolun Cai, Xiang Xu, Kui Jia, Chunmei Qing, Dacheng Tao",
      "year": 2016,
      "role": "Physics-aware deep dehazing architecture",
      "relationship_sentence": "DehazeNet demonstrated how to embed the atmospheric scattering model into CNNs via learning transmission-related representations, directly motivating this work’s integration of physical knowledge within a learnable restoration pipeline."
    },
    {
      "title": "Densely Connected Pyramid Dehazing Network",
      "authors": "He Zhang, Vishal M. Patel",
      "year": 2018,
      "role": "Joint estimation of physical variables and scene content",
      "relationship_sentence": "By jointly modeling haze-related factors and image content with coupled branches, DCPDN provided evidence that cooperative modeling improves dehazing, a principle extended here via an explicit cooperative unfolding that ties scattering and scene estimation."
    },
    {
      "title": "ISTA-Net: Interpretable Optimization-Inspired Deep Network for Image Compressive Sensing",
      "authors": "Jian Zhang, Bernard Ghanem",
      "year": 2018,
      "role": "Template for deep unfolding of iterative solvers",
      "relationship_sentence": "ISTA-Net’s optimization-unrolling paradigm underpins the paper’s unfolding design, enabling the translation of iterative, physics-regularized estimation of transmission/scene into a trainable cooperative network with interpretable modules."
    },
    {
      "title": "Mean Teachers are Better Role Models: Weight-Averaged Consistency Targets Improve Semi-Supervised Learning Results",
      "authors": "Antti Tarvainen, Harri Valpola",
      "year": 2017,
      "role": "Core teacher–student consistency framework",
      "relationship_sentence": "The Coherence-based Label Generator is built on mean-teacher’s EMA teacher and consistency targets, adapting it to restoration by iteratively producing and filtering pseudo-labels for real-world dehazing."
    },
    {
      "title": "Self-Training With Noisy Student Improves ImageNet Classification",
      "authors": "Qizhe Xie, Eduard Hovy, Minh-Thang Luong, Quoc V. Le",
      "year": 2020,
      "role": "Iterative pseudo-labeling and student-to-teacher bootstrapping",
      "relationship_sentence": "The iterative re-training and teacher refresh strategy in Noisy Student directly motivates the paper’s iterative pseudo-label generation with an optimal label pool, emphasizing robustness via repeated refinement."
    }
  ],
  "synthesis_narrative": "The paper’s two core contributions—(1) a cooperative unfolding network that jointly models atmospheric scattering and scene content, and (2) a coherence-based, iterative mean-teacher pseudo-labeling pipeline—are grounded in complementary lines of prior work. On the physics side, the atmospheric scattering model and priors from DCP (He et al., 2011) define the variables (airlight, transmission) and motivate emphasizing reliable, haze-free regions. Non-Local Dehazing (Berman & Avidan, 2016) provides a global color-line coherence perspective, which the authors adapt into global/local coherence cues to assess pseudo-label quality. DehazeNet (Cai et al., 2016) demonstrated how to embed scattering physics into CNNs, while DCPDN (Zhang & Patel, 2018) showed the benefit of jointly modeling haze variables and content—both ideas the authors synthesize into a cooperative, physically grounded restoration pipeline. The architectural mechanism for this synthesis comes from deep unfolding, exemplified by ISTA-Net (Zhang & Ghanem, 2018), which informs how iterative, interpretable updates to scattering and scene estimates can be unrolled into a trainable network. On the supervision side, Mean Teacher (Tarvainen & Valpola, 2017) supplies the consistency-based teacher–student backbone, and Noisy Student (Xie et al., 2020) motivates iterative self-training and teacher refresh. The authors adapt these to restoration by creating a label pool and selecting/weighting pseudo-labels via coherence, aligning supervision with physics-driven reliability, thereby advancing real-world dehazing without paired data.",
  "analysis_timestamp": "2026-01-07T00:02:04.770684"
}