{
  "prior_works": [
    {
      "title": "Concentration of Lipschitz functionals of determinantal and other strong Rayleigh measures",
      "authors": "Robin Pemantle, Yuval Peres",
      "year": 2014,
      "role": "Concentration for DPPs/strong Rayleigh measures",
      "relationship_sentence": "Provided sub-Gaussian concentration for Lipschitz functionals under strong Rayleigh (including DPP) measures, a core tool the paper leverages/refines to obtain uniform deviation bounds for losses from DPP-based coresets."
    },
    {
      "title": "Negative dependence and the geometry of polynomials",
      "authors": "Julius Borcea, Petter Brändén, Thomas M. Liggett",
      "year": 2009,
      "role": "Foundational negative dependence theory (strong Rayleigh)",
      "relationship_sentence": "Established the strong Rayleigh class and negative dependence properties that underpin the paper’s use of repulsion in DPPs to tighten variance and concentration of linear statistics underlying coreset guarantees."
    },
    {
      "title": "Determinantal probability measures",
      "authors": "Russell Lyons",
      "year": 2003,
      "role": "Foundational DPP theory on discrete spaces",
      "relationship_sentence": "Developed the discrete DPP framework and key properties (e.g., negative association, variance formulas for linear statistics) that the paper exploits to analyze average loss under DPP subsampling."
    },
    {
      "title": "Monte Carlo with Determinantal Point Processes",
      "authors": "Rémi Bardenet, Adrien Hardy",
      "year": 2016,
      "role": "DPPs for variance reduction in linear statistics",
      "relationship_sentence": "Showed DPP sampling reduces variance and improves concentration for integrals (linear statistics); the present paper extends this paradigm to empirical risk/coreset settings and strengthens concentration to achieve smaller sample complexity than i.i.d."
    },
    {
      "title": "Efficient volume sampling for row/column subset selection",
      "authors": "Amit Deshpande, Luis Rademacher",
      "year": 2010,
      "role": "DPP/volume sampling for subset selection with guarantees",
      "relationship_sentence": "Demonstrated that DPP-related volume sampling yields provably superior subset selection for matrix approximation versus independent sampling, foreshadowing the paper’s use of negative dependence to beat i.i.d. coreset sizes."
    },
    {
      "title": "Probability inequalities for the sum in sampling without replacement",
      "authors": "Robert Serfling",
      "year": 1974,
      "role": "Baseline concentration for negatively dependent sampling",
      "relationship_sentence": "Provided tighter bounds for sampling without replacement than for i.i.d.; the paper builds on this negative-dependence intuition and shows DPPs enable even stronger concentration, translating to smaller coresets."
    },
    {
      "title": "A Unified Framework for Approximating and Clustering Data",
      "authors": "Dan Feldman, Michael Langberg",
      "year": 2011,
      "role": "Coreset framework and uniform approximation guarantees",
      "relationship_sentence": "Formalized coresets and uniform loss approximation guarantees that serve as the benchmark; the new paper improves these baselines by deriving sharper DPP-based uniform deviation bounds and reduced coreset cardinalities."
    }
  ],
  "synthesis_narrative": "The paper’s key contribution—proving that DPP-based coresets can be fundamentally smaller than those from independent sampling—rests on marrying negative dependence theory for determinantal processes with the coreset uniform-approximation framework. Foundational results by Lyons established discrete DPPs and variance properties for linear statistics, while Borcea–Brändén–Liggett’s strong Rayleigh theory and Pemantle–Peres’s concentration for SR measures supplied the machinery to translate repulsion into sub-Gaussian control of Lipschitz functionals. Bardenet–Hardy then demonstrated in Monte Carlo settings that DPP sampling contracts variance and sharpens concentration for linear statistics; the present work generalizes this beyond a single functional to uniform control over parameterized loss families, which is the essence of coreset guarantees.\n\nWithin the coreset literature, Feldman–Langberg formalized uniform loss approximation and provided i.i.d.-based baselines. The current paper improves these baselines by exploiting stronger-than-i.i.d. concentration arising from negative dependence. Classical results such as Serfling’s inequalities for sampling without replacement highlight how dependence can aid concentration; the authors push this further using strong Rayleigh/DPP structure to obtain strictly tighter deviation bounds relevant to empirical risk. Finally, the line of work on volume sampling (Deshpande–Rademacher) offered concrete evidence that DPP-type negative dependence can outperform independent sampling in subset selection for matrix problems; the new paper abstracts and extends this advantage to general coreset construction, settling the open question of cardinality improvements for DPP-based coresets via principled concentration of DPP linear statistics.",
  "analysis_timestamp": "2026-01-07T00:02:04.764897"
}