{
  "prior_works": [
    {
      "title": "Gaussian Processes for Machine Learning",
      "authors": "Carl E. Rasmussen, Christopher K. I. Williams",
      "year": 2006,
      "role": "Foundational theory for Gaussian process regression and kernel design",
      "relationship_sentence": "Kermut’s supervised predictor and calibrated uncertainty stem directly from GP posterior inference and kernel-centric modeling principles formalized in this book."
    },
    {
      "title": "Convolution Kernels on Discrete Structures",
      "authors": "David Haussler",
      "year": 1999,
      "role": "Foundational framework for composing kernels over structured objects",
      "relationship_sentence": "Kermut’s composite kernel over sets of mutations follows the convolution-kernel idea of building valid kernels by combining parts, enabling similarity to be defined over mutation sets rather than raw sequences."
    },
    {
      "title": "Additive Gaussian Processes",
      "authors": "David Duvenaud, Hannes Nickisch, Carl E. Rasmussen",
      "year": 2011,
      "role": "Kernel constructions that decompose functions into main effects and interactions",
      "relationship_sentence": "Kermut’s kernel explicitly aggregates contributions from single mutations and their interactions (epistasis), aligning with additive/interaction GP kernels that capture low-order structure in high-dimensional spaces."
    },
    {
      "title": "The Spectrum Kernel: A String Kernel for SVM Protein Classification",
      "authors": "Christina Leslie, Eleazar Eskin, William Stafford Noble",
      "year": 2002,
      "role": "Sequence-kernel paradigm linking biological sequence similarity to predictive performance",
      "relationship_sentence": "By demonstrating how sequence similarity can be encoded into a kernel, this work motivates Kermut’s mutation-similarity kernelization as a biologically informed alternative to naive Hamming distances."
    },
    {
      "title": "Amino Acid Substitution Matrices from Protein Blocks (BLOSUM)",
      "authors": "Steven Henikoff, Jorja G. Henikoff",
      "year": 1992,
      "role": "Biological prior for amino-acid similarity",
      "relationship_sentence": "Kermut’s mutation-similarity component leverages the notion that substitutions are unequal; BLOSUM-style priors provide the canonical blueprint for weighting amino-acid changes in a kernel."
    },
    {
      "title": "Navigating the protein fitness landscape with Gaussian processes",
      "authors": "Peter A. Romero, Andreas Krause, Frances H. Arnold",
      "year": 2013,
      "role": "Early demonstration of GP models and uncertainty for protein sequence–function landscapes",
      "relationship_sentence": "This study established GPs as effective supervised models for protein variant effects with meaningful uncertainty, a direct precursor to Kermut’s GP framework tailored with a biologically grounded composite kernel."
    },
    {
      "title": "Disease variant prediction with deep generative models of evolutionary data (EVE)",
      "authors": "Jonathan Frazer, Pascal Notin, Mafalda Dias, Aidan Brock, Yarin Gal, Debora Marks",
      "year": 2021,
      "role": "Highlighting uncertainty in variant-effect prediction",
      "relationship_sentence": "EVE popularized reporting and leveraging uncertainty in variant-effect predictions; Kermut advances this by providing GP-based posterior uncertainty with supervised, state-of-the-art accuracy."
    }
  ],
  "synthesis_narrative": "Kermut’s core contribution—a supervised Gaussian process model with a composite kernel that encodes mutation similarity and epistasis while yielding calibrated posterior uncertainty—builds on a confluence of ideas from kernel methods, GP modeling, and protein variant prediction. The GP framework of Rasmussen and Williams provides the mathematical backbone for nonparametric regression and principled uncertainty quantification. Haussler’s convolution kernels motivate constructing valid kernels over structured objects, enabling Kermut to define similarity directly over sets of mutations rather than entire sequences. To capture the structure of genotype–phenotype maps, Kermut adopts an additive/interactions perspective akin to Additive Gaussian Processes, allowing main effects of single substitutions and low-order epistatic interactions to be composed cleanly within the kernel.\nIn encoding biologically meaningful similarity, the spectrum/string-kernel tradition (Leslie et al.) demonstrates how sequence-derived similarity boosts predictive performance, while BLOSUM substitution matrices supply a long-standing prior that not all amino-acid changes are equal—guiding Kermut’s mutation-similarity term. Empirically, earlier applications of GPs to protein fitness landscapes (Romero, Krause, Arnold) validated GPs’ suitability for supervised sequence–function learning and highlighted the utility of predictive uncertainty for design and exploration. Finally, the EVE framework crystallized the community’s emphasis on uncertainty in variant-effect prediction; Kermut advances this agenda by delivering supervised state-of-the-art accuracy together with GP posterior uncertainties and an analysis of calibration, enabled by its biologically grounded composite kernel.",
  "analysis_timestamp": "2026-01-06T23:33:35.532589"
}