{
  "prior_works": [
    {
      "title": "BadNets: Identifying Vulnerabilities in the Machine Learning Model Supply Chain",
      "authors": "Tianyu Gu, Brendan Dolan-Gavitt, Siddharth Garg",
      "year": 2017,
      "role": "Foundational backdoor paradigm",
      "relationship_sentence": "Introduced the core notion of trigger-based data poisoning that implants behaviors activated at test time, which BackTime adapts to the time-series forecasting setting."
    },
    {
      "title": "Trojaning Attack on Neural Networks",
      "authors": "Yingqi Liu, Shiqing Ma, Yousra Aafer, Wen-Chuan Lee, Juan Zhai, Weihang Wang, Xiangyu Zhang",
      "year": 2018,
      "role": "Optimization-based backdoor design",
      "relationship_sentence": "Showed how to optimize triggers and objectives to maximize attack success while preserving utility, informing BackTime’s optimization-driven trigger synthesis."
    },
    {
      "title": "Hidden Trigger Backdoor Attacks",
      "authors": "Aniruddha Saha, Akshayvarun Subramanya, Hamed Pirsiavash",
      "year": 2020,
      "role": "Stealthy/dynamic trigger formulation",
      "relationship_sentence": "Pioneered learning triggers that are hard to detect and input-adaptive, directly motivating BackTime’s focus on stealthy, effective triggers for sequential data."
    },
    {
      "title": "WaNet: Imperceptible Warping-based Backdoor Attack",
      "authors": "Anh Tuan Nguyen, Anh Tuan Tran",
      "year": 2021,
      "role": "Imperceptibility constraints for backdoors",
      "relationship_sentence": "Demonstrated that imperceptible, distribution-consistent triggers can evade defenses, guiding BackTime’s stealth constraints for time-series perturbations."
    },
    {
      "title": "Witches' Brew: Industrial Scale Data Poisoning via Gradient Matching",
      "authors": "Jacob Geiping, Liam Fowl, Jonas Moeller, Michael Moeller, Tom Goldstein",
      "year": 2021,
      "role": "Bilevel optimization for poisoning",
      "relationship_sentence": "Provided a practical bilevel/gradient-matching framework for crafting poisons, which BackTime adapts to select timestamps and synthesize triggers for forecasting models."
    },
    {
      "title": "Diffusion Convolutional Recurrent Neural Network: Data-Driven Traffic Forecasting",
      "authors": "Yaguang Li, Rose Yu, Cyrus Shahabi, Yan Liu",
      "year": 2018,
      "role": "Graph-based modeling of multivariate time series",
      "relationship_sentence": "Established GNN/RNN hybrids for spatiotemporal dependencies, inspiring BackTime’s use of a GNN-based generator to model inter-variable relations when creating triggers."
    },
    {
      "title": "Understanding Black-box Predictions via Influence Functions",
      "authors": "Pang Wei Koh, Percy Liang",
      "year": 2017,
      "role": "Identifying influential training points",
      "relationship_sentence": "Introduced techniques to estimate training-point influence, aligning with BackTime’s identification of vulnerable timestamps for targeted poisoning."
    }
  ],
  "synthesis_narrative": "BackTime’s core contribution—an effective backdoor attack on multivariate time-series forecasting via vulnerable-timestamp selection and an adaptively learned, stealthy trigger—builds on three converging lines of prior work. First, foundational backdoor papers such as BadNets and Trojaning Attack establish the trigger-based poisoning paradigm and optimization-driven design of attacks, which BackTime repurposes from vision to forecasting. Second, recent advances in stealthy and dynamic triggers (Hidden Trigger Backdoor Attacks; WaNet) show that triggers must be imperceptible and distribution-consistent to evade detection, directly shaping BackTime’s objective to synthesize subtle, time-series-conforming patterns rather than obvious implants. Third, bilevel optimization methods for poisoning, exemplified by Witches’ Brew, provide a scalable mechanism to couple poison crafting with downstream training dynamics; BackTime adapts this bilevel perspective to the sequential domain, using it both to choose when to poison (vulnerable timestamps) and to learn attack-specific triggers.\nCrucially, BackTime tailors trigger generation to multivariate dependencies by leveraging graph-based modeling ideas from GNN-driven forecasting (e.g., DCRNN), but uses a GNN as a generator to encode inter-variable structure in the trigger itself. Finally, the selection of poisoning locations echoes influence-function thinking: by operationalizing which timestamps most affect forecasts, BackTime maximizes attack leverage with minimal perturbations. Together, these strands—trigger backdoors, stealth/dynamic design, bilevel poisoning optimization, graph-aware multivariate modeling, and influence-guided selection—coalesce into a targeted, stealthy backdoor specifically engineered for MTS forecasting.",
  "analysis_timestamp": "2026-01-06T23:33:36.283360"
}