{
  "prior_works": [
    {
      "title": "Interconnection and damping assignment passivity-based control of port-controlled Hamiltonian systems",
      "authors": "Romeo Ortega, Antonio J. van der Schaft, Bernhard Maschke, Gabriel Escobar",
      "year": 2002,
      "role": "Energy shaping/passivity-based control theory",
      "relationship_sentence": "Provides the closed-form potential-energy shaping and damping-injection framework that the paper aims to execute directly in a learned latent space; CON’s Lagrangian structure is chosen to make such energy-shaping controllers applicable."
    },
    {
      "title": "Input-to-State Stability: Basic Concepts and Results",
      "authors": "Eduardo D. Sontag",
      "year": 2008,
      "role": "Foundations of input-to-state stability (ISS)",
      "relationship_sentence": "Supplies the ISS notion and Lyapunov machinery the paper leverages to ensure latent dynamics remain robustly stable under inputs; CON is designed to be ISS so that stability of the real system is preserved in latent control."
    },
    {
      "title": "Deep Lagrangian Networks: Using Physics as a Prior for Efficient Learning of Dynamics",
      "authors": "Michael Lutter, Christian Ritter, Jan Peters",
      "year": 2019,
      "role": "Structured learning of Lagrangian mechanical systems",
      "relationship_sentence": "Demonstrates that learning in Lagrangian coordinates yields physically consistent second-order models; directly motivates CON’s choice to enforce a Lagrangian form that admits a well-defined mass matrix and generalized forces."
    },
    {
      "title": "Hamiltonian Neural Networks",
      "authors": "Samuel Greydanus, Misko Dzamba, Jason Yosinski",
      "year": 2019,
      "role": "Energy-based neural modeling",
      "relationship_sentence": "Introduces learning energy-conserving dynamics from data; informs the paper’s insistence on energy-structured latent models to retain physical invariants and enable control-theoretic reasoning."
    },
    {
      "title": "Embed to Control: A Locally Linear Latent Dynamics Model for Control from Raw Images",
      "authors": "Manuel Watter, Jürgen T. Springenberg, Joschka Boedecker, Martin Riedmiller",
      "year": 2015,
      "role": "Latent-space control with learned dynamics",
      "relationship_sentence": "Pioneers control in learned low-dimensional spaces but lacks strong physical structure and stability guarantees; highlights the shortcomings (structure, stability, input mapping) CON explicitly addresses."
    },
    {
      "title": "Linear predictors for nonlinear dynamical systems: Koopman with inputs and control",
      "authors": "Milan Korda, Igor Mezić",
      "year": 2018,
      "role": "Koopman-based latent/control representations",
      "relationship_sentence": "Shows how learned latent linear systems can be used for control, yet without guaranteeing mechanical structure or invertible input-to-force mappings; motivates CON’s structured, control-affine latent dynamics."
    },
    {
      "title": "Dynamical movement primitives: learning attractor landscapes for motor control",
      "authors": "Auke Jan Ijspeert, Jun Nakanishi, Stefan Schaal",
      "year": 2013,
      "role": "Coupled oscillator-based stable motor representations",
      "relationship_sentence": "Demonstrates the utility of second-order, oscillator-like primitives for stable, low-dimensional control; inspires CON’s use of coupled oscillatory latent coordinates with well-behaved attractor structure."
    }
  ],
  "synthesis_narrative": "The paper’s core contribution—an Input-to-State Stable Coupled Oscillator Network (CON) that enables closed-form, model-based control in a learned latent space—sits at the intersection of three lines of work. First, latent-space control emerged from models such as Embed to Control and Koopman with inputs, which made planning tractable but suffered from a lack of mechanical structure, weak stability guarantees, and ambiguous input mappings. These limitations are precisely the pain points the authors target. Second, the physics-structured modeling wave—Hamiltonian Neural Networks and especially Deep Lagrangian Networks—showed that learning energy-based or Lagrangian forms yields dynamics with interpretable mass matrices and forces. This makes classical control synthesis applicable in principle, but prior efforts did not fully resolve input robustness and invertible actuation in latent space.\nPassivity-based control and energy shaping (IDA-PBC) provide the closed-form design the authors wish to exploit: shaping potentials and injecting damping to stabilize desired equilibria. To make such designs viable after representation learning, the latent model must guarantee properties akin to real mechanical systems. Here, ISS theory (Sontag) supplies the robustness lens the authors adopt to ensure inputs do not destroy stability. Finally, inspiration from dynamical movement primitives and coupled oscillators motivates a low-dimensional, oscillator-based latent parameterization with attractive, well-behaved second-order structure. By combining these ingredients, the authors construct CON: a Lagrangian, ISS-guaranteed latent model with an explicit, invertible input-to-force mapping, enabling direct application of energy-shaping controllers in learned latent spaces.",
  "analysis_timestamp": "2026-01-07T00:02:04.734449"
}