{
  "prior_works": [
    {
      "title": "Automatic Goal Generation for Reinforcement Learning Agents (GoalGAN)",
      "authors": "Adrià Florensa, David Held, Xinyang Geng, Pieter Abbeel",
      "year": 2018,
      "role": "Difficulty targeting via success-rate",
      "relationship_sentence": "ACES’ practice of measuring problem difficulty through the solver’s success rate and steering generation toward challenging-but-solvable instances directly echoes GoalGAN’s idea of sampling goals near the agent’s success boundary (~50% success)."
    },
    {
      "title": "Teacher-Student Curriculum Learning",
      "authors": "T. Matiisen, A. Oliver, T. Cohen, J. Schulman",
      "year": 2017,
      "role": "Learning-progress based curricula",
      "relationship_sentence": "ACES operationalizes a curriculum signal from solver performance, aligning with teacher-student approaches that use learning progress/success feedback to adaptively select task difficulty."
    },
    {
      "title": "Illuminating Search Spaces by Mapping Elites (MAP-Elites)",
      "authors": "Jean-Baptiste Mouret, Jeff Clune",
      "year": 2015,
      "role": "Quality-Diversity (QD) over descriptor spaces",
      "relationship_sentence": "ACES’ joint drive for diversity and performance across a hand-crafted descriptor space of programming skills mirrors MAP-Elites’ core principle of covering a behavior descriptor space while optimizing a quality metric."
    },
    {
      "title": "POET: Paired Open-Ended Trailblazer",
      "authors": "Rui Wang, Joel Lehman, Kenneth O. Stanley, Jeff Clune",
      "year": 2019,
      "role": "Open-ended, co-evolving task generation",
      "relationship_sentence": "By iteratively generating harder yet solvable problems and coupling them with a solver, ACES adopts POET’s open-ended paradigm of co-evolving diverse, increasingly challenging environments with solution capabilities."
    },
    {
      "title": "Unsupervised Learning of Goal Spaces for Intrinsically Motivated Goal Exploration",
      "authors": "Adrien Laversanne-Finot, Félix Garcia Ortiz (Pere), Pierre-Yves Oudeyer",
      "year": 2018,
      "role": "Autotelic goal space design",
      "relationship_sentence": "ACES’ autotelic framing and explicit goal/problem space construction resonate with IMGEP work on learning goal spaces that support diverse, self-generated exploration and curricula."
    },
    {
      "title": "Language as a Cognitive Tool to Imagine Goals in Reinforcement Learning",
      "authors": "Cédric Colas et al.",
      "year": 2020,
      "role": "Language-grounded goal descriptors",
      "relationship_sentence": "ACES’ use of LLM-generated semantic descriptors for programming skills directly builds on the idea that language can define and structure goal spaces for autotelic exploration."
    }
  ],
  "synthesis_narrative": "ACES fuses two influential strands: intrinsic motivation for autotelic task generation and quality-diversity search over interpretable descriptors. From the curriculum-learning side, GoalGAN and Teacher–Student Curriculum Learning showed that a solver’s success rate is a rich signal to target goals on the frontier of competence—challenging but learnable. ACES adopts this principle almost verbatim by defining problem difficulty as an inverse function of a strong LLM solver’s success rate and steering generation toward those hard-yet-solvable regions.\n\nFrom the diversity side, MAP-Elites established how to simultaneously maximize coverage of a descriptor space while optimizing a quality measure. ACES mirrors this architecture by representing programming problems in an LLM-defined semantic descriptor space (e.g., dynamic programming, string manipulation) and seeking broad coverage while pushing difficulty upward. POET extends this logic to open-ended, co-evolving environments and solvers; ACES echoes POET’s autotelic loop by iteratively generating new problems and evaluating solvability with a capable solver, thus maintaining a moving frontier of challenge.\n\nFinally, autotelic goal exploration work in IMGEP and follow-ups on language-grounded goals supplied the representational and conceptual substrate for ACES’ descriptor design. The choice to let language models produce semantic skill tags and to drive exploration through these tags is a direct continuation of using language to structure goal spaces. Together, these works crystallize in ACES as a QD-style, autotelic loop guided by solver success—now instantiated with LLMs as both designer (problem generator/descriptor annotator) and evaluator (difficulty estimator).",
  "analysis_timestamp": "2026-01-06T23:33:36.267429"
}