{
  "prior_works": [
    {
      "title": "Multiclass Brain–Computer Interface using Riemannian Geometry",
      "authors": "A. Barachant, S. Bonnet, M. Congedo, C. Jutten",
      "year": 2012,
      "role": "Foundational SPD-manifold modeling of EEG with geodesic distances (MDM)",
      "relationship_sentence": "GOPSA builds directly on the representation of EEG trials as SPD covariance matrices and the associated geodesic distance structure introduced for classification by Barachant et al."
    },
    {
      "title": "Log-Euclidean Metrics for Fast and Simple Calculus on Symmetric Positive Definite Matrices",
      "authors": "V. Arsigny, P. Fillard, X. Pennec, N. Ayache",
      "year": 2007,
      "role": "Mathematical foundations for geodesics, log/exp maps, and optimization on SPD",
      "relationship_sentence": "GOPSA’s geodesic optimization and interpolation on the SPD manifold rely on the log–exp calculus and geodesic structure formalized by Arsigny et al."
    },
    {
      "title": "Transfer Learning: a Riemannian Geometry Framework with Application to Brain–Computer Interfaces",
      "authors": "F. Zanini, M. Congedo, C. Jutten, S. Said",
      "year": 2018,
      "role": "Riemannian alignment for EEG domain adaptation on the SPD manifold",
      "relationship_sentence": "By showing that aligning covariance matrices on the SPD manifold improves cross-subject/session generalization, this work motivates GOPSA’s choice to perform adaptation intrinsically on the SPD geometry rather than in Euclidean space."
    },
    {
      "title": "Geodesic Flow Kernel for Unsupervised Domain Adaptation",
      "authors": "B. Gong, Y. Shi, F. Sha, K. Grauman",
      "year": 2012,
      "role": "Geodesic-path based domain adaptation (on Grassmann manifolds)",
      "relationship_sentence": "GOPSA extends the principle of adapting along geodesic paths between domains to the SPD manifold of EEG covariances, using geodesic structure to navigate between sources and the target."
    },
    {
      "title": "Adjusting the Outputs of a Classifier to New A Priori Probabilities: A Simple Procedure",
      "authors": "M. Saerens, T. Latinne, C. Decaestecker",
      "year": 2002,
      "role": "Classical label-shift (prior-shift) correction framework",
      "relationship_sentence": "GOPSA targets scenarios where p(y) differs across domains, and this seminal formulation of prior-probability shift provides the statistical lens for handling distinct y-distributions across sources and the target."
    },
    {
      "title": "Detecting and Correcting for Label Shift with Black Box Predictors",
      "authors": "Z. C. Lipton, Y.-X. Wang, A. Smola",
      "year": 2018,
      "role": "Modern estimation and correction of label shift",
      "relationship_sentence": "The practical tools and identifiability conditions for adapting predictions under label-shift in Lipton et al. inform GOPSA’s test-time adjustment when the target’s class proportions differ from each source."
    },
    {
      "title": "Joint Class Proportion and Optimal Transport for Domain Adaptation",
      "authors": "N. Courty, R. Flamary, D. Tuia, A. Rakotomamonjy",
      "year": 2017,
      "role": "Multi-source domain adaptation under target/label shift via optimal transport",
      "relationship_sentence": "Addressing domain adaptation when sources have different class proportions, this work motivates GOPSA’s multi-source strategy to reconcile heterogeneous y-distributions when adapting to a target domain."
    }
  ],
  "synthesis_narrative": "GOPSA’s core contribution—test-time adaptation across multiple EEG sources with differing label distributions by optimizing along geodesics on the SPD manifold—sits at the intersection of three threads of prior work. First, the modeling and geometry: Barachant et al. established SPD covariance representations and geodesic-based classification (MDM) for EEG, while Arsigny et al. provided the log–exp calculus and geodesic structure that make principled optimization on SPD feasible. Building on these foundations, Riemannian alignment methods for EEG (e.g., Zanini et al.) demonstrated that domain adaptation is most effective when performed intrinsically on the SPD manifold rather than via Euclidean proxies, directly motivating GOPSA’s manifold-native approach.\nSecond, geodesic-domain adaptation: the Geodesic Flow Kernel (Gong et al.) introduced the idea of traversing geodesic paths between source and target domains to achieve smooth adaptation. GOPSA generalizes this idea to the SPD manifold of EEG covariances, using geodesic operations to interpolate and optimize between multiple source models.\nThird, predictive/label-shift handling: classical prior-shift correction (Saerens et al.) and modern black-box label-shift estimation (Lipton et al.) formalize how changing p(y) distorts predictions, while multi-source target-shift optimal transport (Courty et al.) shows how to reconcile sources with different class proportions. GOPSA integrates these insights by explicitly addressing heterogeneous y-distributions across sources and performing test-time geodesic optimization to align predictive behavior to the target, unifying manifold geometry with label-shift-aware multi-source adaptation.",
  "analysis_timestamp": "2026-01-06T23:39:42.947471"
}