{
  "prior_works": [
    {
      "title": "Instrumental Variables Estimation With Some Invalid Instruments and its Application to Mendelian Randomization",
      "authors": "Hyunseung Kang, Anru Zhang, T. Tony Cai, Dylan S. Small",
      "year": 2016,
      "role": "Foundational framework for MR with partially invalid instruments (SisVIVE) and conditions for identifying a valid subset.",
      "relationship_sentence": "This work directly motivates the paper’s focus on discovering valid IV sets in the presence of invalid instruments and informs its identification conditions for subset selection."
    },
    {
      "title": "Mendelian randomization with invalid instruments: effect of pleiotropy on estimates and bias in Egger regression",
      "authors": "Jack Bowden, George Davey Smith, Stephen Burgess",
      "year": 2015,
      "role": "Introduces MR-Egger and formalizes pleiotropy (InSIDE), establishing robustness paradigms to invalid IVs.",
      "relationship_sentence": "By formalizing how invalid instruments distort MR and proposing pleiotropy-robust estimation, this paper underpins the new work’s identification of valid IV sets amid horizontal pleiotropy."
    },
    {
      "title": "Consistent Estimation in Mendelian Randomization with Some Invalid Instruments Using a Weighted Median Estimator",
      "authors": "Jack Bowden, George Davey Smith, Patrick C. Haycock, Stephen Burgess",
      "year": 2016,
      "role": "Robust MR estimator consistent if a majority of instruments are valid.",
      "relationship_sentence": "The weighted median’s identification logic with a majority-valid subset informs the present paper’s necessary-and-sufficient conditions for pinning down valid IV sets."
    },
    {
      "title": "Robust inference in summary data Mendelian randomization via the zero modal pleiotropy assumption",
      "authors": "Fernando P. Hartwig, George Davey Smith, Jack Bowden",
      "year": 2017,
      "role": "Mode-based MR estimator leveraging clustering of ratio estimates around the valid causal signal.",
      "relationship_sentence": "Its clustering rationale for isolating the valid signal directly inspires the paper’s cluster fusion-like strategy for discovering valid IV sets."
    },
    {
      "title": "Orienting the causal relationship between imprecisely measured traits using GWAS summary data",
      "authors": "Gibran Hemani, Kate Tilling, George Davey Smith",
      "year": 2017,
      "role": "MR Steiger directionality test for bidirectional MR using variance explained.",
      "relationship_sentence": "Provides a key prior approach to infer causal direction in bidirectional MR, which the new paper generalizes by giving necessary and sufficient identification conditions under invalid IVs and confounding."
    },
    {
      "title": "Generalized Instrumental Variables",
      "authors": "Carlos Brito, Judea Pearl",
      "year": 2002,
      "role": "Identification theory for linear structural equation models via instrumental sets and graphical conditions.",
      "relationship_sentence": "Theoretical principles for identifying causal effects using instrumental sets inform the paper’s derivation of necessary and sufficient conditions to correctly identify valid IV sets in MR."
    },
    {
      "title": "Causal associations between risk factors and common diseases inferred from GWAS summary data (GSMR)",
      "authors": "Zhihong Zhu, Futao Zhang, Han Hu, et al.",
      "year": 2018,
      "role": "Summary-data MR with HEIDI-outlier filtering to detect pleiotropic invalid instruments; supports bidirectional analyses.",
      "relationship_sentence": "The outlier-filtering paradigm for invalid variants motivates the paper’s principled search for valid IV sets and complements its theory-driven identification and estimation."
    }
  ],
  "synthesis_narrative": "The paper’s core contribution—necessary and sufficient identification conditions for bidirectional MR with some invalid instruments, alongside a cluster fusion-like estimator—builds on three intertwined strands of prior work. First, robustness to invalid instruments in MR was crystallized by MR-Egger (Bowden et al., 2015), the weighted median (Bowden et al., 2016), and the mode-based estimator (Hartwig et al., 2017), which collectively demonstrated that consistent causal estimation is possible when only a subset of instruments is valid. Among these, the mode-based rationale—leveraging clustering of ratio estimates around the true effect—directly informs the new paper’s clustering-and-fusion strategy for isolating valid IV sets.\nSecond, explicit strategies for identifying valid subsets under partial invalidity were advanced by Kang et al. (2016) via SisVIVE, formalizing the idea that one can recover causal effects if a sufficiently large and coherent valid subset exists; this perspective is extended here to bidirectional models with theoretical guarantees. Complementarily, practical outlier detection and filtering in summary-data MR (Zhu et al., 2018, GSMR) highlighted the utility of variant-level diagnostics to excise pleiotropic instruments, a theme operationalized in the paper’s valid-IV discovery algorithm.\nThird, the paper’s identification theory echoes structural equation model results on instrumental sets and graphical identifiability (Brito and Pearl, 2002), bringing rigorous necessary-and-sufficient conditions to the MR context. Finally, for orienting causality between two phenotypes, the MR Steiger test (Hemani et al., 2017) is the nearest antecedent; the paper generalizes direction identification by supplying full identification conditions that remain valid even with unmeasured confounding and some invalid instruments.",
  "analysis_timestamp": "2026-01-06T23:33:35.543247"
}