{
  "prior_works": [
    {
      "title": "Conditional Brownian motion and the boundary limits of harmonic functions (Doob’s h-transform)",
      "authors": "Joseph L. Doob",
      "year": 1957,
      "role": "Foundational theory of conditioning Markov processes via h-transform",
      "relationship_sentence": "Provides the exact change-of-measure (h-transform) that conditions a diffusion on reaching a rare set or endpoint—the object this paper recasts as a variational optimization (\"Doob’s Lagrangian\") to enable sample-efficient learning."
    },
    {
      "title": "Transition Path Theory for rare events",
      "authors": "Weinan E; Eric Vanden-Eijnden",
      "year": 2006,
      "role": "Definition and analysis of reactive trajectories and the committor",
      "relationship_sentence": "Introduces the committor as the solution of a backward Kolmogorov problem whose logarithmic gradient yields the Doob-transformed drift, motivating the paper’s boundary-conditioned parameterization and its focus on transition paths between prescribed sets."
    },
    {
      "title": "A survey of the Schrödinger problem and some of its connections with optimal transport",
      "authors": "Christian Léonard",
      "year": 2014,
      "role": "Variational path-space KL formulation (Schrödinger bridges) for conditioned diffusions",
      "relationship_sentence": "Establishes that conditioning can be posed as a path-space entropy minimization with boundary constraints, directly inspiring the paper’s simulation-free variational objective over trajectories connecting fixed endpoints."
    },
    {
      "title": "Linear theory for control of nonlinear stochastic systems (path-integral/KL control)",
      "authors": "H. J. Kappen",
      "year": 2005,
      "role": "Stochastic control as KL-regularized change of measure of path laws",
      "relationship_sentence": "Shows that optimal control of diffusions can be cast as minimizing a KL divergence to the uncontrolled path measure, a principle the paper leverages to learn the Doob-transformed dynamics without rare-event rollout sampling."
    },
    {
      "title": "Simulation of conditioned diffusion and application to parameter estimation",
      "authors": "Bernard Delyon; Ying Hu",
      "year": 2006,
      "role": "Diffusion bridge methodology with endpoint constraints",
      "relationship_sentence": "Provides constructive drifts that enforce endpoint constraints in diffusion bridges, informing the paper’s model parameterization that imposes boundary conditions by design for path optimization."
    },
    {
      "title": "Efficient transition path sampling: Shooting and shifting",
      "authors": "Christoph Dellago; Peter G. Bolhuis; David Chandler",
      "year": 1998,
      "role": "Classical trajectory-space MCMC for rare event transitions",
      "relationship_sentence": "Serves as the principal rare-event path-sampling baseline the paper aims to surpass by replacing expensive trajectory resampling with a variational, learning-based Doob transform."
    },
    {
      "title": "Importance sampling, large deviations, and differential games",
      "authors": "Paul Dupuis; Hui Wang",
      "year": 2007,
      "role": "Optimal change of measure for rare-event simulation via control/variational principles",
      "relationship_sentence": "Links zero-variance importance sampling to optimally twisted path measures, conceptually aligning with the paper’s goal of learning the optimal (Doob) change of measure to make rare events typical."
    }
  ],
  "synthesis_narrative": "The paper’s core innovation—casting Doob’s h-transform as a variational objective (“Doob’s Lagrangian”) that can be trained without simulating vast numbers of rare trajectories—sits at the intersection of conditioning theory, transition path analysis, and variational control. Doob (1957) provides the exact mathematical target: the h-transform that yields the optimally conditioned diffusion for reaching a rare set or fixed endpoint. Transition Path Theory (E & Vanden-Eijnden) identifies the committor as the key object whose logarithmic gradient defines the Doob-transformed dynamics for reactive trajectories, motivating the paper’s boundary-conditioned parameterization.\nSchrödinger bridge theory (Léonard, 2014) contributes the crucial variational lens: conditioning as a path-space KL minimization subject to boundary constraints. This variational viewpoint is operationalized through KL/path-integral control (Kappen, 2005), where optimal control corresponds to an optimal change of path measure relative to the uncontrolled dynamics—precisely the perspective needed to learn the Doob transform without direct rare-event sampling. Methodologically, diffusion bridge constructions (Delyon & Hu, 2006) inform how to encode endpoint constraints into the model so that optimization is conducted over feasible path families by design. Relative to classical Transition Path Sampling (Dellago–Bolhuis–Chandler), which relies on expensive trajectory-space MCMC, the proposed approach learns the optimal twisted dynamics that render transition paths typical. Finally, importance sampling theory for rare events (Dupuis & Wang, 2007) underpins the optimality of the Doob change of measure, reinforcing the paper’s strategy: learn the zero-variance twisting (via a variational principle) rather than estimate it through prohibitively many forward simulations.",
  "analysis_timestamp": "2026-01-06T23:42:49.032424"
}