{
  "prior_works": [
    {
      "title": "Online Convex Programming and Generalized Infinitesimal Gradient Ascent",
      "authors": "Martin Zinkevich",
      "year": 2003,
      "role": "Foundational OCO",
      "relationship_sentence": "This paper established the OCO framework and first-order methods (OGD) with O(√T) regret, which the NeurIPS 2024 paper refines and extends to the constrained, adversarial setting while preserving first-order simplicity."
    },
    {
      "title": "Logarithmic Regret Algorithms for Online Convex Optimization",
      "authors": "Elad Hazan, Amit Agarwal, Satyen Kale",
      "year": 2007,
      "role": "Strongly-convex OCO",
      "relationship_sentence": "The NeurIPS 2024 work leverages the classical O(log T) regret guarantees for strongly convex losses to obtain logarithmic regret while simultaneously controlling adversarial cumulative constraint violation."
    },
    {
      "title": "Online Learning with Primary and Secondary Losses",
      "authors": "Shie Mannor, Ofer Shamir, Ambuj Tewari, Nathan Srebro (often cited as Mannor, Shamir, Sridharan/Sridharan variants in early approachability-based constrained OL)",
      "year": 2009,
      "role": "Adversarial constraints via approachability/Lagrangian",
      "relationship_sentence": "This line of work introduced handling adversarial long-term constraints through Blackwell/dual formulations, a conceptual precursor to the NeurIPS 2024 paper’s adversarial-constraints perspective and regret–violation guarantees."
    },
    {
      "title": "Stochastic Network Optimization with Application to Communication and Queueing Systems",
      "authors": "Michael J. Neely",
      "year": 2010,
      "role": "Virtual-queue/primal–dual methodology",
      "relationship_sentence": "Virtual-queue and drift-plus-penalty techniques from this monograph underpin many primal–dual updates used to control time-averaged constraint violations, which the NeurIPS 2024 paper adapts to adversarial COCO with optimal O(√T)–O(√T) rates."
    },
    {
      "title": "Online Convex Optimization with Long-Term Constraints",
      "authors": "M. Mahdavi, R. Jin, T. Yang",
      "year": 2012,
      "role": "First formal COCO trade-offs",
      "relationship_sentence": "This seminal COCO work formalized regret versus cumulative constraint violation trade-offs and proposed primal–dual updates, directly motivating the NeurIPS 2024 paper’s quest to close the gap to simultaneous optimal O(√T) regret and ~O(√T) CCV."
    },
    {
      "title": "A Low-Complexity Primal–Dual Method with O(√T) Regret and O(√T) Constraint Violation for OCO with Long-Term Constraints",
      "authors": "Hao Yu, Michael J. Neely",
      "year": 2017,
      "role": "Near-optimal bounds under assumptions",
      "relationship_sentence": "Providing O(√T)–O(√T) guarantees under conditions such as Slater or stochastic constraints, this work’s primal–dual/virtual-queue design is a direct algorithmic precursor that the NeurIPS 2024 paper strengthens to fully adversarial constraints without restrictive assumptions."
    },
    {
      "title": "Blackwell Approachability and No-Regret Learning are Equivalent",
      "authors": "Jacob Abernethy, Peter L. Bartlett, Elad Hazan, Alexander Rakhlin",
      "year": 2011,
      "role": "Approachability-duality foundation",
      "relationship_sentence": "This result formally links approachability and no-regret learning, providing the theoretical backbone for treating constraints as adversarial vector payoffs, a perspective operationalized and sharpened in the NeurIPS 2024 paper."
    }
  ],
  "synthesis_narrative": "The NeurIPS 2024 paper resolves a central open problem in constrained online convex optimization (COCO): achieving simultaneous O(√T) regret and ~O(√T) cumulative constraint violation (CCV) against adaptive adversaries with a simple first-order method. Its lineage begins with Zinkevich’s foundational OCO framework and OGD, which defined first-order updates with O(√T) regret. For strongly convex losses, Hazan–Agarwal–Kale established O(log T) regret; the new paper inherits and integrates this rate while still maintaining tight CCV control. The COCO agenda was crystallized by Mahdavi–Jin–Yang, who introduced long-term constraint violation as a performance criterion and initiated primal–dual algorithms that, however, incurred suboptimal CCV rates. Two theoretical pillars then shaped subsequent progress: approachability/dual viewpoints for adversarial constraints (e.g., Mannor–Shamir–Sridharan-style primary/secondary losses and Abernethy–Bartlett–Hazan–Rakhlin’s equivalence) and virtual-queue/drift-plus-penalty methods from Neely’s stochastic network optimization. Building concretely on these, Yu–Neely demonstrated that primal–dual updates can achieve O(√T) regret and O(√T) CCV under assumptions such as Slater or stochastic constraints. The NeurIPS 2024 work synthesizes these strands: it designs a streamlined first-order primal–dual policy, dispenses with restrictive feasibility/stochastic assumptions, and establishes optimal O(√T)–O(√T) guarantees against adaptive adversaries; moreover, it couples strong convexity step-size schedules to attain O(log T) regret without degrading the CCV rate. In doing so, it closes the gap left by prior COCO algorithms and provides a clean, assumption-light optimal solution.",
  "analysis_timestamp": "2026-01-06T23:39:42.968495"
}