{
  "prior_works": [
    {
      "title": "Planning by Probabilistic Inference",
      "authors": "Hagai Attias",
      "year": 2003,
      "role": "Foundational formulation of planning-as-inference in graphical models",
      "relationship_sentence": "Introduced casting control/planning as Bayesian inference via optimality variables in a probabilistic graphical model, the conceptual seed that this paper formalizes within a precise variational free-energy with specific entropy weights."
    },
    {
      "title": "Robot Trajectory Optimization using Approximate Inference",
      "authors": "Marc Toussaint",
      "year": 2009,
      "role": "Methodological precedent applying variational/message-passing approximations to planning-as-inference",
      "relationship_sentence": "Demonstrated that approximate inference tools (e.g., EP/BP-style methods) can be used for planning, motivating the paper’s development of a principled loopy-BP analogue derived from a variational objective tailored to planning."
    },
    {
      "title": "Linear theory for control of nonlinear, stochastic systems",
      "authors": "H. J. Kappen",
      "year": 2005,
      "role": "Control-as-free-energy/path-integral control linking temperature and entropy regularization",
      "relationship_sentence": "Established a free-energy/KL view of stochastic control with explicit temperature (entropy) terms, directly informing this paper’s identification of planning as a particular choice of entropy weightings in a variational objective."
    },
    {
      "title": "Efficient computation of optimal actions (Linearly-solvable MDPs)",
      "authors": "Emanuel Todorov",
      "year": 2009,
      "role": "Entropy-regularized control and KL control cost leading to linear solution structure",
      "relationship_sentence": "Showed how entropy-regularized control (LMDPs) yields tractable structure and explicit temperature parameters, a key antecedent to the paper’s claim that planning corresponds to specific entropy weights within a unified variational framework."
    },
    {
      "title": "Constructing Free-Energy Approximations and Generalized Belief Propagation",
      "authors": "Jonathan S. Yedidia, William T. Freeman, Yair Weiss",
      "year": 2005,
      "role": "Variational foundations of BP via free-energy/entropy decompositions",
      "relationship_sentence": "Provided the variational free-energy machinery linking inference algorithms to entropy-weighted objectives, enabling the paper’s unification of marginal/MAP/marginal-MAP and its derivation of a BP-like planner from the appropriate free-energy."
    },
    {
      "title": "Variational Algorithms for Marginal MAP",
      "authors": "Qiang Liu, Alexander T. Ihler",
      "year": 2013,
      "role": "Variational characterization of mixed inference (marginal-MAP) via adjusted entropy terms",
      "relationship_sentence": "Showed that different inference tasks arise from altering entropy contributions in the free energy and developed corresponding message passing, directly paralleling this paper’s identification of the entropy weights that make planning a special inference case."
    },
    {
      "title": "Loopy Belief Propagation for Approximate Inference: An Empirical Study",
      "authors": "Kevin P. Murphy, Yair Weiss, Michael I. Jordan",
      "year": 1999,
      "role": "Canonical approximate inference algorithm inspiring message-passing design",
      "relationship_sentence": "Established loopy BP as a practical, general-purpose message-passing method; the present work builds an explicit analogue for planning derived from its variational formulation, enabling approximate planning in large factored models."
    }
  ],
  "synthesis_narrative": "The paper’s core contribution—showing that planning corresponds exactly to a distinct set of entropy weights within a variational free-energy and deriving a loopy-BP analogue for planning—sits at the intersection of two lines of work. First, the control-as-inference lineage (Attias; Toussaint; Kappen; Todorov) reframed planning as probabilistic inference by introducing optimality variables and entropy-regularized control objectives. Kappen’s path-integral perspective and Todorov’s linearly-solvable MDPs made explicit the role of temperature and KL/entropy terms in control, while Toussaint demonstrated that message passing and variational approximations can compute trajectories and policies under this view. Second, the variational inference literature (Yedidia; Liu & Ihler) established that inference algorithms, including BP and its generalizations, minimize free-energy functionals composed of energy and entropy terms, and that altering the entropy weights yields different inference problems, such as marginal-MAP, with corresponding message-passing updates.\nBy synthesizing these strands, the paper pinpoints the precise entropy weighting that makes \"planning\" just another variational inference problem, rather than an approximate or heuristic analogy. This recognition unlocks the full toolbox of variational inference for planning. Grounded in Yedidia’s free-energy perspective and inspired by loopy BP (Murphy, Weiss, Jordan), the authors derive a BP-like algorithm specifically tuned to the planning free energy, enabling approximate planning in factored-state MDPs without succumbing to exponential blowup. The result is a principled, unified view that clarifies inconsistencies in prior planning-as-inference formulations and delivers a practical message-passing planner backed by variational theory.",
  "analysis_timestamp": "2026-01-07T00:02:04.745760"
}