{
  "prior_works": [
    {
      "title": "Causal inference using invariant prediction: identification and confidence intervals",
      "authors": "Jonas Peters, Peter Bühlmann, Nicolai Meinshausen",
      "year": 2016,
      "role": "Foundational theory of invariance/causal feature selection",
      "relationship_sentence": "Introduced the invariance principle suggesting that the causal parents of a target yield stable predictive relationships across environments, a core hypothesis the present paper directly tests empirically."
    },
    {
      "title": "Invariant Risk Minimization",
      "authors": "Martin Arjovsky, Léon Bottou, Ishaan Gulrajani, David Lopez-Paz",
      "year": 2019,
      "role": "Causal domain generalization method",
      "relationship_sentence": "Proposed learning predictors that are invariant across environments to capture causal mechanisms; the current study evaluates this causal-invariance premise by comparing causal-feature models to unrestricted models across real domains."
    },
    {
      "title": "Invariant models for causal transfer learning",
      "authors": "Javier Rojas-Carulla, Bernhard Schölkopf, Richard E. Turner, Jonas Peters",
      "year": 2018,
      "role": "Theoretical and algorithmic basis for causal transfer",
      "relationship_sentence": "Formalized how invariant conditional relationships enable transfer across domains, directly motivating the idea that restricting to causal features should improve out-of-domain generalization."
    },
    {
      "title": "Domain adaptation by using causal inference to predict invariant conditional distributions",
      "authors": "Sergio Magliacane, Thijs van Ommen, Patrick Forré, Tom Claassen, Joris M. Mooij",
      "year": 2018,
      "role": "Causal domain adaptation framework",
      "relationship_sentence": "Argued and demonstrated that leveraging causal structure to enforce invariant conditionals aids domain adaptation, a claim the present work scrutinizes on diverse tabular tasks."
    },
    {
      "title": "Learning predictive models that transport",
      "authors": "Adarsh Subbaswamy, Peter Schulam, Suchi Saria",
      "year": 2018,
      "role": "Causality-guided feature/adjustment selection for transportability",
      "relationship_sentence": "Provided methodology to select features and adjustments that support transport across environments, aligning with the paper’s focus on using causally valid features for cross-domain prediction."
    },
    {
      "title": "External Validity: From Do-Calculus to Transportability Across Populations",
      "authors": "Judea Pearl, Elias Bareinboim",
      "year": 2014,
      "role": "Foundational transportability theory",
      "relationship_sentence": "Established formal criteria for when causal relations can be transported between populations, underpinning the broader hypothesis that causal mechanisms confer cross-domain stability assessed here."
    },
    {
      "title": "The Risks of Invariant Risk Minimization",
      "authors": "Elan Rosenfeld, Pradeep Ravikumar, Andrej Risteski",
      "year": 2021,
      "role": "Critical analysis of causal-invariance methods",
      "relationship_sentence": "Showed theoretically and empirically that IRM can fail under realistic conditions, motivating the paper’s systematic, large-scale empirical test of causal-feature generalization claims."
    }
  ],
  "synthesis_narrative": "The core hypothesis scrutinized in this paper—that predictors built on causal features generalize better across domains—emerges from the invariance perspective crystallized by Peters, Bühlmann, and Meinshausen’s invariant causal prediction and extended by causal transfer works such as Rojas-Carulla et al. and Magliacane et al. These works argue that causal parents induce invariant conditionals across environments, suggesting that restricting models to such variables should enhance out-of-domain reliability. Arjovsky et al.’s Invariant Risk Minimization operationalized this idea algorithmically, aiming to learn representations whose predictive relations are stable across environments. Complementing these, Subbaswamy, Schulam, and Saria advanced causality-guided adjustment and feature selection to build transportable predictors, while Pearl and Bareinboim’s transportability framework provided the theoretical foundation that causal relations can be moved across populations under specified conditions. At the same time, critiques such as Rosenfeld et al. highlighted that IRM’s invariance objective can be brittle, raising doubts about practical gains.\n\nBuilding on and directly testing these claims, the present study constructs a broad empirical evaluation across 16 tabular tasks with multiple domains and carefully identified causal features. Contrary to the invariance-based expectation, models limited to causal features did not outperform models using all available features either in-domain or out-of-domain, nor did they exhibit smaller accuracy drops across domains. The findings therefore challenge a central practical implication of causal-invariance theory: in realistic tabular settings, excluding non-causal but predictive variables offers no observed OOD advantage and often harms overall accuracy, calling for a reassessment of when and how causal constraints translate into tangible generalization benefits.",
  "analysis_timestamp": "2026-01-06T23:33:35.536172"
}