{
  "prior_works": [
    {
      "title": "Monotone operators and the proximal point algorithm",
      "authors": "R. T. Rockafellar",
      "year": 1976,
      "role": "Globalization and inexactness framework for monotone inclusions",
      "relationship_sentence": "The paper’s globally convergent scheme and auxiliary subproblem trace back to Rockafellar’s proximal-point framework for monotone operators, which permits controlled inexactness and yields sublinear global guarantees—principles the authors leverage to analyze quasi-Newton approximations within a high-order VI method."
    },
    {
      "title": "An accelerated hybrid proximal extragradient method for convex optimization and its implications to monotone variational inequalities",
      "authors": "R. D. C. Monteiro, B. F. Svaiter",
      "year": 2013,
      "role": "Model-based hybrid proximal/extragradient scaffold for high-order algorithms",
      "relationship_sentence": "The proposed optimal second-order scheme follows the Monteiro–Svaiter model-based viewpoint, where a regularized auxiliary problem must be solved (possibly inexactly); the new analysis explicitly quantifies how Jacobian inaccuracies propagate through this A-HPE-type framework."
    },
    {
      "title": "Implementable tensor methods for large-scale convex optimization",
      "authors": "Y. Nesterov",
      "year": 2018,
      "role": "Taylor-regularized high-order models and optimal rates under exact oracles",
      "relationship_sentence": "The authors adopt Nesterov’s Taylor-regularized model-minimization paradigm and show their method matches the exact-oracle optimal second-order rates; their lower bounds and algorithms extend this theory to account for Jacobian inexactness."
    },
    {
      "title": "Optimal tensor methods for monotone variational inequalities and saddle-point problems",
      "authors": "D. Kamzolov, A. Gasnikov, et al.",
      "year": 2022,
      "role": "Optimal high-order algorithms for monotone VIs with exact derivatives",
      "relationship_sentence": "This work provides the exact-derivative optimal baselines for monotone VIs; the present paper preserves those optimal rates in the exact limit and generalizes them by deriving lower bounds and optimal algorithms under inexact Jacobians."
    },
    {
      "title": "Adaptive regularization with cubics and inexact Hessians",
      "authors": "C. Cartis, N. I. M. Gould, P. L. Toint",
      "year": 2018,
      "role": "Second-order methods with explicit dependence on Hessian inaccuracies",
      "relationship_sentence": "Techniques for modeling and bounding the impact of inexact second-order information in cubic-regularized Newton methods inform the present paper’s explicit dependence on Jacobian inaccuracy in both lower bounds and convergence guarantees for VIs."
    },
    {
      "title": "Finite-Dimensional Variational Inequalities and Complementarity Problems",
      "authors": "F. Facchinei, J.-S. Pang",
      "year": 2003,
      "role": "Newton and quasi-Newton methods for VIs and monotone operators",
      "relationship_sentence": "Classical Newton/Broyden-type updates and globalization strategies for VIs from this monograph directly motivate the paper’s quasi-Newton Jacobian approximations inside the auxiliary problem and underpin the proof of global sublinear convergence."
    },
    {
      "title": "First-order methods of smooth convex optimization with inexact oracle",
      "authors": "O. Devolder, F. Glineur, Y. Nesterov",
      "year": 2014,
      "role": "Inexact-oracle complexity and explicit error-dependence paradigm",
      "relationship_sentence": "The paper generalizes the inexact-oracle viewpoint to higher-order information for monotone VIs, deriving lower bounds and rates with explicit dependence on Jacobian inaccuracy in the spirit of Devolder–Glineur–Nesterov’s error-aware complexity analysis."
    }
  ],
  "synthesis_narrative": "This work sits at the intersection of model-based high-order methods for monotone variational inequalities and error-aware complexity theory. Rockafellar’s proximal-point framework provides the globalization backbone: a regularized monotone inclusion whose inexact solution still ensures global progress. Monteiro and Svaiter formalized a hybrid proximal–extragradient scaffold that modern high-order schemes use to define and (approximately) solve a model-based auxiliary problem; the present paper operates squarely within this paradigm while tracking Jacobian inexactness. Nesterov’s Taylor-regularized tensor methods supply the model-minimization template and optimal rates under exact oracles. Kamzolov and Gasnikov extended these ideas to monotone VIs, establishing optimal second-order/tensor rates in the exact-derivative setting—the benchmark this paper matches when the Jacobian is exact.\n\nThe new ingredient is an explicit, sharp dependence on Jacobian inaccuracy in both lower bounds and algorithmic guarantees. Here, two lines of prior work are pivotal: Devolder–Glineur–Nesterov’s inexact-oracle complexity framework, which articulates how oracle errors should enter rates, and Cartis–Gould–Toint’s inexact second-order analyses, which show how Hessian errors propagate in cubic-regularized steps. Finally, the design of practical quasi-Newton Jacobian updates and their globalization is grounded in the classical VI literature synthesized by Facchinei and Pang. Together, these works enable the authors to (i) derive lower bounds reflecting Jacobian error, (ii) design an algorithm that is optimal in the exact limit, and (iii) introduce quasi-Newton approximations that retain global sublinear convergence while reducing inner-solve cost.",
  "analysis_timestamp": "2026-01-06T23:33:35.525302"
}