{
  "prior_works": [
    {
      "title": "Neural Kinematic Networks for Unsupervised Motion Retargetting",
      "authors": [
        "Ruben Villegas",
        "Jimei Yang",
        "Seunghoon Hong",
        "Xunyu Lin",
        "Honglak Lee"
      ],
      "year": 2018,
      "role": "Learning-based motion retargeting baseline (skeleton-centric)",
      "relationship_sentence": "This seminal retargeting method highlights the limitations of skeleton-only mappings—such as contact mismatch and interpenetration—that MeshRet overcomes by explicitly modeling dense geometric interactions."
    },
    {
      "title": "Discovery of Complex Behaviors through Contact-Invariant Optimization",
      "authors": [
        "Igor Mordatch",
        "Emanuel Todorov",
        "Zoran Popović"
      ],
      "year": 2012,
      "role": "Foundational integration of contact reasoning into motion generation",
      "relationship_sentence": "It establishes the principle that contact should be modeled jointly with motion generation rather than corrected post hoc, a core rationale behind MeshRet’s end-to-end DMI-based retargeting."
    },
    {
      "title": "POSA: Perceiving 3D Human-Object Interactions from a Single RGB Image",
      "authors": [
        "Rohit Girdhar Bhatnagar",
        "Garvita Tiwari",
        "Christian Theobalt",
        "Michael J. Black",
        "J. Romero"
      ],
      "year": 2020,
      "role": "Dense, per-vertex interaction representation on human meshes",
      "relationship_sentence": "POSA’s idea of encoding proximity and contact per mesh vertex informs MeshRet’s Dense Mesh Interaction (DMI) field that captures both contact and near-contact geometry relations across time."
    },
    {
      "title": "3D-CODED: 3D Correspondences by Deep Deformation",
      "authors": [
        "Thibault Groueix",
        "Matthew Fisher",
        "Vladimir G. Kim",
        "Bryan C. Russell",
        "Mathieu Aubry"
      ],
      "year": 2018,
      "role": "Template-based deep nonrigid correspondence across shapes",
      "relationship_sentence": "Its strategy of learning semantically consistent correspondences via template deformation directly inspires MeshRet’s Semantically Consistent Sensors (SCS) for cross-topology dense alignment."
    },
    {
      "title": "Functional Maps: A Flexible Representation of Maps Between Shapes",
      "authors": [
        "Maks Ovsjanikov",
        "Mirela Ben-Chen",
        "Justin Solomon",
        "Adrian Butscher",
        "Leonidas Guibas"
      ],
      "year": 2012,
      "role": "Foundational framework for topology-agnostic shape correspondence",
      "relationship_sentence": "The functional maps paradigm underpins the idea of consistent semantic alignment across diverse mesh topologies that MeshRet operationalizes with SCS."
    },
    {
      "title": "SMPL: A Skinned Multi-Person Linear Model",
      "authors": [
        "Matthew Loper",
        "Natalia Mahmood",
        "Javier Romero",
        "Gerard Pons-Moll",
        "Michael J. Black"
      ],
      "year": 2015,
      "role": "Standard parametric skinned body model enabling dense mesh semantics",
      "relationship_sentence": "SMPL’s skinned, semantically indexed mesh provides the practical substrate for defining per-vertex signals and contacts, motivating MeshRet’s dense mesh-level reasoning for retargeting."
    }
  ],
  "synthesis_narrative": "MeshRet’s core innovation—retargeting by directly perceiving and leveraging dense geometric interactions—emerges at the intersection of three lines of prior work. First, skeleton-centric motion retargeting, exemplified by Neural Kinematic Networks (Villegas et al., 2018), demonstrated that learning to map kinematics across bodies is feasible but often suffers from foot-skate, interpenetration, and contact mismatch because geometry is treated post hoc. Second, classical and learning-based motion generation with built-in contact reasoning, notably Contact-Invariant Optimization (Mordatch et al., 2012), argued that contact must be modeled jointly with motion; this principle directly motivates MeshRet’s end-to-end formulation where geometry interaction is not a correction but a driver of retargeting. Third, dense, per-vertex interaction representations such as POSA (2020) showed that contacts and near-contacts can be encoded on meshes, suggesting that a spatio-temporal field over mesh points can capture rich interaction cues; MeshRet’s Dense Mesh Interaction (DMI) field generalizes this idea to capture both contact and non-contact interactions over time for retargeting.\nTo make dense interaction reasoning transferable across varied character topologies, MeshRet builds on cross-shape correspondence advances: deep template-based matching from 3D-CODED (2018) and the topology-agnostic principles of Functional Maps (2012) inform its Semantically Consistent Sensors (SCS) that anchor comparable surface locations across meshes. Finally, SMPL (2015) underpins the notion of skinned, semantically indexed meshes, providing a practical canvas for per-vertex signals. Together, these works directly inform MeshRet’s key contribution: a retargeting framework that aligns meshes via SCS and optimizes motion using a DMI field to maintain faithful, contact-consistent geometry interactions.",
  "analysis_timestamp": "2026-01-07T00:02:04.756504"
}