{
  "prior_works": [
    {
      "title": "Equivalent Comparisons of Experiments",
      "authors": "David Blackwell",
      "year": 1953,
      "role": "Decision-theoretic foundation for how additional signals reduce Bayes risk via Blackwell’s informativeness order.",
      "relationship_sentence": "The paper’s guarantees that expert judgments can provably improve any feasible predictor instantiate Blackwell’s order: human side information refines the algorithm’s coarsened signal (indistinguishability class), yielding a more informative experiment and quantifiable Bayes-risk reduction."
    },
    {
      "title": "On Optimum Recognition Error and Reject Trade-off",
      "authors": "C. K. Chow",
      "year": 1970,
      "role": "Classic formulation of selective prediction via reject/abstain decisions to reduce risk.",
      "relationship_sentence": "The proposed selective incorporation of human feedback generalizes Chow’s reject-option by deferring not on confidence thresholds but on algorithmically indistinguishable sets where humans possess side information, delivering principled performance guarantees."
    },
    {
      "title": "Efficient Noise-Tolerant Learning from Statistical Queries",
      "authors": "Michael Kearns",
      "year": 1998,
      "role": "Introduces the statistical query framework, formalizing indistinguishability under restricted algorithmic access/classes.",
      "relationship_sentence": "The paper’s notion of “algorithmic indistinguishability” parallels SQ-style indistinguishability for feasible learners; human judgments are leveraged to separate instances that algorithms—constrained by data or hypothesis class—treat as effectively identical."
    },
    {
      "title": "Predict Responsibly: Improving Fairness and Accuracy by Learning to Defer",
      "authors": "Rachel Madras, Elliot Creager, Toniann Pitassi, Richard Zemel",
      "year": 2018,
      "role": "Establishes objective functions and training procedures for models that defer to human experts.",
      "relationship_sentence": "This work motivates algorithmic deferral but relies on learned policies; the present paper advances a structural criterion—algorithmic indistinguishability—to decide when to defer and provides universal improvement guarantees grounded in decision theory."
    },
    {
      "title": "Consistent Estimators for Learning to Defer to an Expert",
      "authors": "Hussein Mozannar, David Sontag",
      "year": 2020,
      "role": "Analyzes identifiability and proposes consistent estimators for deferral under selective labels and human expertise.",
      "relationship_sentence": "By highlighting pitfalls of deferral learning with selective labels, this work motivates the paper’s test for whether experts use side information not in training data, and the shift to operating over indistinguishability classes to avoid such confounding."
    },
    {
      "title": "Human Decisions and Machine Predictions",
      "authors": "Jon Kleinberg, Himabindu Lakkaraju, Jure Leskovec, Jens Ludwig, Sendhil Mullainathan",
      "year": 2018,
      "role": "Empirically and theoretically examines algorithmic predictions in policy, contrasting algorithm and human strengths.",
      "relationship_sentence": "It documents that humans can hold context absent from datasets; the present paper formalizes this as side information that resolves algorithmic indistinguishability and shows how to selectively combine it to improve prediction."
    }
  ],
  "synthesis_narrative": "The paper’s core contribution—using human expertise to resolve algorithmically indistinguishable inputs and thereby provably improve prediction—stands at the intersection of decision theory, selective prediction, and human–AI collaboration. Blackwell’s seminal theory of experiments provides the conceptual backbone: if human judgments deliver signals that refine the algorithm’s coarsened view of the world, the combined signal is Blackwell-more-informative and must reduce Bayes risk. Chow’s classical reject-option work motivates selective engagement, but here the selection rule is structural (indistinguishability classes) rather than confidence-threshold-based, clarifying when deferral is beneficial.\nLearning-to-defer studies operationalize machine-to-human handoff. Madras et al. introduce objectives that allow a model to defer to an expert, while Mozannar and Sontag identify consistency and identifiability challenges when labels are selectively observed. The present framework addresses these issues by testing whether experts truly possess side information beyond training data and by targeting deferral precisely where the algorithm cannot discriminate.\nTechnically, the indistinguishability lens resonates with Kearns’s statistical query paradigm: algorithms constrained by data access or hypothesis class render many inputs indistinguishable. Human expertise can inject non-SQ information to separate such cases. Finally, large-scale evidence from Kleinberg et al. demonstrates that humans often hold context not captured in features; this paper turns that observation into a principled mechanism and performance bound, specifying when and how human judgments should be integrated to reliably outperform any standalone feasible predictor.",
  "analysis_timestamp": "2026-01-06T23:33:36.257939"
}