{
  "prior_works": [
    {
      "title": "A Quantum Approximate Optimization Algorithm",
      "authors": "Edward Farhi, Jeffrey Goldstone, Sam Gutmann",
      "year": 2014,
      "role": "Foundational algorithm",
      "relationship_sentence": "This paper defines the QAOA framework—mixing and problem Hamiltonians at depth p—which the present work instantiates for the spiked tensor objective and analyzes to derive weak-recovery thresholds and overlap laws."
    },
    {
      "title": "A Statistical Model for Tensor PCA",
      "authors": "Emile Richard, Andrea Montanari",
      "year": 2014,
      "role": "Spiked tensor model and classical baselines",
      "relationship_sentence": "Richard–Montanari formulate the Gaussian spiked q-tensor model and analyze classical algorithms (e.g., tensor power iteration), providing the precise baseline that this paper shows 1-step QAOA matches in weak recovery."
    },
    {
      "title": "Tensor PCA, Planted Clique, and Sum-of-Squares",
      "authors": "Samuel B. Hopkins, Tselil Schramm, Jonathan Shi, David Steurer",
      "year": 2015,
      "role": "Computational lower bounds (SoS)",
      "relationship_sentence": "By proving SoS lower bounds for tensor PCA, this work supports the conjectured computational threshold Θ(n^{(q−2)/4}), which the present paper shows multi-step QAOA with unfolding can reach but not surpass for fixed p."
    },
    {
      "title": "Statistical Limits of Spiked Tensor Models",
      "authors": "Amelia Perry, Alexander S. Wein, Afonso S. Bandeira",
      "year": 2016,
      "role": "Information-theoretic and algorithmic thresholds",
      "relationship_sentence": "Perry–Wein–Bandeira delineate detection/recovery thresholds and assess polynomial-time methods (including spectral/unfolding), framing the statistical vs. computational gap that the QAOA analysis is benchmarked against."
    },
    {
      "title": "Shifted Power Method for Computing Tensor Eigenpairs",
      "authors": "Tamara G. Kolda, Jackson R. Mayo",
      "year": 2011,
      "role": "Classical tensor power iteration",
      "relationship_sentence": "This work provides the canonical tensor power iteration methodology whose one-step and multi-step recovery behavior serves as the direct classical comparator that the paper proves QAOA matches at corresponding depths."
    },
    {
      "title": "The Quantum Approximate Optimization Algorithm and the Sherrington–Kirkpatrick Model at Infinite Size",
      "authors": "Edward Farhi, David Gamarnik, Sam Gutmann",
      "year": 2019,
      "role": "Analytical techniques for constant-depth QAOA on mean-field models",
      "relationship_sentence": "Develops mean-field/thermodynamic-limit analysis of constant-depth QAOA in spin-glass landscapes, informing the present paper’s derivations of asymptotic overlap distributions (e.g., the sine–Gaussian law) in a planted p-spin/tensor setting."
    },
    {
      "title": "Statistical-to-Computational Phase Transitions in Spiked Tensor Estimation via Approximate Message Passing",
      "authors": "Louis Lesieur, Florent Krzakala, Lenka Zdeborová",
      "year": 2017,
      "role": "Algorithmic phase transitions for spiked tensors",
      "relationship_sentence": "AMP analyses chart the computational-statistical landscape for spiked tensors and corroborate that efficient algorithms face a barrier matching Θ(n^{(q−2)/4}), a benchmark against which the paper positions QAOA’s achievable thresholds."
    }
  ],
  "synthesis_narrative": "The paper’s core contribution—an exact and heuristic characterization of QAOA’s weak-recovery threshold on the spiked tensor model and its equivalence to tensor power iteration at matching depth—rests on two pillars: the statistical structure of spiked tensors and the analytic machinery for constant-depth QAOA. Richard and Montanari’s formulation of the spiked tensor model and analysis of classical algorithms established tensor power iteration as the canonical baseline and highlighted the computational–statistical gap. Complementary results by Perry, Wein, and Bandeira determined information-theoretic thresholds and clarified where polynomial-time methods (including unfolding/spectral approaches) succeed, while Hopkins–Schramm–Shi–Steurer’s SoS lower bounds provided robust evidence for a Θ(n^{(q−2)/4}) computational barrier. Together these works specify the exact classical thresholds the present paper aims to compare against.\nOn the quantum side, Farhi–Goldstone–Gutmann defined QAOA’s structure, and subsequent mean-field analyses for spin-glass models by Farhi–Gamarnik–Gutmann supplied techniques to compute constant-depth performance in disordered Hamiltonians. Leveraging this toolbox, the present work maps QAOA dynamics in the planted p-spin (spiked tensor) landscape to show that 1-step QAOA matches 1-step tensor power iteration, and, heuristically, p-step QAOA matches p-step power iteration for fixed p, implying no asymptotic surpassing of the classical Θ(n^{(q−2)/4}) threshold even when combined with tensor unfolding. These analyses also motivate and validate the reported sine–Gaussian law for asymptotic overlaps, linking QAOA parameter evolutions to explicit limiting distributions.",
  "analysis_timestamp": "2026-01-06T23:33:35.549520"
}