{
  "prior_works": [
    {
      "title": "Bayesian Persuasion",
      "authors": "Emir Kamenica, Matthew Gentzkow",
      "year": 2011,
      "role": "Foundational model of persuasion",
      "relationship_sentence": "Provides the core framework—signaling schemes as distributions over posteriors under Bayes plausibility and receiver best responses—that this paper optimizes against in an online, learning setting."
    },
    {
      "title": "Equivalent Comparisons of Experiments",
      "authors": "David Blackwell",
      "year": 1953,
      "role": "Representation/ordering of information structures",
      "relationship_sentence": "Underpins the paper’s non-standard representation of signaling schemes by formalizing experiments as distributions over posteriors and the constraints (Bayes plausibility) they must satisfy when the prior is unknown."
    },
    {
      "title": "Algorithmic Bayesian Persuasion",
      "authors": "Shaddin Dughmi, Haifeng Xu",
      "year": 2016,
      "role": "Computational/representation tools for persuasion",
      "relationship_sentence": "Introduces signature-based and reduced-form representations and LP techniques for optimizing signaling schemes; the present work leverages and adapts these representation ideas to search over schemes while learning receiver best responses online."
    },
    {
      "title": "Bayesian Exploration: Incentivizing Exploration in Bandit Settings",
      "authors": "Yishay Mansour, Aleksandrs Slivkins, Vasilis Syrgkanis, Steven Wu",
      "year": 2020,
      "role": "Learning with incentive constraints over repeated agents",
      "relationship_sentence": "Establishes how a principal can achieve sublinear regret while maintaining incentive compatibility across myopic receivers; this paper’s online persuasion algorithm similarly interleaves exploration and exploitation under incentive-driven best responses."
    },
    {
      "title": "Online Bayesian Persuasion with Unknown Receiver’s Utilities",
      "authors": "Matteo Castiglioni, Alberto Marchesi, Nicola Gatti",
      "year": 2022,
      "role": "Online persuasion under partially unknown environment (unknown receiver)",
      "relationship_sentence": "Directly precedes the present work by learning the receiver’s best responses when the prior is known; the new paper removes that assumption, generalizing techniques to the harder case of unknown prior and utilities."
    },
    {
      "title": "Online Bayesian Persuasion with Unknown Prior",
      "authors": "Alberto Marchesi, Matteo Castiglioni, Nicola Gatti",
      "year": 2023,
      "role": "Online persuasion under partially unknown environment (unknown prior)",
      "relationship_sentence": "Provides the complementary case in which the prior is learned while receiver utilities are known; the current paper fuses and extends these lines to handle both unknowns and proves matching lower bounds."
    }
  ],
  "synthesis_narrative": "The paper’s key contribution—achieving sublinear regret in online Bayesian persuasion when both the prior and the receiver’s utilities are unknown—rests on unifying foundations from information design with online learning under incentives. Kamenica and Gentzkow (2011) supplies the base persuasion model, defining signaling schemes as distributions over posterior beliefs and characterizing optimal persuasion via concavification and receiver best responses. Blackwell’s classic theory formalizes information structures as distributions over posteriors subject to Bayes plausibility; this is crucial for the paper’s non-standard representation that makes searching the space of schemes feasible even without prior knowledge. Dughmi and Xu (2016) contribute algorithmic representations (e.g., signatures/reduced forms) and optimization tools that inspire how the present work parameterizes and searches over signaling schemes.\n\nOn the online side, Bayesian Exploration (Mansour et al., 2020) shows how a principal can learn while respecting incentive constraints for a stream of myopic agents, offering techniques and regret benchmarks for exploration-exploitation with strategic responses. The most immediate precursors are the authors’ own online persuasion studies that handle only one unknown at a time: learning receiver utilities with a known prior, and learning the prior with known utilities. The present paper synthesizes these strands, designing a scheme-search procedure that simultaneously elicits receiver best responses and navigates Bayes-plausible posteriors without prior knowledge, and establishing tight lower bounds that match the achieved regret guarantees.",
  "analysis_timestamp": "2026-01-07T00:02:04.746683"
}