{
  "prior_works": [
    {
      "title": "The Variational Formulation of the Fokker–Planck Equation",
      "authors": "Richard Jordan, David Kinderlehrer, Felix Otto",
      "year": 1998,
      "role": "Foundational scheme (JKO) for viewing diffusion as a sequence of variational proximal steps in Wasserstein space.",
      "relationship_sentence": "JKOnet* directly instantiates the JKO minimizing-movement step and learns the free-energy functional driving the diffusion, turning identification of the process into parameter estimation within the JKO update."
    },
    {
      "title": "Gradient Flows: In Metric Spaces and in the Space of Probability Measures",
      "authors": "Luigi Ambrosio, Nicola Gigli, Giuseppe Savaré",
      "year": 2008,
      "role": "Comprehensive mathematical framework for Wasserstein gradient flows, optimality conditions, and convergence of JKO schemes.",
      "relationship_sentence": "The AGS framework justifies the quadratic loss JKOnet* minimizes via first-order optimality of the JKO step and supports consistency when recovering the underlying energy from observational data."
    },
    {
      "title": "The geometry of dissipative evolution equations: the porous medium equation",
      "authors": "Felix Otto",
      "year": 2001,
      "role": "Introduced the Riemannian structure on the Wasserstein space linking PDEs to energy gradients.",
      "relationship_sentence": "Otto’s geometric view underpins JKOnet*’s parameterization of energies and explains why linear-in-parameters functionals admit closed-form estimators derived from the Euler–Lagrange conditions of the JKO step."
    },
    {
      "title": "Contractions in the 2-Wasserstein length space and thermalization of granular media",
      "authors": "José A. Carrillo, Robert J. McCann, Cédric Villani",
      "year": 2003,
      "role": "Elaborated the free-energy structure of diffusion/aggregation equations, decomposing into potential, interaction, and internal (entropic/porous) energies.",
      "relationship_sentence": "JKOnet*’s key capability—recovering potential, interaction, and internal energy components—follows this decomposition and learns each term from data within the JKO framework."
    },
    {
      "title": "A computational fluid mechanics solution to the Monge–Kantorovich mass transfer problem",
      "authors": "Jean-David Benamou, Yann Brenier",
      "year": 2000,
      "role": "Dynamic (Benamou–Brenier) formulation of W2 optimal transport enabling algorithmic handling of Wasserstein distances.",
      "relationship_sentence": "While JKOnet* avoids an inner OT solve (bilevel complexity), its derivation leverages the same variational OT machinery to obtain tractable optimality conditions that reduce to a simple quadratic objective."
    },
    {
      "title": "Denoising Diffusion Probabilistic Models",
      "authors": "Jonathan Ho, Ajay Jain, Pieter Abbeel",
      "year": 2020,
      "role": "Catalyzed diffusion-based generative modeling by learning drift/score surrogates via denoising objectives.",
      "relationship_sentence": "These models motivate JKOnet*’s departure from drift-only learning; JKOnet* instead identifies the full energy structure governing diffusion, improving interpretability and sample efficiency."
    },
    {
      "title": "Score-Based Generative Modeling through Stochastic Differential Equations",
      "authors": "Yang Song, Jascha Sohl-Dickstein, Diederik P. Kingma, Abhishek Kumar, Stefano Ermon, Ben Poole",
      "year": 2021,
      "role": "Unified diffusion models with SDEs by estimating the score (drift) from data.",
      "relationship_sentence": "JKOnet* contrasts with score-SDE methods by dispensing with score estimation and directly learning the underlying free-energy components that induce the drift and diffusion via the JKO discretization."
    }
  ],
  "synthesis_narrative": "JKOnet*’s core idea is to recast learning diffusion dynamics as identifying the free-energy functional that generates a Wasserstein gradient flow. This pivot traces directly to the Jordan–Kinderlehrer–Otto (JKO) scheme, which views diffusion as successive variational proximal steps in Wasserstein space. Ambrosio–Gigli–Savaré provided the rigorous optimality conditions and convergence properties of these steps, allowing JKOnet* to derive a simple quadratic objective from the Euler–Lagrange equations of a single JKO update and thereby sidestep the bilevel inner optimization typical of prior approaches. Otto’s geometric interpretation of dissipative PDEs in Wasserstein space clarifies how parametrizing the energy functional—rather than the drift—yields identifiable structures and admits closed-form solutions when the energy is linear in parameters.\nCrucially, Carrillo–McCann–Villani’s decomposition of free energy into potential, interaction, and internal (entropic/porous) components guides JKOnet*’s representational design: the model learns each component from data, enabling interpretable recovery of the underlying diffusion process. While the Benamou–Brenier dynamic formulation of optimal transport historically enabled computational access to Wasserstein distances, JKOnet* leverages the same variational machinery but collapses the learning problem to least-squares via first-order conditions, avoiding expensive inner OT solves. Finally, diffusion and score-based generative models (Ho et al.; Song et al.) motivated the departure from drift-only estimation: by learning the full energy functional that induces drift and diffusion, JKOnet* attains superior sample efficiency, accuracy, and closed-form estimators for linear parametrizations, delivering “lightspeed” learning of diffusion processes.",
  "analysis_timestamp": "2026-01-07T00:02:04.739668"
}