{
  "prior_works": [
    {
      "title": "Towards Deep Learning Models Resistant to Adversarial Attacks",
      "authors": "Aleksander Madry, Aleksandar Makelov, Ludwig Schmidt, Dimitris Tsipras, Adrian Vladu",
      "year": 2018,
      "role": "Foundational projected gradient descent (PGD) attack and robust optimization framework",
      "relationship_sentence": "CAPGD is a constraint-aware, adaptive variant of PGD: it inherits iterative gradient steps and projection, but redefines the projection operator and update masking to respect tabular constraints (categoricals, immutability, feature relationships)."
    },
    {
      "title": "Reliable Evaluation of Adversarial Robustness with an Ensemble of Diverse Adversarial Attacks (AutoAttack) [incl. APGD]",
      "authors": "Francesco Croce, Matthias Hein",
      "year": 2020,
      "role": "Parameter-free adaptive gradient attack design (APGD) for robust evaluation",
      "relationship_sentence": "The paper’s ‘no tuning’ and adaptive step-size mechanisms in CAPGD directly echo APGD’s oscillation/backtracking heuristics, transplanted to a tabular, constraint-projected setting to make gradient attacks reliable without hyperparameter sweeps."
    },
    {
      "title": "Towards Evaluating the Robustness of Neural Networks",
      "authors": "Nicholas Carlini, David Wagner",
      "year": 2017,
      "role": "Optimization-based attack emphasizing confidence margins and constraint handling",
      "relationship_sentence": "CAPGD’s objective shaping (margin-based losses) and careful feasibility enforcement are influenced by C&W’s formulation of strong, targeted losses and constrained optimization for high-success, low-perturbation adversarial examples."
    },
    {
      "title": "MOEVA: A Multi-Objective Evolutionary Attack on Deep Neural Networks",
      "authors": "Salah Ghamizi, Maxime Cordy, et al.",
      "year": 2020,
      "role": "Search-based tabular attack handling discrete/categorical constraints",
      "relationship_sentence": "CAA, the paper’s hybrid attack, explicitly combines CAPGD with MOEVA to fuse gradient efficiency with evolutionary exploration for discrete changes, leveraging MOEVA’s strength on categorical and feasibility constraints."
    },
    {
      "title": "Evasion Attacks Against Tree Ensembles",
      "authors": "Alex Kantchelian, J. D. Tygar, Anthony D. Joseph",
      "year": 2016,
      "role": "Early tabular-domain evasion attacks emphasizing feasibility and constraint-respecting perturbations",
      "relationship_sentence": "This work established the necessity of respecting domain validity (e.g., immutable features, bounded and discrete variables) in non-vision settings, a principle CAPGD operationalizes via projection and masking over tabular constraint sets."
    },
    {
      "title": "Actionable Recourse in Linear Classification",
      "authors": "Berk Ustun, Alexander Spangher, Yang Liu",
      "year": 2019,
      "role": "Formalization of immutability and feasible action sets in tabular feature spaces",
      "relationship_sentence": "The paper’s constraint modeling for immutability, categorical changes, and feature relationships echoes actionable recourse formulations, informing CAPGD/CAA’s explicit feasible-set definitions to ensure semantically valid adversarial examples."
    }
  ],
  "synthesis_narrative": "The core innovation of Constrained Adaptive Attack (CAPGD/CAA) marries robust gradient-based optimization with realistic tabular constraints and search-based complementarity. At its foundation, the method builds on PGD’s iterative update-plus-projection scheme, but replaces the standard Lp projection with a tabular-aware operator that enforces immutability, category validity, and feature relationships. To make gradient attacks effective and reliable without parameter sweeps, the authors adopt the adaptive, tuning-free spirit of APGD from AutoAttack—transferring oscillation and backtracking step-size rules to a setting where each step must remain within a mixed discrete–continuous feasible set. The choice of margin-focused losses and careful constraint enforcement reflects lessons from the C&W attack, which showed how strong objectives and constrained optimization markedly increase attack success.\n\nTabular-specific feasibility considerations trace back to early evasion attacks on structured models (e.g., tree ensembles), which highlighted that realistic adversaries must respect domain semantics and immutable attributes. This perspective is reinforced by actionable recourse research, which formalizes immutable features, feasible action sets, and dependency constraints—concepts the paper encodes directly in CAPGD’s projection and masking. Finally, the hybrid CAA leverages MOEVA, the leading search-based tabular attack, to complement gradients with evolutionary exploration for categorical and combinatorial changes. Together, these works directly shaped CAPGD’s constraint-aware, adaptive gradient design and CAA’s hybridization, yielding a state-of-the-art, tuning-free evaluation attack suite for deep tabular models.",
  "analysis_timestamp": "2026-01-06T23:33:35.527316"
}