{
  "prior_works": [
    {
      "title": "3D Gaussian Splatting for Real-Time Radiance Field Rendering",
      "authors": "Thomas Kerbl et al.",
      "year": 2023,
      "role": "Foundation",
      "relationship_sentence": "OmniRe adopts 3D Gaussian Splatting as the core scene representation and renderer, building its object-centric scene graphs and per-actor models directly atop this primitive to achieve real-time (~60 Hz) reconstruction and simulation."
    },
    {
      "title": "Neural Scene Graphs",
      "authors": "Ost et al.",
      "year": 2021,
      "role": "Foundation",
      "relationship_sentence": "OmniRe transfers the Neural Scene Graphs idea of object-centric dynamic scene decomposition into a Gaussian-splatting framework, using a scene graph to manage multiple independently moving actors within a single urban scene."
    },
    {
      "title": "D-NeRF: Neural Radiance Fields for Dynamic Scenes",
      "authors": "Albert Pumarola et al.",
      "year": 2021,
      "role": "Inspiration",
      "relationship_sentence": "OmniRe’s per-actor canonical Gaussian representations are inspired by D-NeRF’s canonical-space + deformation formulation, replacing NeRF with Gaussians to model dynamic objects via canonicalization and motion."
    },
    {
      "title": "HyperNeRF: A Higher-Dimensional Representation for Topologically Varying Neural Radiance Fields",
      "authors": "Daniel B. Park et al.",
      "year": 2021,
      "role": "Extension",
      "relationship_sentence": "OmniRe extends the canonical-space notion toward handling diverse, potentially complex actor motions (e.g., pedestrians and cyclists), drawing on HyperNeRF’s insight that higher-dimensional canonical embeddings handle challenging dynamic variability."
    },
    {
      "title": "Panoptic Neural Fields",
      "authors": "Zhi et al.",
      "year": 2022,
      "role": "Inspiration",
      "relationship_sentence": "OmniRe inherits the panoptic, object-aware decomposition principle from Panoptic Neural Fields but realizes it with 3D Gaussians to scale to large urban scenes and to support fast, multi-actor dynamic reconstruction."
    },
    {
      "title": "4D Gaussian Splatting for Real-Time Dynamic Scene Rendering",
      "authors": "Wu et al.",
      "year": 2023,
      "role": "Gap Identification",
      "relationship_sentence": "OmniRe addresses a key limitation of 4D Gaussian Splatting—which typically models a single dynamic subject or scene-level motion—by building object-centric canonical Gaussian models for many heterogeneous actors in the same urban scene."
    },
    {
      "title": "GIRAFFE: Representing Scenes as Compositional Generative Neural Feature Fields",
      "authors": "Michael Niemeyer et al.",
      "year": 2021,
      "role": "Related Problem",
      "relationship_sentence": "OmniRe’s compositional, object-level formulation echoes GIRAFFE’s scene-as-objects paradigm, but adapts it from generative feature fields to reconstructive, log-driven 3D Gaussian models for dynamic urban actors."
    }
  ],
  "synthesis_narrative": "OmniRe’s core innovation—holistic, object-centric reconstruction of dynamic urban scenes with real-time performance—stands on three intertwined threads of prior work. First, 3D Gaussian Splatting provides the real-time rendering and learnable primitive that make high-frequency simulation feasible; OmniRe directly builds its per-object models and entire scene graph on this representation. Second, the canonical-space lineage from D-NeRF and HyperNeRF informs OmniRe’s actor modeling: each dynamic object (vehicles, pedestrians, cyclists) is represented in a canonical Gaussian space with explicit motion to observed frames, transplanting the canonical/deformation paradigm from NeRFs to Gaussians. Third, the structural idea of managing scenes as collections of moving objects comes from Neural Scene Graphs and panoptic object-aware neural fields. OmniRe fuses these object-centric decompositions with Gaussian splatting to scale to urban settings and to support diverse actor categories—addressing a central gap in dynamic Gaussian methods like 4D Gaussian Splatting that generally treat a single dynamic subject or scene-level motion. Compositional scene thinking from GIRAFFE further reinforced the benefits of object-level factorization, which OmniRe operationalizes for reconstruction rather than generation. Together, these works directly shaped OmniRe’s design: object-centric canonical Gaussian actors organized by a scene graph, enabling the first comprehensive, fast reconstruction of heterogeneous dynamic urban scenes suitable for downstream, human-in-the-loop simulation.",
  "analysis_timestamp": "2026-01-06T23:09:26.589133"
}