{
  "prior_works": [
    {
      "title": "Unsupervised Feature Extraction by Time-Contrastive Learning and Nonlinear ICA",
      "authors": "Aapo Hyvärinen and Hiroshi Morioka",
      "year": 2016,
      "arxiv_id": "1605.02611",
      "role": "Foundation",
      "relationship_sentence": "This work introduced the auxiliary/context variable and “sufficient variability” idea via nonstationary time segments, which IDOL leverages as contextual information to prove identifiability of latent processes."
    },
    {
      "title": "Nonlinear ICA Using Auxiliary Variables and Generalized Contrastive Learning",
      "authors": "Aapo Hyvärinen et al.",
      "year": 2019,
      "arxiv_id": "1805.08651",
      "role": "Extension",
      "relationship_sentence": "It formalized identifiability with auxiliary variables beyond stationarity, providing the precise sufficient-variability condition and proof template that IDOL adapts to latent temporal causal models with instantaneous links."
    },
    {
      "title": "Variational Autoencoders and Nonlinear ICA: A Unifying Framework",
      "authors": "Ilyes Khemakhem et al.",
      "year": 2020,
      "arxiv_id": "1907.04809",
      "role": "Extension",
      "relationship_sentence": "By showing how auxiliary-variable identifiability can be embedded in a VAE objective (iVAE), this work directly informs IDOL’s temporally varying VAE-style estimator consistent with its identifiability assumptions."
    },
    {
      "title": "DYNOTEARS: Structure Learning from Time-Series Data",
      "authors": "Silviu Pamfil et al.",
      "year": 2020,
      "arxiv_id": "2002.00498",
      "role": "Inspiration",
      "relationship_sentence": "DYNOTEARS’ parameterization and sparsity over both instantaneous and lagged edges inspired IDOL’s sparse influence constraint on latent time-delayed and instantaneous relations."
    },
    {
      "title": "Detecting causal associations in large nonlinear time series datasets with the PCMCI method",
      "authors": "Jakob Runge et al.",
      "year": 2019,
      "arxiv_id": "1702.07007",
      "role": "Related Problem",
      "relationship_sentence": "PCMCI/PCMCI+ clarified how contemporaneous (instantaneous) and lagged dependencies can be disentangled in time series under sparsity, informing IDOL’s separation of instantaneous vs. delayed latent influences."
    },
    {
      "title": "CITRIS: Causal Identifiability from Temporal Intervened Sequences",
      "authors": "Phillip Lippe et al.",
      "year": 2022,
      "arxiv_id": "2202.03170",
      "role": "Gap Identification",
      "relationship_sentence": "CITRIS achieves identifiability of temporal causal latents with instantaneous relations but requires known interventions on latents, a key practicality gap IDOL closes by avoiding interventions."
    },
    {
      "title": "The Incomplete Rosetta Stone Problem: Identifiability Results for Multi-View Nonlinear ICA",
      "authors": "Alberto Gresele et al.",
      "year": 2021,
      "arxiv_id": "",
      "role": "Gap Identification",
      "relationship_sentence": "This work obtains identifiability through grouped/multi-view observations, highlighting the grouping requirement that IDOL circumvents by exploiting intrinsic temporal context instead."
    }
  ],
  "synthesis_narrative": "Time-Contrastive Learning showed that nonstationary time segments can serve as auxiliary variables to enable nonlinear ICA, crystallizing the sufficient variability notion for identifiability. Building on this, auxiliary-variable nonlinear ICA generalized the principle beyond time segmentation and provided a precise identifiability framework that ties context variability to the uniqueness of latent sources. The iVAE framework connected these identifiability conditions to practical learning by embedding auxiliary variables in a VAE objective via conditional exponential-family modeling. In time series causal discovery, DYNOTEARS introduced a sparse parameterization that jointly models instantaneous and lagged effects, showing how sparsity can recover mixed contemporaneous and temporal dependencies. Complementarily, PCMCI established how to disentangle contemporaneous from lagged links under sparsity and time-ordering constraints using conditional independence testing. On the representation-learning side, CITRIS demonstrated that temporal causal latents, including instantaneous relations, can be identified if interventions on the latent variables are available, while multi-view nonlinear ICA results showed identifiability via grouped observations across views. Together, these works revealed a gap: identifiability of temporal latent causal processes with instantaneous dependence without relying on interventions or grouped observations. The present framework synthesizes auxiliary-variable identifiability with the sparsity insights from time-series causal discovery, leveraging intrinsic temporal context as the auxiliary signal and imposing a sparse influence constraint over instantaneous and lagged latent relations. This combination naturally enables identifiability and guides a temporally varying VAE-style estimator that is practical in real-world settings where interventions and grouping are unavailable.",
  "target_paper": {
    "title": "On the Identification of Temporal Causal Representation with Instantaneous Dependence",
    "authors": "Zijian Li, Yifan Shen, Kaitao Zheng, Ruichu Cai, Xiangchen Song, Mingming Gong, Guangyi Chen, Kun Zhang",
    "conference": "ICLR",
    "year": 2025,
    "presentation_type": "oral",
    "keywords": "Causal Representation Learning, Instantaneous Dependency, Identification",
    "abstract": "Temporally causal representation learning aims to identify the latent causal process from time series observations, but most methods require the assumption that the latent causal processes do not have instantaneous relations. Although some recent methods achieve identifiability in the instantaneous causality case, they require either interventions on the latent variables or grouping of the observations, which are in general difficult to obtain in real-world scenarios. To fill this gap, we propose an \\textbf{ID}entification framework for instantane\\textbf{O}us \\textbf{L}atent dynamics (\\textbf{IDOL}) by imposing a sparse influence constraint that the latent causal processes have sparse time-delayed and instantaneous relations. Specifically, we establish identifiability results of the latent causal process based on sufficient variability and the sparse influence constraint by employing contextual information of time series data. Based on these theories, we incorporate a temporally variat",
    "openreview_id": "2efNHgYRvM",
    "forum_id": "2efNHgYRvM"
  },
  "analysis_timestamp": "2026-01-06T19:47:48.522312"
}