{
  "prior_works": [
    {
      "title": "Learning Transferable Visual Models From Natural Language Supervision",
      "authors": "Alec Radford et al.",
      "year": 2021,
      "role": "Baseline",
      "relationship_sentence": "CLIP’s pairwise contrastive image–text alignment is the base training paradigm that this work departs from by replacing symmetric similarity in Euclidean space with asymmetric, compositional entailment objectives in hyperbolic space."
    },
    {
      "title": "Poincaré Embeddings for Learning Hierarchical Representations",
      "authors": "Maximilian Nickel et al.",
      "year": 2017,
      "role": "Foundation",
      "relationship_sentence": "This paper established hyperbolic geometry as a natural manifold for representing hierarchies with low distortion, which the present work leverages to structure image/box and caption/noun hierarchies for vision–language embedding."
    },
    {
      "title": "Hyperbolic Entailment Cones for Learning Hierarchical Embeddings",
      "authors": "Octavian-Eugen Ganea et al.",
      "year": 2018,
      "role": "Extension",
      "relationship_sentence": "The notion of asymmetric entailment modeled via hyperbolic cones directly informs this paper’s core idea of enforcing directional (box→image, noun→caption) entailment constraints within a hyperbolic embedding space."
    },
    {
      "title": "Order-Embeddings of Images and Language",
      "authors": "Ivan Vendrov et al.",
      "year": 2016,
      "role": "Inspiration",
      "relationship_sentence": "By introducing asymmetric order constraints for image–caption retrieval, this work inspired the present paper’s shift from symmetric similarity to entailment-based objectives, here generalized and strengthened in hyperbolic geometry and extended to compositional structures."
    },
    {
      "title": "ViLD: Open-Vocabulary Object Detection via Learning from Vision and Language Models",
      "authors": "Xiuye Gu et al.",
      "year": 2021,
      "role": "Gap Identification",
      "relationship_sentence": "ViLD showed how to derive region-level supervision from language but relied on Euclidean similarity without explicit hierarchical entailment; the current paper addresses this gap by enforcing hyperbolic, directional composition between object boxes and full-image semantics."
    },
    {
      "title": "Grounding DINO: Marrying DINO with Grounded Pre-Training for Open-Set Object Detection",
      "authors": "Shilong Liu et al.",
      "year": 2023,
      "role": "Related Problem",
      "relationship_sentence": "Grounding DINO operationalizes localized phrase grounding from captions, enabling this work’s practical pipeline of extracting nouns and corresponding boxes to instantiate the compositional hierarchy used by the hyperbolic entailment loss."
    }
  ],
  "synthesis_narrative": "The core innovation—compositional entailment learning in a hyperbolic vision–language space—emerges from unifying asymmetric semantic order with hierarchical geometry and modern contrastive pretraining. CLIP established the dominant pairwise contrastive formulation for aligning images and texts, but its symmetric Euclidean similarity overlooks the inherently hierarchical and directional nature of visual–linguistic concepts. Poincaré Embeddings introduced hyperbolic geometry as a principled space for low-distortion hierarchical representation, laying the geometric foundation this work adopts. Building on that, Hyperbolic Entailment Cones provided a concrete mechanism for modeling asymmetric entailment as directional constraints in hyperbolic space; this idea is extended here to multi-granular compositions (object boxes to images, nouns to captions). Order-Embeddings of Images and Language first brought asymmetric order to cross-modal learning, directly inspiring the move from similarity to entailment objectives that this paper generalizes to hyperbolic geometry and composes across parts and wholes. On the data side, ViLD demonstrated how language supervision can induce region-level signals but lacked explicit hierarchical entailment, motivating the present method’s shift to directional, hyperbolic composition. Finally, Grounding DINO supplies robust phrase grounding, making it feasible to automatically extract noun–box alignments that instantiate the hierarchical scaffolding required by the proposed hyperbolic entailment training. Together, these works directly converge to enable a hyperbolic, composition-aware entailment framework for vision–language representation learning.",
  "analysis_timestamp": "2026-01-06T23:09:26.602319"
}