{
  "prior_works": [
    {
      "title": "NeuS: Learning Neural Implicit Surfaces by Volume Rendering",
      "authors": "Wang et al.",
      "year": 2021,
      "role": "Foundation",
      "relationship_sentence": "ND-SDF adopts the NeuS SDF-based volume rendering formulation and normal computation as the underlying reconstruction pipeline on which its normal-deflection mechanism is defined."
    },
    {
      "title": "Volume Rendering of Neural Implicit Surfaces",
      "authors": "Yariv et al.",
      "year": 2021,
      "role": "Foundation",
      "relationship_sentence": "VolSDF’s principled link between SDFs, densities, and rendered normals provides the theoretical backbone that ND-SDF leverages to train with normal cues while preserving valid SDF geometry."
    },
    {
      "title": "Implicit Geometric Regularization for Learning Shapes",
      "authors": "Gropp et al.",
      "year": 2020,
      "role": "Foundation",
      "relationship_sentence": "IGR’s eikonal-based SDF regularization underpins ND-SDF’s surface learning, ensuring the learned normal-deflection field remains consistent with valid SDF geometry and smoothness."
    },
    {
      "title": "MonoSDF: Exploring Monocular Geometric Cues for Neural Implicit Surface Reconstruction",
      "authors": "Yu et al.",
      "year": 2023,
      "role": "Baseline",
      "relationship_sentence": "ND-SDF directly targets MonoSDF’s core limitation—uniformly enforcing monocular depth/normal priors—which can bias geometry; ND-SDF replaces this with a learned normal-deflection field that adaptively trusts or corrects priors per sample."
    },
    {
      "title": "UNISURF: Unifying Neural Implicit Surfaces and Radiance Fields for Multi-View Reconstruction",
      "authors": "Oechsle et al.",
      "year": 2021,
      "role": "Foundation",
      "relationship_sentence": "UNISURF established the implicit-surface-plus-rendering paradigm that ND-SDF follows, enabling supervision via rendered signals while operating on continuous surface normals."
    },
    {
      "title": "RegNeRF: Regularizing Neural Radiance Fields for View Synthesis from Sparse Inputs",
      "authors": "Niemeyer et al.",
      "year": 2022,
      "role": "Gap Identification",
      "relationship_sentence": "RegNeRF showed that external geometric priors can stabilize weakly constrained regions but applied them with fixed regularization; ND-SDF addresses this by learning a per-sample angular deflection that adaptively modulates prior influence."
    }
  ],
  "synthesis_narrative": "ND-SDF’s core idea—a learnable normal deflection field that measures and compensates for angular deviation between scene normals and prior normals—sits squarely on the neural implicit surface rendering lineage while directly addressing the pitfalls of prior-driven supervision. NeuS and VolSDF provide the essential foundation: they formalize how to render from SDFs and recover accurate surface normals within a differentiable pipeline, which ND-SDF uses to supervise and propagate its deflection signal while preserving SDF validity. IGR contributes the SDF regularization perspective (eikonal constraint) that ensures ND-SDF’s normals and deflection adjustments remain geometrically coherent and smooth.\n\nThe closest predecessor and primary baseline is MonoSDF, which demonstrated the promise of leveraging monocular depth/normal priors for indoor reconstruction but applied these priors uniformly across samples. This uniform enforcement can over-smooth detailed regions and bias geometry where priors are inaccurate—precisely the failure mode ND-SDF is designed to overcome. ND-SDF replaces fixed prior penalties with a learned deflection field that adapts trust in the priors per sample and per region, enabling smooth walls/floors while preserving fine geometric details. UNISURF further set the precedent for coupling implicit surfaces with rendering-based supervision, which ND-SDF follows to integrate deflection-aware normal supervision. Finally, RegNeRF’s use of external priors to stabilize reconstruction highlights the gap ND-SDF fills: instead of static weighting, ND-SDF learns the discrepancy itself (angular deflection), turning prior information from a rigid constraint into an adaptive, sample-specific guidance signal.",
  "analysis_timestamp": "2026-01-06T23:09:26.643841"
}