{
  "prior_works": [
    {
      "title": "Junction Tree Variational Autoencoder for Molecular Graph Generation",
      "authors": "Wengong Jin et al.",
      "year": 2018,
      "arxiv_id": "1802.04364",
      "role": "Gap Identification",
      "relationship_sentence": "JT-VAE’s reliance on a finite, pre-mined motif vocabulary directly motivates MAGNet’s shift to a motif-agnostic scaffold abstraction that labels atoms and bonds from full molecular context."
    },
    {
      "title": "MoLeR: Learning to Extend Molecular Scaffolds with Structural Motifs",
      "authors": "Michał Maziarz et al.",
      "year": 2021,
      "arxiv_id": null,
      "role": "Baseline",
      "relationship_sentence": "As a primary hierarchical motif-based baseline that assembles molecules from a mined motif set, MoLeR is the system MAGNet improves upon by eliminating motif vocabularies and instead assigning atom/bond types over scaffolds."
    },
    {
      "title": "Hierarchical Generation of Molecular Graphs using Structural Motifs",
      "authors": "Wengong Jin et al.",
      "year": 2020,
      "arxiv_id": null,
      "role": "Gap Identification",
      "relationship_sentence": "This hierarchical motif decoder highlights out-of-vocabulary substructure limits, which MAGNet addresses by factoring generation over motif-agnostic scaffolds and learning context-aware label assignments."
    },
    {
      "title": "MoFlow: An Invertible Flow Model for Generating Molecular Graphs",
      "authors": "Chence Zang et al.",
      "year": 2020,
      "arxiv_id": null,
      "role": "Inspiration",
      "relationship_sentence": "MoFlow’s explicit factorization p(A)p(X|A) for molecular graphs inspires MAGNet’s novel factorization that conditions atom/bond typing on the entire scaffold topology."
    },
    {
      "title": "Bemis–Murcko Molecular Frameworks",
      "authors": "Gerard M. Bemis et al.",
      "year": 1996,
      "arxiv_id": null,
      "role": "Foundation",
      "relationship_sentence": "The Bemis–Murcko notion of scaffolds as skeletal topologies provides the foundational abstraction that MAGNet leverages to separate structure from chemical labels."
    },
    {
      "title": "LibINVENT: Reaction-Based Generative Scaffold Decoration",
      "authors": "Jordi Arús-Pous et al.",
      "year": 2021,
      "arxiv_id": null,
      "role": "Foundation",
      "relationship_sentence": "LibINVENT formalizes scaffold-conditioned generation (decoration) as a task, which MAGNet generalizes from template-driven string models to motif-agnostic, graph-level labeling of scaffolds."
    },
    {
      "title": "DeLinker: A Generative Model for Fragment Linking",
      "authors": "Tom S. Imrie et al.",
      "year": 2020,
      "arxiv_id": null,
      "role": "Related Problem",
      "relationship_sentence": "DeLinker establishes scaffold/fragment-conditioned molecular completion in 3D; MAGNet adopts the scaffold-conditional stance but performs 2D, vocabulary-free atom/bond assignment over arbitrary scaffolds."
    }
  ],
  "synthesis_narrative": "Junction Tree VAE demonstrated that composing molecules from a pre-mined vocabulary of substructures dramatically stabilizes generation, but its fixed motif inventory inherently blocks unseen chemistry. Follow-on hierarchical motif models extended this idea, decoding molecules at the motif level while explicitly acknowledging out-of-vocabulary limitations when encountering novel substructures. MoLeR positioned scaffold extension with structural motifs as a practical and scalable baseline, yet still anchored generation to a discrete fragment set mined from data. In parallel, MoFlow introduced an explicit factorization of molecular graph generation into topology followed by conditional feature assignment, showing that atom and bond types can be learned effectively given a structural context. Outside strictly graph-based models, Bemis–Murcko molecular frameworks crystallized the notion of a scaffold as the topology divorced from chemical labels, while scaffold decoration systems like LibINVENT and fragment-linking approaches such as DeLinker formalized scaffold-conditioned completion as a viable design task, albeit typically with templates or string/3D-specific machinery. \n\nTaken together, these works reveal a clear opportunity: keep the strong inductive bias of operating on higher-level structure, but remove the bottleneck of fixed fragment vocabularies by separating unlabeled topology from chemical labels and learning the latter from full-graph context. MAGNet synthesizes the MoFlow-style conditional factorization with the Bemis–Murcko scaffold abstraction and the scaffold-conditioned task setup of LibINVENT/DeLinker, while directly addressing the motif vocabulary gap highlighted by JT‑VAE, hierarchical motif decoders, and MoLeR by assigning atom and bond types over arbitrary scaffolds in a motif-agnostic manner.",
  "target_paper": {
    "title": "MAGNet: Motif-Agnostic Generation of Molecules from Scaffolds",
    "authors": "Leon Hetzel, Johanna Sommer, Bastian Rieck, Fabian J Theis, Stephan Günnemann",
    "conference": "ICLR",
    "year": 2025,
    "presentation_type": "spotlight",
    "keywords": "graph generative models, 2d molecules",
    "abstract": "Recent advances in machine learning for molecules exhibit great potential for facilitating drug discovery from in silico predictions.\nMost models for molecule generation rely on the decomposition of molecules into frequently occurring substructures (motifs), from which they generate novel compounds. \nWhile motif representations greatly aid in learning molecular distributions, such methods fail to represent substructures beyond their known motif set, posing a fundamental limitation for discovering novel compounds.\nTo address this limitation and enhance structural expressivity, we propose to separate structure from features by abstracting motifs to scaffolds and, subsequently, allocating atom and bond types. \nTo this end, we introduce a novel factorisation of the molecules' data distribution that considers the entire molecular context and facilitates learning adequate assignments of atoms and bonds to scaffolds. Complementary to this, we propose MAGNet, the first model to freely learn mo",
    "openreview_id": "5FXKgOxmb2",
    "forum_id": "5FXKgOxmb2"
  },
  "analysis_timestamp": "2026-01-06T16:04:17.093400"
}