{
  "prior_works": [
    {
      "title": "Diffusion Posterior Sampling",
      "authors": "Hyungjin Chung et al.",
      "year": 2023,
      "role": "Baseline",
      "relationship_sentence": "DPS formalized posterior sampling with diffusion priors by decomposing the posterior score into the prior score plus an intractable likelihood-guidance term; the present work directly targets this bottleneck by replacing DPS’s costly guidance estimation with a variational transition decomposition and midpoint guidance."
    },
    {
      "title": "Solving Inverse Problems with Score-Based Generative Models",
      "authors": "Jiaming Song et al.",
      "year": 2021,
      "role": "Foundation",
      "relationship_sentence": "This paper established the use of pre-trained score models as Bayesian priors for inverse problems and framed posterior sampling via score-based dynamics, a problem formulation the current work retains while redesigning the surrogate transitions."
    },
    {
      "title": "Diffusion Models Beat GANs on Image Synthesis",
      "authors": "Prafulla Dhariwal et al.",
      "year": 2021,
      "role": "Inspiration",
      "relationship_sentence": "Classifier guidance in this work popularized the decomposition of a conditional score into an unconditional prior score plus a log-likelihood gradient, which directly inspires the posterior-score decomposition (prior + guidance) that the present paper refines."
    },
    {
      "title": "Score-Based Generative Modeling through Stochastic Differential Equations",
      "authors": "Yang Song et al.",
      "year": 2020,
      "role": "Foundation",
      "relationship_sentence": "The reverse-time SDE/ODE framework and time-dependent prior scores underpin the surrogate diffusion targeted here; the proposed method preserves this backbone while altering the transitions to simplify guidance computation."
    },
    {
      "title": "Denoising Diffusion Restoration Models",
      "authors": "Bahjat Kawar et al.",
      "year": 2022,
      "role": "Related Problem",
      "relationship_sentence": "DDRM provides a diffusion-prior baseline for linear inverse problems without explicit guidance terms, highlighting a limitation (linearity/Gaussian assumptions) that the proposed approach overcomes while remaining in the posterior-sampling paradigm."
    },
    {
      "title": "Diffusion Schrödinger Bridge",
      "authors": "Valentin De Bortoli et al.",
      "year": 2021,
      "role": "Inspiration",
      "relationship_sentence": "The variational, path-measure view of guiding a diffusion to a target distribution in this work motivates the present paper’s variational decomposition of transitions and the idea of trading complexity between base prior dynamics and a corrective guidance."
    }
  ],
  "synthesis_narrative": "The core of “Variational Diffusion Posterior Sampling with Midpoint Guidance” is a new way to target the Bayesian posterior with diffusion priors by altering the reverse transitions so that the intractable guidance term becomes simpler, controllable, and numerically stable. This lineage begins with score-based diffusion foundations (Song et al., 2020), which provide the reverse-time dynamics and pre-trained time-dependent scores used as priors. Building on this, Song et al. (2021) concretized inverse problems with score priors, framing posterior sampling as operating on a surrogate diffusion whose score splits into two parts: a known prior score and a likelihood term. Dhariwal and Nichol (2021) popularized precisely this score decomposition in classifier guidance, directly inspiring the prior+guidance formulation adopted by posterior samplers.\nChung et al. (2023, DPS) then made this decomposition the central tool for diffusion posterior sampling, but exposed a practical roadblock: the likelihood-score term is typically intractable and expensive to estimate (often via Monte Carlo over latent variables). The present paper squarely targets that gap by proposing a variational decomposition of the reverse transitions and a midpoint guidance scheme that trades complexity from the guidance into the prior transitions. This mirrors, in spirit, variational path-measure ideas from Diffusion Schrödinger Bridges (De Bortoli et al., 2021), which redistribute modeling burden between base dynamics and corrective drifts. Finally, DDRM (Kawar et al., 2022) serves as a complementary baseline limited to linear degradations, underscoring the need for a general posterior-sampling approach that the proposed method delivers across linear and nonlinear settings.",
  "analysis_timestamp": "2026-01-06T23:09:26.627000"
}