{
  "prior_works": [
    {
      "title": "A Relational Event Framework for Social Action",
      "authors": "Carter T. Butts et al.",
      "year": 2008,
      "arxiv_id": null,
      "role": "Foundation",
      "relationship_sentence": "By formalizing dynamic networks as relational event point processes, this work provides the event-level representation that the proposed metric compares directly instead of snapshotting."
    },
    {
      "title": "DyRep: Learning Representations over Dynamic Graphs",
      "authors": "Rakshit Trivedi et al.",
      "year": 2019,
      "arxiv_id": null,
      "role": "Inspiration",
      "relationship_sentence": "DyRep’s continuous-time, marked-event modeling of dynamic graphs directly motivates treating temporal dependence as intrinsic to the metric rather than evaluating i.i.d. snapshots."
    },
    {
      "title": "Fused Gromov–Wasserstein Distances for Structured Objects",
      "authors": "Titouan Vayer et al.",
      "year": 2019,
      "arxiv_id": null,
      "role": "Extension",
      "relationship_sentence": "We extend the fused Gromov–Wasserstein principle of jointly aligning structure and attributes to yield a single scalar discrepancy that couples topology with features across time."
    },
    {
      "title": "NetLSD: Hearing the Shape of a Graph",
      "authors": "Maksim Tsitsulin et al.",
      "year": 2018,
      "arxiv_id": null,
      "role": "Baseline",
      "relationship_sentence": "NetLSD’s heat-trace signatures are a primary snapshot-based similarity our work replaces, highlighting the limits of per-slice comparisons that ignore event timing and dependence."
    },
    {
      "title": "DeltaCon: A Principled Massive-Graph Similarity Function",
      "authors": "Danai Koutra et al.",
      "year": 2013,
      "arxiv_id": null,
      "role": "Baseline",
      "relationship_sentence": "DeltaCon is a widely used scalar graph-similarity baseline for generative evaluation, whose snapshot application to dynamic graphs our metric supersedes by preserving temporal dependencies."
    },
    {
      "title": "GraphRNN: Generating Realistic Graphs with Deep Auto-regressive Models",
      "authors": "Jiaxuan You et al.",
      "year": 2018,
      "arxiv_id": "1802.08773",
      "role": "Gap Identification",
      "relationship_sentence": "GraphRNN popularized the multi-statistic MMD evaluation protocol for graph generators, whose lack of a unified scalar score we address in the dynamic-graph setting."
    },
    {
      "title": "Temporal Networks",
      "authors": "Petter Holme et al.",
      "year": 2012,
      "arxiv_id": null,
      "role": "Gap Identification",
      "relationship_sentence": "This survey pinpoints how aggregating or coarse snapshotting erases non-uniform temporal dynamics, the exact failure mode our metric is designed to avoid."
    }
  ],
  "synthesis_narrative": "Relational event modeling established that dynamic networks are best represented as sequences of timestamped interactions, where order and inter-event times carry essential information about the process generating edges and features. Building on this, continuous-time deep models like DyRep framed dynamic graphs as marked temporal point processes, demonstrating that temporality must be modeled explicitly rather than through independent snapshots. In parallel, optimal transport advances introduced fused Gromov–Wasserstein distances, which produce a single scalar by jointly aligning structural relations and node/edge attributes, showing a principled path to unify topology and features in one measure. Snapshot-based similarity tools such as NetLSD compress each static graph into a spectral heat-trace signature to enable efficient comparisons, and DeltaCon offers a fast scalar similarity sensitive to local structural changes; both have been adopted for evaluating generated graphs slice-by-slice. Finally, GraphRNN popularized a de facto evaluation suite built on multiple MMDs over handcrafted statistics, encoding practice but also fragmentation of quality assessment, while the temporal network literature highlighted that coarse discretization obscures non-uniform evolution.\nTaken together, these works reveal a clear gap: evaluations that either rely on per-snapshot similarities or multi-metric reports fail to capture continuous-time dependencies and do not offer a unified scalar that is sensitive to both structure and attributes. The present metric synthesizes the event-based view from relational/point-process modeling with OT-based joint alignment of structure and features, yielding a single temporally aware quality score that avoids snapshot i.i.d. assumptions while remaining comparable and interpretable across models.",
  "target_paper": {
    "title": "Quality Measures for Dynamic Graph Generative Models",
    "authors": "Ryien Hosseini, Filippo Simini, Venkatram Vishwanath, Rebecca Willett, Henry Hoffmann",
    "conference": "ICLR",
    "year": 2025,
    "presentation_type": "spotlight",
    "keywords": "generative models, dynamic graphs, evaluation metrics",
    "abstract": "Deep generative models have recently achieved significant success in modeling graph data, including dynamic graphs, where topology and features evolve over time. However, unlike in vision and natural language domains, evaluating generative models for dynamic graphs is challenging due to the difficulty of visualizing their output, making quantitative metrics essential. In this work, we develop a new quality metric for evaluating generative models of dynamic graphs. Current metrics for dynamic graphs typically involve discretizing the continuous-evolution of graphs into static snapshots and then applying conventional graph similarity measures. This approach has several limitations: (a) it models temporally related events as i.i.d. samples, failing to capture the non-uniform evolution of dynamic graphs; (b) it lacks a unified measure that is sensitive to both features and topology; (c) it fails to provide a scalar metric, requiring multiple metrics without clear superiority; and (d) it re",
    "openreview_id": "8bjspmAMBk",
    "forum_id": "8bjspmAMBk"
  },
  "analysis_timestamp": "2026-01-06T07:14:10.865578"
}