{
  "prior_works": [
    {
      "title": "Denoising Diffusion Probabilistic Models",
      "authors": "Ho et al.",
      "year": 2020,
      "role": "Foundation",
      "relationship_sentence": "The paper adopts the DDPM denoising framework and training objective as the core generative mechanism that enables realistic sequential synthesis between visits."
    },
    {
      "title": "Score-Based Generative Modeling through Stochastic Differential Equations",
      "authors": "Song et al.",
      "year": 2021,
      "role": "Foundation",
      "relationship_sentence": "The continuous-time SDE view directly enables generation across irregular time intervals; the proposed longitudinal “bridging” relies on this score-based formulation to condition on sparse observations over varying gaps."
    },
    {
      "title": "CSDI: Conditional Score-based Diffusion Models for Probabilistic Time Series Imputation",
      "authors": "Tashiro et al.",
      "year": 2021,
      "role": "Extension",
      "relationship_sentence": "This work provides the conditional diffusion architecture for time series that the authors extend to sequentially bridge long gaps and, crucially, to incorporate time-dependent ordinal-conditioning via an ordinal-regression objective."
    },
    {
      "title": "Time-series Generative Adversarial Networks",
      "authors": "Yoon et al.",
      "year": 2019,
      "role": "Baseline",
      "relationship_sentence": "TimeGAN is a primary synthetic longitudinal data baseline the paper aims to surpass, highlighting GAN limitations (instability, weak long-horizon fidelity, fixed grids) that diffusion-based bridging with ordinal control addresses."
    },
    {
      "title": "Latent ODEs for Irregularly-Sampled Time Series",
      "authors": "Rubanova et al.",
      "year": 2019,
      "role": "Gap Identification",
      "relationship_sentence": "While modeling continuous-time trajectories for irregular sampling, Latent ODEs tend to oversmooth and struggle with multi-modal long-interval dynamics—limitations the proposed diffusion-bridge approach is designed to overcome."
    },
    {
      "title": "Consistent Rank Logits for Ordinal Regression (CORAL)",
      "authors": "Cao et al.",
      "year": 2020,
      "role": "Inspiration",
      "relationship_sentence": "The method’s key innovation—conditioning on time-varying ordinal factors—draws directly on rank-consistent ordinal regression, which is adapted to guide the diffusion process with ordered clinical covariates (e.g., disease severity, age bins)."
    },
    {
      "title": "Uncovering the heterogeneity and temporal complexity of neurodegenerative diseases with Subtype and Stage Inference (SuStaIn)",
      "authors": "Young et al.",
      "year": 2018,
      "role": "Foundation",
      "relationship_sentence": "SuStaIn formalized disease severity as an ordered staging problem in neurodegeneration, motivating the paper’s formulation of disease progression control as ordinal conditioning during generation."
    }
  ],
  "synthesis_narrative": "The paper’s core innovation—sequentially bridging irregular longitudinal gaps with a conditional diffusion model guided by time-dependent ordinal factors—rests on two intertwined lines of work. First, DDPM and the SDE-based score-modeling framework laid the generative foundation: DDPM provides the denoising objective and noise schedule, while the SDE view enables principled conditioning across continuous time, which is essential for synthesis over irregular visit intervals. Building on that foundation, CSDI supplied the closest methodological precursor by showing how conditional score-based diffusion can impute time series given partial observations. The present work extends this paradigm from pointwise imputation to explicit longitudinal bridging across long gaps and, critically, augments the conditioning mechanism to respect ordered clinical covariates via an ordinal-regression objective. The need for such an approach is underscored by limitations in prior longitudinal generators: GAN-based TimeGAN struggles with stability and long-horizon fidelity, and continuous-time Latent ODEs often oversmooth and fail to capture multi-modal progression over large intervals. On the clinical side, SuStaIn’s staging perspective established disease severity as an inherently ordinal construct in neurodegeneration, directly motivating ordered conditioning. CORAL then provides the rank-consistent ordinal regression machinery that the authors repurpose to steer the diffusion trajectory with multiple time-varying ordinal factors (e.g., age and severity). Together, these works directly shape the paper’s design: a diffusion-based, ordinally guided bridge for realistic neurodegenerative disease progression synthesis.",
  "analysis_timestamp": "2026-01-06T23:09:26.641434"
}