{
  "prior_works": [
    {
      "title": "In Silico Prediction of Organic Structure–Directing Agents for the Synthesis of Zeolites",
      "authors": "Jan Daeyaert et al.",
      "year": 2019,
      "role": "Foundation",
      "relationship_sentence": "Established the computational problem formulation for OSDA–zeolite design via host–guest docking and binding-energy scoring, which OSDA Agent automates and closes the loop around with an LLM-driven planner."
    },
    {
      "title": "ReAct: Synergizing Reasoning and Acting in Language Models",
      "authors": "Shunyu Yao et al.",
      "year": 2023,
      "role": "Foundation",
      "relationship_sentence": "Introduced the interleaved reasoning-and-tool-use paradigm that OSDA Agent adopts in its Actor/Planner to decide when and how to call computational chemistry tools during iterative OSDA design."
    },
    {
      "title": "Toolformer: Language Models Can Teach Themselves to Use Tools",
      "authors": "Timo Schick et al.",
      "year": 2023,
      "role": "Inspiration",
      "relationship_sentence": "Demonstrated LLM-initiated API/tool invocation, directly inspiring OSDA Agent’s design to route from natural-language goals to domain calculators (e.g., docking/physics-based evaluation) for controllable molecule assessment."
    },
    {
      "title": "Self-referencing Embedded Strings (SELFIES): A 100% robust molecular string representation",
      "authors": "Mario Krenn et al.",
      "year": 2020,
      "role": "Foundation",
      "relationship_sentence": "Provided the robust molecular representation leveraged to keep LLM-driven edits and generations chemically valid, addressing the controllability issues the paper highlights for pure LLM generation."
    },
    {
      "title": "Molecular de novo design through deep reinforcement learning",
      "authors": "Marcus Olivecrona et al.",
      "year": 2017,
      "role": "Baseline",
      "relationship_sentence": "Serves as a primary single-objective, non-interactive molecular generation baseline that OSDA Agent surpasses by orchestrating multi-objective, tool-informed, interactive OSDA design."
    },
    {
      "title": "Junction Tree Variational Autoencoder for Molecular Graph Generation",
      "authors": "Wengong Jin et al.",
      "year": 2018,
      "role": "Baseline",
      "relationship_sentence": "Represents the prevalent standalone generative paradigm for molecules that lacks interactive planning or physics-grounded feedback, a gap OSDA Agent fills with an agentic, tool-coupled loop."
    },
    {
      "title": "Reflexion: Language Agents with Verbal Reinforcement Learning",
      "authors": "Noah Shinn et al.",
      "year": 2023,
      "role": "Extension",
      "relationship_sentence": "Introduced self-reflection for long-horizon improvement; OSDA Agent extends this idea to chemical design by using evaluator feedback (binding/physical constraints) to refine subsequent LLM proposals."
    }
  ],
  "synthesis_narrative": "OSDA Agent’s core contribution—an interactive LLM agent that plans, proposes, and validates organic structure-directing agents using computational chemistry tools—rests on two converging lineages. From the zeolite community, Daeyaert et al. formalized the OSDA design problem as host–guest optimization with docking and binding-energy scoring. This defined both the targets and evaluators that OSDA Agent now calls programmatically in a closed loop. From the AI side, ReAct established the reasoning–acting loop for LLMs, and Toolformer showed how models can initiate tool calls, together motivating OSDA Agent’s Actor/Planner to decompose design goals and selectively invoke docking, force-field, or physicochemical calculators. SELFIES enabled robust text-based molecule generation, directly addressing the paper’s stated issue of LLM controllability by ensuring validity during edits and exploration. In contrast, conventional molecular generators such as REINVENT (deep RL) and Junction Tree VAE (structured generative modeling) serve as the baselines whose limitations—single-function, non-interactive search without grounded physical feedback—OSDA Agent overcomes by integrating live evaluators and iterative reasoning. Finally, Reflexion’s self-critique paradigm is extended to chemistry: OSDA Agent operationalizes reflection via evaluator feedback (binding energies, steric/charge constraints) to refine proposals over multi-step trajectories. Together, these works directly shaped the OSDA Agent’s problem framing, agent architecture, molecular representation, and evaluation-driven refinement cycle.",
  "analysis_timestamp": "2026-01-06T23:09:26.615730"
}