{
  "prior_works": [
    {
      "title": "Evolution Gym: A Large-Scale Benchmark for Evolving Soft Robots",
      "authors": "Bhatia et al.",
      "year": 2021,
      "arxiv_id": null,
      "role": "Baseline",
      "relationship_sentence": "Provides the standard co-design setup of voxelized soft bodies with PPO-trained controllers that this work directly extends by adding and jointly optimizing internal articulated rigid skeletons anchored to the soft tissues."
    },
    {
      "title": "Unshackling Evolution: Evolving Soft Robots with Multiple Materials",
      "authors": "Cheney et al.",
      "year": 2013,
      "arxiv_id": null,
      "role": "Foundation",
      "relationship_sentence": "Introduces multi-material voxel encodings and generative body representations for soft robots that are generalized here to a mixed rigid–elastic cell model capable of expressing endoskeletal structures."
    },
    {
      "title": "RoboGrammar: Graph Grammar for Terrain-Optimized Robot Design",
      "authors": "He et al.",
      "year": 2020,
      "arxiv_id": null,
      "role": "Gap Identification",
      "relationship_sentence": "Establishes grammar-based generation and control optimization of rigid, jointed morphologies, whose inability to represent deformable tissues is explicitly addressed by embedding jointed skeletons within soft bodies."
    },
    {
      "title": "Illuminating Search Spaces by Mapping Elites",
      "authors": "Mouret et al.",
      "year": 2015,
      "arxiv_id": null,
      "role": "Inspiration",
      "relationship_sentence": "Provides the quality-diversity paradigm for open-ended exploration that is used to navigate the high-dimensional design space of endoskeletal morphologies and discover diverse, high-performing body plans."
    },
    {
      "title": "Compositional Pattern Producing Networks: A Novel Abstraction for Development",
      "authors": "Stanley",
      "year": 2007,
      "arxiv_id": null,
      "role": "Inspiration",
      "relationship_sentence": "Demonstrates how continuous generative encodings yield coherent spatial material patterns, an idea adopted here by learning a continuous latent embedding that decodes into structured arrangements of rigid and elastic cells and joints."
    }
  ],
  "synthesis_narrative": "Work on evolving soft robots established voxelized multi-material bodies and co-evolved controllers as a tractable platform for morphology optimization; notably, Unshackling Evolution introduced generative encodings that map spatial coordinates to discrete material types, yielding coherent soft tissues that can be searched effectively. Evolution Gym scaled this paradigm, coupling PPO-trained controllers with evolutionary morphology search in a standardized benchmark of soft, jointless voxel agents. In parallel, the rigid-body community demonstrated that structured search spaces for articulated skeletons—exemplified by RoboGrammar’s graph-grammar designs—enable systematic exploration of jointed morphologies and RL-based control optimization, yet remain limited to rigid kinematics. Quality-diversity algorithms such as MAP-Elites showed that exploration strategies which prioritize diversity can illuminate large, deceptive design spaces and reliably surface multiple high-performing solutions. Underpinning several of these advances, compositional pattern producing networks illustrated how continuous generative encodings can produce coherent, discretized spatial layouts suitable for evolutionary search.\n\nTogether these lines of work exposed a clear opportunity: soft-robot co-design methods lacked jointed internal structure, while rigid co-design lacked deformable tissues. The success of generative encodings and QD search suggested a path to unify them—construct a representation that can continuously encode discrete rigid and soft subsystems and use open-ended search to explore it. Building on soft-voxel co-design pipelines and articulated-design insights, the current work synthesizes a continuous latent embedding that decodes endoskeletal robots—soft tissues anchored to internal jointed skeletons—then leverages RL and diversity-driven search to efficiently discover capable terrestrial morphologies.",
  "target_paper": {
    "title": "Generating Freeform Endoskeletal Robots",
    "authors": "Muhan Li, Lingji Kong, Sam Kriegman",
    "conference": "ICLR",
    "year": 2025,
    "presentation_type": "spotlight",
    "keywords": "co-design, agent design, robots, morphology, evolution, locomotion",
    "abstract": "The automatic design of embodied agents (e.g. robots) has existed for 31 years and is experiencing a renaissance of interest in the literature. To date however, the field has remained narrowly focused on two kinds of anatomically simple robots: (1) fully rigid, jointed bodies; and (2) fully soft, jointless bodies. Here we bridge these two extremes with the open ended creation of terrestrial endoskeletal robots: deformable soft bodies that leverage jointed internal skeletons to move efficiently across land. Simultaneous de novo generation of external and internal structures is achieved by (i) modeling 3D endoskeletal body plans as integrated collections of elastic and rigid cells that directly attach to form soft tissues anchored to compound rigid bodies; (ii) encoding these discrete mechanical subsystems into a continuous yet coherent latent embedding; (iii) optimizing the sensorimotor coordination of each decoded design using model-free reinforcement learning; and (iv) navigating this",
    "openreview_id": "awvJBtB2op",
    "forum_id": "awvJBtB2op"
  },
  "analysis_timestamp": "2026-01-06T09:23:27.390557"
}