{
  "prior_works": [
    {
      "title": "A Linear Non-Gaussian Acyclic Model for Causal Discovery (LiNGAM)",
      "authors": "Shohei Shimizu, Patrik O. Hoyer, Aapo Hyvärinen, Antti Kerminen",
      "year": 2006,
      "role": "Foundational identifiability of linear SCMs via non-Gaussianity",
      "relationship_sentence": "Established that linear acyclic SEMs are identifiable when disturbances are non-Gaussian, providing the core non-Gaussian insight that the present paper extends to the mixed setting with Gaussian noise and latent confounders."
    },
    {
      "title": "Estimation of linear non-Gaussian causal models in the presence of confounding latent variables (Latent LiNGAM)",
      "authors": "Patrik O. Hoyer, Shohei Shimizu, Aapo Hyvärinen, Antti Kerminen",
      "year": 2008,
      "role": "Introduced non-Gaussian identifiability with latent confounders",
      "relationship_sentence": "Showed how non-Gaussian latent confounders enable identification/estimation in linear models, which the present work generalizes by permitting Gaussian measurement noise and characterizing finite identifiability when the causal structure is unknown."
    },
    {
      "title": "Independent Component Analysis, A New Concept",
      "authors": "Pierre Comon",
      "year": 1994,
      "role": "ICA identifiability under non-Gaussian sources",
      "relationship_sentence": "Proved that mixing matrices are identifiable up to permutation and scaling when sources are non-Gaussian and not too numerous, directly underpinning the paper’s use of source separation, the confounders ≤ observed condition, and the n! permutation ambiguity."
    },
    {
      "title": "Characterization Problems in Mathematical Statistics (includes the Darmois–Skitovich theorem)",
      "authors": "A. M. Kagan, Yu. V. Linnik, C. R. Rao",
      "year": 1973,
      "role": "Key probabilistic tool for non-Gaussian identifiability",
      "relationship_sentence": "The Darmois–Skitovich characterization ensures that non-Gaussianity of independent components yields identifiability from linear mixtures, justifying the assumption that confounders have no Gaussian component."
    },
    {
      "title": "Identifiability of linear relations between variables subject to error",
      "authors": "Olav Reiersøl",
      "year": 1950,
      "role": "Early identifiability via non-Gaussian errors-in-variables",
      "relationship_sentence": "Showed that non-Gaussianity can restore identifiability in linear errors-in-variables models, foreshadowing the paper’s core idea that non-Gaussian confounders can overcome Gaussian noise to identify linear SCMs."
    },
    {
      "title": "Identifiability of noisy independent component analysis",
      "authors": "Jari Eriksson, Visa Koivunen",
      "year": 2004,
      "role": "Noisy ICA identifiability with additive Gaussian noise",
      "relationship_sentence": "Analyzed conditions under which additive Gaussian noise does not destroy ICA identifiability, supporting the paper’s claim that linear SCMs remain identifiable with Gaussian noise when sources (confounders) are non-Gaussian."
    },
    {
      "title": "Some further results on the identifiability of factor analysis",
      "authors": "Theodore W. Anderson, Herman Rubin",
      "year": 1956,
      "role": "Classical unidentifiability of Gaussian latent factor models",
      "relationship_sentence": "Demonstrated rotational indeterminacy in Gaussian factor/latent-variable models, providing the negative baseline (all-Gaussian unidentifiability) that the present paper contrasts with and refines."
    }
  ],
  "synthesis_narrative": "The paper’s contribution sits at the intersection of linear causal discovery, latent-variable identifiability, and independent component analysis (ICA). LiNGAM established that linear acyclic structural models are identifiable when errors are non-Gaussian, inaugurating the use of distributional asymmetries to break Markov-equivalence barriers. Latent LiNGAM extended this insight to models with unobserved confounders, showing that non-Gaussian latent factors can still render the system identifiable. The probabilistic backbone of these results traces to the Darmois–Skitovich theorem (Kagan–Linnik–Rao), which guarantees that non-Gaussian independent components are recoverable from linear mixtures, and to Comon’s ICA identifiability theory, which formalizes recovery of the mixing matrix up to permutation and scaling provided the number of sources does not exceed the number of observations.\n\nThe present paper integrates these strands and fills a key gap: it proves identifiability when some components are Gaussian—specifically, when additive noise is Gaussian but confounders are non-Gaussian—under a natural dimensionality condition (confounders ≤ observed) and with known causal structure. This relies on noisy-ICA identifiability (Eriksson–Koivunen), which shows that additive Gaussian noise does not undermine recovery of non-Gaussian sources. It also clarifies the failure mode in the all-Gaussian case, aligning with classic rotational indeterminacy in Gaussian factor analysis (Anderson–Rubin). Finally, by quantifying a finite n! model ambiguity when the causal structure is unknown, the paper makes precise the permutation indeterminacy inherited from ICA, and further contributes by analytically identifying the shared joint PDF of the confounders across this finite equivalence class.",
  "analysis_timestamp": "2026-01-06T23:42:48.080618"
}