{
  "prior_works": [
    {
      "title": "NerveNet: Learning Structured Policy Representations",
      "authors": "Tingwu Wang et al.",
      "year": 2018,
      "arxiv_id": null,
      "role": "Foundation",
      "relationship_sentence": "NerveNet introduced morphology-conditioned, topology-aware message passing for control policies, which BodyGen generalizes with self-attention to represent both robot design and control using a unified, lightweight topology-aware architecture."
    },
    {
      "title": "Learning to Control Self-Assembling Morphologies with Graph Neural Networks",
      "authors": "Deepak Pathak et al.",
      "year": 2019,
      "arxiv_id": null,
      "role": "Inspiration",
      "relationship_sentence": "This work demonstrated that policies operating over a changing body’s graph can adapt control to structural variations, directly inspiring BodyGen’s use of morphology-aware representations that remain valid as the design space changes."
    },
    {
      "title": "RoboGrammar: Graph Grammar for Terrain-Optimized Robot Design",
      "authors": "Allan Zhou et al.",
      "year": 2020,
      "arxiv_id": null,
      "role": "Gap Identification",
      "relationship_sentence": "RoboGrammar’s grammar-based combinatorial design search highlighted the inefficiency and decoupling between morphology generation and control, a core limitation BodyGen addresses with a joint topology-aware attention representation and balanced optimization signals."
    },
    {
      "title": "Evolution Gym: A Large-Scale Benchmark for Evolving Soft Robots",
      "authors": "Zhao et al.",
      "year": 2021,
      "arxiv_id": null,
      "role": "Foundation",
      "relationship_sentence": "Evolution Gym formalized the embodiment co-design problem with modular morphologies and RL control, providing the task setting and revealing the optimization inefficiency from combinatorial design and design-control entanglement that BodyGen targets."
    },
    {
      "title": "RUDDER: Return Decomposition for Delayed Rewards",
      "authors": "André Arjona-Medina et al.",
      "year": 2019,
      "arxiv_id": null,
      "role": "Inspiration",
      "relationship_sentence": "RUDDER’s idea of redistributing returns to reduce temporal credit assignment delay informs BodyGen’s temporal credit assignment mechanism that balances reward signals between morphology and control updates."
    },
    {
      "title": "Transform2Act: Learning a Transformer for Robot Control Across Morphologies",
      "authors": "Yifeng Jiang et al.",
      "year": 2021,
      "arxiv_id": null,
      "role": "Extension",
      "relationship_sentence": "By using self-attention to condition control on morphology, Transform2Act provides the architectural precedent that BodyGen extends into a topology-aware self-attention used not only for control but also to encode morphology for the design generator."
    }
  ],
  "synthesis_narrative": "Topology-conditioned control emerged as a key theme in prior work. NerveNet proposed graph-structured policies that explicitly pass messages along a robot’s body graph, showing that encoding morphology enables compact and generalizable control. Building on this, learning to control self-assembling morphologies with graph neural networks showed that as structures change, the same policy class can adapt online by leveraging graph-based communication among parts. In parallel, RoboGrammar introduced a graph grammar to generate valid robot topologies and coupled it to controller optimization, but its combinatorial search and decoupled pipeline exposed scalability and integration limits. Evolution Gym then crystallized embodiment co-design as a benchmark with modular morphologies and RL controllers, making clear the dual challenges of combinatorial design and the tight interdependence between morphology and control that slow optimization. Independently, RUDDER demonstrated that redistributing returns over time can dramatically improve temporal credit assignment in long-horizon RL. Finally, Transformer-based control across morphologies (e.g., Transform2Act) showed that self-attention can serve as a morphology-aware aggregator for control. Together, these works reveal that effective co-design needs (i) a morphology-aware yet lightweight representation that unifies design and control, and (ii) principled credit assignment to prevent one stage from dominating learning. BodyGen synthesizes these insights by using topology-aware self-attention to encode both body structure and control and by introducing temporal credit assignment to balance rewards between design and control, naturally addressing the efficiency bottlenecks highlighted by prior benchmarks and pipelines.",
  "target_paper": {
    "title": "BodyGen: Advancing Towards Efficient Embodiment Co-Design",
    "authors": "Haofei Lu, Zhe Wu, Junliang Xing, Jianshu Li, Ruoyu Li, Zhe Li, Yuanchun Shi",
    "conference": "ICLR",
    "year": 2025,
    "presentation_type": "spotlight",
    "keywords": "Reinforcement Learning",
    "abstract": "Embodiment co-design aims to optimize a robot's morphology and control policy simultaneously. \nWhile prior work has demonstrated its potential for generating environment-adaptive robots, this field still faces persistent challenges in optimization efficiency due to the (i) combinatorial nature of morphological search spaces and (ii) intricate dependencies between morphology and control.\nWe prove that the ineffective morphology representation and unbalanced reward signals between the design and control stages are key obstacles to efficiency.\nTo advance towards efficient embodiment co-design, we propose **BodyGen**, which utilizes (1) topology-aware self-attention for both design and control, enabling efficient morphology representation with lightweight model sizes; (2) a temporal credit assignment mechanism that ensures balanced reward signals for optimization. With our findings, BodyGen achieves an average **60.03%** performance improvement against state-of-the-art baselines. We provid",
    "openreview_id": "cTR17xl89h",
    "forum_id": "cTR17xl89h"
  },
  "analysis_timestamp": "2026-01-06T18:39:55.433507"
}