{
  "prior_works": [
    {
      "title": "AudioSet: An ontology and human-labeled dataset for audio events",
      "authors": "Jort F. Gemmeke et al.",
      "year": 2017,
      "arxiv_id": null,
      "role": "Gap Identification",
      "relationship_sentence": "As the dominant large-scale audio benchmark, AudioSet’s restricted accessibility (YouTube dependency) and limited bird-specific evaluation coverage are the explicit limitations BirdSet addresses by providing an open, larger, multi-label avian dataset with broad evaluation use cases."
    },
    {
      "title": "Overview of BirdCLEF 2021: Bird call identification in soundscapes",
      "authors": "Stefan Kahl et al.",
      "year": 2021,
      "arxiv_id": null,
      "role": "Foundation",
      "relationship_sentence": "BirdCLEF 2021 established the soundscape bird species recognition task, label definitions, and evaluation protocols that BirdSet consolidates and scales into a unified benchmark across multiple strongly labeled datasets."
    },
    {
      "title": "Xeno-canto: a global community-curated bird sound database",
      "authors": "Willem-Pier Vellinga et al.",
      "year": 2015,
      "arxiv_id": null,
      "role": "Foundation",
      "relationship_sentence": "Xeno-canto provides the open, species-labeled recordings that enable BirdSet’s near-complete species coverage and large-scale, weakly labeled training corpus."
    },
    {
      "title": "BirdNET: A deep learning solution for avian diversity monitoring",
      "authors": "Stefan Kahl et al.",
      "year": 2021,
      "arxiv_id": null,
      "role": "Inspiration",
      "relationship_sentence": "BirdNET showed the feasibility of training deep models at global bird-species scale from Xeno-canto/eBird weak labels, directly motivating BirdSet’s species-level taxonomy and aggregation while highlighting the need for a standardized, multi-label, cross-dataset benchmark."
    },
    {
      "title": "BirdVox-full-night: a large-scale dataset for avian flight call detection",
      "authors": "Vincent Lostanlen et al.",
      "year": 2018,
      "arxiv_id": null,
      "role": "Foundation",
      "relationship_sentence": "BirdVox-full-night supplies a strongly labeled, domain-shifted evaluation set (nocturnal flight calls) that BirdSet incorporates to test covariate shift and robustness across distinct acoustic regimes."
    },
    {
      "title": "The Bird Audio Detection Challenge: A benchmark for automatic bird audio detection",
      "authors": "Dan Stowell et al.",
      "year": 2019,
      "arxiv_id": null,
      "role": "Gap Identification",
      "relationship_sentence": "This challenge documented severe cross-dataset and device covariate shift in bird audio detection, directly motivating BirdSet’s diverse evaluation suite and explicit covariate-shift scenarios."
    },
    {
      "title": "PANNs: Large-Scale Pretrained Audio Neural Networks for Audio Pattern Recognition",
      "authors": "Qiuqiang Kong et al.",
      "year": 2020,
      "arxiv_id": "1912.10211",
      "role": "Baseline",
      "relationship_sentence": "PANNs exemplify the field’s dependence on AudioSet-pretrained models that BirdSet benchmarks against and seeks to supplant for avian tasks by enabling domain-specific large-scale pretraining and fair comparisons."
    }
  ],
  "synthesis_narrative": "A dominant thread in audio machine learning has been set by AudioSet, which defined large-scale ontology and training data but suffers from YouTube-link inaccessibility and limited bird-focused evaluation coverage, constraining reproducibility and ecological specificity. BirdCLEF 2021 operationalized the soundscape bird species identification problem with concrete label definitions and protocols, and its soundscapes provided strongly labeled, realistic evaluation material. The open Xeno-canto repository made possible species-labeled recordings at global scale, enabling near-complete taxonomic coverage and large, weakly labeled training sets. BirdNET demonstrated that deep networks can learn from these citizen-science recordings at continental and global scales, validating species-level taxonomies and weak supervision while revealing the absence of a standardized, multi-label, cross-dataset benchmark. BirdVox-full-night contributed a rigorously annotated, nocturnal flight-call corpus capturing a distinct acoustic regime crucial for robustness testing. The Bird Audio Detection Challenge further exposed severe cross-dataset and device-induced covariate shift, underscoring the need for benchmarks that explicitly probe generalization. Meanwhile, PANNs embodied the community’s reliance on AudioSet-pretrained models, suggesting a gap for domain-specific pretraining resources.\nTogether, these works point to an opportunity: aggregate open, species-labeled bird audio at global scale; align with BirdCLEF-style soundscape evaluation; include multiple strongly labeled sets spanning regimes like nocturnal flight calls; and design tasks that probe multi-label classification, covariate shift, and self-supervised learning. Building on Xeno-canto’s breadth and BirdCLEF’s protocols while addressing AudioSet’s accessibility limits and the domain-shift issues highlighted by BAD, a unified, large-scale avian benchmark naturally emerges, enabling fair comparisons to AudioSet-pretrained baselines and fostering reproducible progress in bioacoustic ML.",
  "target_paper": {
    "title": "BirdSet: A Large-Scale Dataset for Audio Classification in Avian Bioacoustics",
    "authors": "Lukas Rauch, Raphael Schwinger, Moritz Wirth, René Heinrich, Denis Huseljic, Marek Herde, Jonas Lange, Stefan Kahl, Bernhard Sick, Sven Tomforde, Christoph Scholz",
    "conference": "ICLR",
    "year": 2025,
    "presentation_type": "spotlight",
    "keywords": "audio classification, multi-label, dataset collection, bioacoustics",
    "abstract": "Deep learning (DL) has greatly advanced audio classification, yet the field is limited by the scarcity of large-scale benchmark datasets that have propelled progress in other domains. While AudioSet is a pivotal step to bridge this gap as a universal-domain dataset, its restricted accessibility and limited range of evaluation use cases challenge its role as the sole resource. Therefore, we introduce BirdSet, a large-scale benchmark data set for audio classification focusing on avian bioacoustics. BirdSet surpasses AudioSet with over 6,800 recording hours ($\\uparrow17\\%$) from nearly 10,000 classes ($\\uparrow18\\times$) for training and more than 400 hours ($\\uparrow7\\times$) across eight strongly labeled evaluation datasets. It serves as a versatile resource for use cases such as multi-label classification, covariate shift or self-supervised learning. We benchmark six well-known DL models in multi-label classification across three distinct training scenarios and outline further evaluati",
    "openreview_id": "dRXxFEY8ZE",
    "forum_id": "dRXxFEY8ZE"
  },
  "analysis_timestamp": "2026-01-06T16:34:15.515797"
}