{
  "prior_works": [
    {
      "title": "Investigating Model-Free Reinforcement Learning for Planning",
      "authors": "Arthur Guez et al.",
      "year": 2019,
      "arxiv_id": "1901.03559",
      "role": "Baseline",
      "relationship_sentence": "This work introduces the DRC agent on Sokoban and hypothesizes that a purely model-free system may exhibit planning-like behavior, providing both the architecture and central open claim that this paper probes mechanistically."
    },
    {
      "title": "Interpretability Beyond Feature Attribution: Quantitative Testing with Concept Activation Vectors (TCAV)",
      "authors": "Been Kim et al.",
      "year": 2018,
      "arxiv_id": "1711.11279",
      "role": "Extension",
      "relationship_sentence": "The paper adapts TCAV-style concept probes to identify planning-relevant concepts in the agent’s internal representations and quantify their influence on decisions."
    },
    {
      "title": "GAN Dissection: Visualizing and Understanding Generative Adversarial Networks",
      "authors": "David Bau et al.",
      "year": 2019,
      "arxiv_id": "1811.10597",
      "role": "Inspiration",
      "relationship_sentence": "The intervention methodology of manipulating internal units to induce targeted output changes directly inspires the paper’s causal tests that activating or ablating plan features alters action selection."
    },
    {
      "title": "Concept Bottleneck Models",
      "authors": "Pang Wei Koh et al.",
      "year": 2020,
      "arxiv_id": "2007.04612",
      "role": "Inspiration",
      "relationship_sentence": "This work motivates treating concepts as causal variables; the paper borrows the paradigm of intervening on concept representations to establish that inferred plan concepts causally mediate policy behavior."
    },
    {
      "title": "Value Iteration Networks",
      "authors": "Aviv Tamar et al.",
      "year": 2016,
      "arxiv_id": "1602.02867",
      "role": "Foundation",
      "relationship_sentence": "VIN formalizes differentiable planning computations on grid worlds, shaping the notion of planning signals (e.g., propagating future consequences via value maps) that the paper probes for inside a model-free agent."
    },
    {
      "title": "Imagination-Augmented Agents for Deep Reinforcement Learning",
      "authors": "Théophane Weber et al.",
      "year": 2017,
      "arxiv_id": "1707.06203",
      "role": "Related Problem",
      "relationship_sentence": "By establishing Sokoban as a planning benchmark and showing performance gains with extra test-time imagination, this work motivates the paper’s analysis of whether a model-free agent exhibits analogous planning-like benefits and internal plan formation."
    }
  ],
  "synthesis_narrative": "Guez et al. introduced the DRC agent and showed that a nominally model-free architecture can excel on Sokoban, raising the explicit possibility that such an agent might internally plan. Tamar et al. formalized differentiable planning via Value Iteration Networks, providing concrete computational primitives—like value propagation and rollout-like backups—against which internal signals can be conceptualized as planning computations in grid-based domains. Weber et al. demonstrated that explicit imagination modules improve performance on Sokoban and that more test-time computation can yield better behavior, connoting a planning-like scaling property for agents that simulate futures. Kim et al. developed TCAV, establishing concept-based linear probes that quantify whether human-interpretable concepts are present and influential in internal activations. Koh et al. introduced concept bottleneck models and emphasized interventions on concept variables to test causal mediation, framing concepts as manipulable causal factors. Bau et al. showed that targeted unit-level interventions can causally edit model behavior, validating intervention-based evidence of internal feature causality.\n\nTogether, these works expose a gap: strong external evidence of planning in model-free agents without mechanistic verification, interpretability methods for concept probing without causal confirmation in RL, and planning benchmarks that suggest test-time compute benefits. The paper synthesizes these strands by probing DRC’s representations for planning concepts, tracing plan formation consistent with value-propagation style computations, and applying causal interventions on the discovered plan features to demonstrate direct control over action choices. It further links the emergence of these internal plans to a planning-like benefit from added test-time computation, providing the mechanistic bridge between behavioral planning signatures and internal representations in a model-free agent.",
  "target_paper": {
    "title": "Interpreting Emergent Planning in Model-Free Reinforcement Learning",
    "authors": "Thomas Bush, Stephen Chung, Usman Anwar, Adrià Garriga-Alonso, David Krueger",
    "conference": "ICLR",
    "year": 2025,
    "presentation_type": "oral",
    "keywords": "reinforcement learning, interpretability, planning, probes, model-free, mechanistic interpretability, sokoban",
    "abstract": "We present the first mechanistic evidence that model-free reinforcement learning agents can learn to plan. This is achieved by applying a methodology based on concept-based interpretability to a model-free agent in Sokoban -- a commonly used benchmark for studying planning. Specifically, we demonstrate that DRC, a generic model-free agent introduced by [Guez et al. (2019)](https://arxiv.org/abs/1901.03559), uses learned concept representations to internally formulate plans that both predict the long-term effects of actions on the environment and influence action selection. Our methodology involves: (1) probing for planning-relevant concepts, (2) investigating plan formation within the agent's representations, and (3) verifying that discovered plans (in the agent's representations) have a causal effect on the agent's behavior through interventions. We also show that the emergence of these plans coincides with the emergence of a planning-like property: the ability to benefit from additio",
    "openreview_id": "DzGe40glxs",
    "forum_id": "DzGe40glxs"
  },
  "analysis_timestamp": "2026-01-06T09:25:35.522335"
}