{
  "prior_works": [
    {
      "title": "Towards Minimizing k-Submodular Functions",
      "authors": "Alfredo Huber et al.",
      "year": 2012,
      "role": "Foundation",
      "relationship_sentence": "This paper introduced k-submodularity and its lattice/domain structure; the present work’s k-multilinear extension is defined over exactly this domain, making Huber–Kolmogorov’s formulation the foundational problem setting the new framework operates on."
    },
    {
      "title": "Maximizing k-Submodular Functions",
      "authors": "Justin Ward et al.",
      "year": 2014,
      "role": "Foundation",
      "relationship_sentence": "Ward and Živný formulated the k-submodular maximization task and provided the first constant-factor algorithms, establishing the optimization objective our paper tackles while revealing the absence of a continuous relaxation approach that the current work supplies."
    },
    {
      "title": "Tight Approximation Bounds for k-Submodular Function Maximization",
      "authors": "Satoru Iwata et al.",
      "year": 2016,
      "role": "Gap Identification",
      "relationship_sentence": "Iwata–Tanigawa–Yoshida gave tight bounds for (mostly unconstrained) k-submodular maximization with combinatorial techniques, highlighting limitations under constraints; our multilinear-extension/Frank–Wolfe framework directly targets and improves constrained ratios (e.g., knapsack and matroid)."
    },
    {
      "title": "Optimal Approximation for the Submodular Welfare Problem in the Value Oracle Model",
      "authors": "Jan Vondrák et al.",
      "year": 2008,
      "role": "Inspiration",
      "relationship_sentence": "Vondrák pioneered using the multilinear extension over a product-of-simplices domain and continuous (greedy) trajectories; our k-multilinear extension generalizes this paradigm to k-label assignments, enabling continuous optimization for k-submodular objectives."
    },
    {
      "title": "Maximizing a Monotone Submodular Function Subject to a Matroid Constraint",
      "authors": "Gruia Calinescu et al.",
      "year": 2011,
      "role": "Inspiration",
      "relationship_sentence": "Calinescu–Chekuri–Pál–Vondrák established the multilinear extension and continuous greedy (Frank–Wolfe style) method; the present work directly generalizes that machinery to the k-submodular setting via a new k-multilinear extension and analogous ascent dynamics."
    },
    {
      "title": "Maximizing Non-monotone Submodular Functions via a Continuous Greedy Algorithm",
      "authors": "Moran Feldman et al.",
      "year": 2011,
      "role": "Extension",
      "relationship_sentence": "Feldman–Naor–Schwartz’s measured continuous greedy analysis for non-monotone submodular functions informs our non-monotone framework; we adapt its potential/monotonicity arguments to the k-multilinear extension to obtain the 1/3 approximations under matroid/knapsack."
    },
    {
      "title": "Submodular Function Maximization via the Multilinear Relaxation and Contention Resolution Schemes",
      "authors": "Chandra Chekuri et al.",
      "year": 2014,
      "role": "Extension",
      "relationship_sentence": "The contention-resolution scheme framework that couples multilinear relaxations with rounding under matroid/knapsack constraints guides our feasibility handling and rounding from k-multilinear solutions, enabling improved guarantees for constrained k-submodular maximization."
    }
  ],
  "synthesis_narrative": "The core innovation of this paper—defining a k-multilinear extension and building unified Frank–Wolfe/continuous-greedy frameworks for constrained k-submodular maximization—sits at the intersection of two lines of work. On the discrete side, Huber and Kolmogorov introduced k-submodularity and its domain, and Ward–Živný (followed by Iwata–Tanigawa–Yoshida) established the maximization problem and tight constant-factor algorithms, largely with combinatorial techniques. These works clarified the objective but left a conspicuous gap: the lack of a continuous relaxation analogous to the submodular multilinear extension, and weaker ratios for constrained cases (e.g., knapsack and matroid). On the continuous-optimization side, Vondrák’s submodular welfare result and Calinescu–Chekuri–Pál–Vondrák’s matroid work crystallized the multilinear extension and continuous greedy (Frank–Wolfe–style) ascent on product-of-simplices domains, while Feldman–Naor–Schwartz extended this methodology to non-monotone functions; Chekuri–Vondrák–Zenklusen then provided contention-resolution schemes to convert fractional solutions into feasible discrete ones under broad constraints. The present paper directly generalizes this continuous toolkit to the k-submodular domain by introducing a principled k-multilinear extension and proving key linearity/monotonicity properties that permit Frank–Wolfe–type updates and rounding under knapsack and matroid constraints. This design both explains and enables the step from prior 1/3 and 0.245 guarantees to 1/2 and 1/3, respectively, by importing the strongest multilinear-extension analyses into the previously discrete-only k-submodular setting.",
  "analysis_timestamp": "2026-01-06T23:09:26.621697"
}