{
  "prior_works": [
    {
      "title": "Sliced and Radon Variants of the Wasserstein Barycenter",
      "authors": "N. Bonneel, G. Peyré, J. Rabin, H. Talbot",
      "year": 2015,
      "role": "Introduced sliced optimal transport (SW) and Radon-based slicing to reduce high-dimensional OT to collections of 1D problems, establishing the computational paradigm that LSSOT builds on.",
      "relationship_sentence": "LSSOT adopts the core SW idea—projecting measures to 1D to exploit fast 1D OT—extending it to spherical data with geometry-preserving slices."
    },
    {
      "title": "Sliced Wasserstein Kernels for Probability Distributions",
      "authors": "S. Kolouri, S. R. Park, G. K. Rohde",
      "year": 2016,
      "role": "Showed how sliced projections can be aggregated to form efficient, positive-definite similarity measures, foreshadowing linear embeddings compatible with OT structure.",
      "relationship_sentence": "LSSOT leverages the insight that aggregates of 1D transport maps/distances can yield scalable metrics, but does so via an explicit linear L2 embedding on spherical slices."
    },
    {
      "title": "The Cumulative Distribution Transform and Its Inverse",
      "authors": "S. R. Park, S. Kolouri, G. K. Rohde",
      "year": 2018,
      "role": "Established a 1D linear optimal transport (LOT/CDT) embedding that maps probability densities into an L2 space where Euclidean distance equals W2, providing the key linearization used in LSSOT’s sliced embeddings.",
      "relationship_sentence": "LSSOT applies the CDT/LOT principle to each spherical slice so that comparing spherical measures reduces to L2 distances between their slice-wise linear OT embeddings."
    },
    {
      "title": "The Radon Cumulative Distribution Transform and Linear Classification of Images",
      "authors": "S. Kolouri, S. R. Park, M. Thorpe, D. Slepčev, G. K. Rohde",
      "year": 2019,
      "role": "Generalized CDT to higher dimensions via Radon slicing, proving that aggregating 1D LOT embeddings across directions yields efficient, deformation-linearizing representations.",
      "relationship_sentence": "LSSOT mirrors Radon-CDT’s strategy but replaces Euclidean lines with geometry-appropriate spherical slices to preserve intrinsic spherical structure."
    },
    {
      "title": "Optimal Transport on Riemannian Manifolds (including Spheres)",
      "authors": "Y.-H. Kim, R. J. McCann",
      "year": 2010,
      "role": "Provided theoretical foundations for OT with geodesic costs on curved manifolds such as spheres, clarifying metricity and map structure under manifold geometry.",
      "relationship_sentence": "LSSOT’s metric on spherical probability measures relies on manifold OT principles to ensure that slicing and embedding respect spherical geodesic structure."
    },
    {
      "title": "Spherical Sliced Wasserstein Distances",
      "authors": "X. Liu et al.",
      "year": 2023,
      "role": "Adapted the sliced OT paradigm to spherical domains by defining geometry-respecting spherical slices, enabling fast OT-like comparisons on the sphere.",
      "relationship_sentence": "LSSOT directly builds on spherical slicing constructions, replacing 1D OT distances on slices with linear LOT embeddings to gain both speed and an L2 metric structure."
    },
    {
      "title": "Stereographic Spherical Sliced Wasserstein Distances",
      "authors": "Y. Bai et al.",
      "year": 2024,
      "role": "Proposed stereographic projections to map spherical data to Euclidean space for sliced OT, improving practicality while approximating spherical geometry.",
      "relationship_sentence": "LSSOT leverages the stereographic-slicing idea as an alternative slicing mechanism and then applies linear OT embeddings to those slices to obtain a fast, geometry-aware metric."
    }
  ],
  "synthesis_narrative": "Linear Spherical Sliced Optimal Transport (LSSOT) fuses two lines of work: (i) slicing-based reductions of optimal transport and (ii) linear optimal transport embeddings. The sliced OT paradigm, crystallized by Bonneel et al., showed that projecting high-dimensional measures onto 1D lines makes OT computations fast and scalable; Kolouri et al. further demonstrated that aggregating these projections can yield efficient, kernelizable similarities. In parallel, the cumulative distribution transform (CDT/LOT) established that 1D probability measures admit an exact L2 embedding whose Euclidean distance equals the 2-Wasserstein distance, and Radon-CDT extended this idea by aggregating 1D LOT embeddings across directions for higher-dimensional data.\nRecent advances adapted slicing to spherical domains: spherical sliced Wasserstein defined geometry-respecting spherical slices, and stereographic spherical sliced Wasserstein leveraged stereographic projection to enable practical computations while approximating spherical geometry. These works, together with manifold OT theory (e.g., Kim–McCann) grounding geodesic costs on spheres, set the stage for LSSOT.\nLSSOT’s key contribution is to marry spherical slicing with the LOT embedding: it computes slice-wise linear OT embeddings of spherical distributions and aggregates them into an L2 representation that preserves intrinsic spherical geometry and yields a bona fide metric. This delivers a fast, scalable distance for spherical probability measures with theoretical metricity, paralleling Radon-CDT’s linearization but tailored to the sphere and informed by spherical/sereographic slicing schemes.",
  "analysis_timestamp": "2026-01-07T00:02:04.907597"
}