{
  "prior_works": [
    {
      "title": "Bypassing Kohn–Sham equations with machine learning",
      "authors": "F. Brockherde et al.",
      "year": 2017,
      "arxiv_id": null,
      "role": "Foundation",
      "relationship_sentence": "This work established that the nonlocal Hohenberg–Kohn map from external potential/density to energy can be learned, providing the foundational ML-for-functionals viewpoint that the current paper adopts while embedding it self-consistently in Kohn–Sham DFT."
    },
    {
      "title": "Nonlocal van der Waals density functional made simple",
      "authors": "O. A. Vydrov et al.",
      "year": 2010,
      "arxiv_id": null,
      "role": "Foundation",
      "relationship_sentence": "The VV10 formulation explicitly introduced nonlocal correlation via a density–density kernel, directly motivating the pursuit of a learned, scalable nonlocal XC mechanism that the present work realizes with graph-based interactions."
    },
    {
      "title": "Neural-network Kohn–Sham exchange–correlation potential and its derivative",
      "authors": "R. Nagai et al.",
      "year": 2019,
      "arxiv_id": null,
      "role": "Extension",
      "relationship_sentence": "This paper pioneered differentiating through the self-consistent Kohn–Sham loop to train XC models using only energy targets, a training strategy the current work extends to a nonlocal, equivariant graph-based functional."
    },
    {
      "title": "NeuralXC: A machine-learning framework for constructing exchange–correlation functionals",
      "authors": "S. Dick et al.",
      "year": 2020,
      "arxiv_id": null,
      "role": "Extension",
      "relationship_sentence": "NeuralXC’s atom-centered projections of the electron density into compact per-atom descriptors directly inspire the current paper’s nuclei-centered compression, which is generalized to SO(3)-equivariant features and coupled with message passing to encode nonlocality."
    },
    {
      "title": "Atomic cluster expansion: Complete and efficient basis for representing atomic environments",
      "authors": "R. Drautz",
      "year": 2019,
      "arxiv_id": null,
      "role": "Inspiration",
      "relationship_sentence": "ACE formalized atom-centered, spherical-harmonic tensor expansions that inform the paper’s SO(3)-equivariant, nuclei-centered representation of the electron density used as the graph node features."
    },
    {
      "title": "E(3)-equivariant graph neural networks for data-efficient and accurate interatomic potentials",
      "authors": "S. Batzner et al.",
      "year": 2022,
      "arxiv_id": "2101.03164",
      "role": "Inspiration",
      "relationship_sentence": "NequIP demonstrated scalable SO(3)-equivariant message passing to capture long-range anisotropic interactions, which the present work repurposes to propagate nonlocal XC information over density-derived atomic nodes."
    },
    {
      "title": "Pushing the frontiers of density functionals by solving the fractional electron problem",
      "authors": "J. Kirkpatrick et al.",
      "year": 2021,
      "arxiv_id": null,
      "role": "Gap Identification",
      "relationship_sentence": "DM21 showed the promise and limits of semilocal NN-XC functionals—strong local accuracy but persistent failures for nonlocal effects—explicitly motivating a move to learned nonlocal, symmetry-aware architectures."
    }
  ],
  "synthesis_narrative": "Machine learning for electronic structure first showed that the nonlocal Hohenberg–Kohn map can be approximated directly, as demonstrated by Brockherde et al., who learned energies and densities without explicit Kohn–Sham machinery. In parallel, Vydrov and Van Voorhis crystallized the importance of nonlocal correlation through explicit density–density kernels (VV10), underscoring that long-range interactions are essential yet difficult to encode with semilocal forms. Nagai, Akashi, and Sugino then embedded neural approximators into the self-consistent Kohn–Sham loop and differentiated through SCF, proving that XC models can be trained with only energy targets while remaining variationally consistent. NeuralXC introduced compact, atom-centered projections of the electron density, showing that per-atom density descriptors can drive learned XC corrections. Drautz’s atomic cluster expansion provided a principled SO(3)-structured, nuclei-centered tensor basis to represent fields around atoms efficiently. Building on this, NequIP established that SO(3)-equivariant message passing captures anisotropic, long-range interactions in a scalable way. Despite progress, DM21 revealed that even advanced semilocal NN-XC functionals still struggle with inherently nonlocal effects. Together, these works suggested an opportunity: compress the electron density into an SO(3)-equivariant, nuclei-centered representation (ACE/NeuralXC) and propagate information nonlocally via equivariant message passing (NequIP), while training the functional end-to-end through the SCF loop using only energy supervision (Nagai et al.). This synthesis naturally leads to a scalable, symmetry-respecting, nonlocal XC functional that can address the limitations exposed by DM21 and capture the long-range physics codified by VV10.",
  "target_paper": {
    "title": "Learning Equivariant Non-Local Electron Density Functionals",
    "authors": "Nicholas Gao, Eike Eberhard, Stephan Günnemann",
    "conference": "ICLR",
    "year": 2025,
    "presentation_type": "spotlight",
    "keywords": "Density Functional Theory, DFT, Functional, Exchange Correlation, XC, Equivariance, Graph Neural Network, Electron Density, Kohn-Sham DFT",
    "abstract": "The accuracy of density functional theory hinges on the approximation of non-local contributions to the exchange-correlation (XC) functional. To date, machine-learned and human-designed approximations suffer from insufficient accuracy, limited scalability, or dependence on costly reference data. To address these issues, we introduce Equivariant Graph Exchange Correlation (EG-XC), a novel non-local XC functional based on equivariant graph neural networks (GNNs). Where previous works relied on semi-local functionals or fixed-size descriptors of the density, we compress the electron density into an SO(3)-equivariant nuclei-centered point cloud for efficient non-local atomic-range interactions. By applying an equivariant GNN on this point cloud, we capture molecular-range interactions in a scalable and accurate manner. To train EG-XC, we differentiate through a self-consistent field solver requiring only energy targets. In our empirical evaluation, we find EG-XC to accurately reconstruct `",
    "openreview_id": "FhBT596F1X",
    "forum_id": "FhBT596F1X"
  },
  "analysis_timestamp": "2026-01-06T16:23:18.182370"
}