{
  "prior_works": [
    {
      "title": "Learning to Simulate Complex Physics with Graph Networks",
      "authors": "Sanchez-Gonzalez et al.",
      "year": 2020,
      "arxiv_id": "2002.09405",
      "role": "Foundation",
      "relationship_sentence": "This work established the paradigm of wrapping message-passing GNNs inside explicit time integrators to roll out spatiotemporal PDE dynamics, a structural template that PhyMPGN adopts and then augments with physics-encoded messages."
    },
    {
      "title": "Learning Mesh-Based Simulation with Graph Networks",
      "authors": "Pfaff et al.",
      "year": 2021,
      "arxiv_id": "2010.03409",
      "role": "Baseline",
      "relationship_sentence": "As the primary mesh-based GNN simulator baseline, it informs PhyMPGN’s mesh-centric message passing and rollout strategy while motivating PhyMPGN’s physics-encoding to overcome MGN’s data hunger and limited generalization to varying geometries and boundary conditions."
    },
    {
      "title": "Message Passing Neural PDE Solver",
      "authors": "Brandstetter et al.",
      "year": 2022,
      "arxiv_id": "2202.03376",
      "role": "Extension",
      "relationship_sentence": "By aligning message functions with discretized PDE stencils to improve stability and accuracy, this work directly inspires PhyMPGN’s design of physics-encoded messages and its tight coupling with numerical discretizations on irregular meshes."
    },
    {
      "title": "Physics-Informed Neural Networks: A Deep Learning Framework for Solving Forward and Inverse Problems Involving Nonlinear Partial Differential Equations",
      "authors": "Raissi et al.",
      "year": 2019,
      "arxiv_id": "1711.10561",
      "role": "Foundation",
      "relationship_sentence": "PINNs introduced training with PDE residuals and boundary/initial-condition penalties, which PhyMPGN brings into its message-passing updates to encode governing physics and reduce data requirements."
    },
    {
      "title": "Fourier Neural Operator for Parametric Partial Differential Equations",
      "authors": "Li et al.",
      "year": 2021,
      "arxiv_id": "2010.08895",
      "role": "Baseline",
      "relationship_sentence": "FNO serves as a core operator-learning baseline for PDE generalization across parameters, whose limitations on irregular meshes and complex boundary conditions motivate PhyMPGN’s graph-based, physics-encoded alternative."
    },
    {
      "title": "Physics-Informed Neural Operator for Learning Partial Differential Equations",
      "authors": "Li et al.",
      "year": 2021,
      "arxiv_id": "2111.03794",
      "role": "Extension",
      "relationship_sentence": "PINO’s coupling of operator networks with physics-residual losses directly informs PhyMPGN’s extension of physics-informed training to GNN-based spatial operators embedded within a time integrator."
    }
  ],
  "synthesis_narrative": "Message-passing simulators showed that local interactions on graphs can approximate spatial derivatives and, when wrapped in explicit integrators, yield long-horizon rollouts of complex dynamics on irregular domains; MeshGraphNets further specialized this to mesh-based PDE simulation, conditioning messages on geometry and boundaries. Message Passing Neural PDE Solver then aligned the learned messages with discrete PDE stencils, demonstrating that embedding discretization structure into message passing improves stability and accuracy while reducing data needs. In parallel, the neural-operator line framed PDE solution as learning a map between function spaces, with the Fourier Neural Operator delivering strong cross-parameter generalization but struggling with irregular meshes and intricate boundary conditions. Physics-Informed Neural Networks introduced training directly against PDE residuals and boundary/initial-condition penalties, and Physics-Informed Neural Operator showed that injecting these physics losses into operator learning substantially boosts data efficiency and reliability.\nBuilding on these threads, the opportunity emerged to marry graph-based simulators’ geometric flexibility with the data efficiency of physics-informed training and the structural stability of discretization-aware messages. The present work synthesizes these ideas by encoding PDE operators and boundary conditions directly into message functions, training with physics residuals, and integrating the GNN within a numerical time-marching scheme. This combination preserves mesh generality and parameter robustness, while mitigating data hunger and improving extrapolation—naturally advancing the learned-simulator paradigm toward reliable spatiotemporal PDE modeling under irregular meshes, complex boundaries, and diverse coefficients.",
  "target_paper": {
    "title": "PhyMPGN: Physics-encoded Message Passing Graph Network for spatiotemporal PDE systems",
    "authors": "Bocheng Zeng, Qi Wang, Mengtao Yan, Yang Liu, Ruizhi Chengze, Yi Zhang, Hongsheng Liu, Zidong Wang, Hao Sun",
    "conference": "ICLR",
    "year": 2025,
    "presentation_type": "spotlight",
    "keywords": "Physics-encoded; Spatiotemporal PDEs; Graph Network; Deep Learning;",
    "abstract": "Solving partial differential equations (PDEs) serves as a cornerstone for modeling complex dynamical systems. Recent progresses have demonstrated grand benefits of data-driven neural-based models for predicting spatiotemporal dynamics (e.g., tremendous speedup gain compared with classical numerical methods). However, most existing neural models rely on rich training data, have limited extrapolation and generalization abilities, and suffer to produce precise or reliable physical prediction under intricate conditions (e.g., irregular mesh or geometry, complex boundary conditions, diverse PDE parameters, etc.). To this end, we propose a new graph learning approach, namely, Physics-encoded Message Passing Graph Network (PhyMPGN), to model spatiotemporal PDE systems on irregular meshes given small training datasets. Specifically, we incorporate a GNN into a numerical integrator to approximate the temporal marching of spatiotemporal dynamics for a given PDE system. Considering that many phys",
    "openreview_id": "fU8H4lzkIm",
    "forum_id": "fU8H4lzkIm"
  },
  "analysis_timestamp": "2026-01-06T18:12:33.576461"
}