{
  "prior_works": [
    {
      "title": "Logic and Conversation",
      "authors": "H. P. Grice",
      "year": 1975,
      "role": "Foundation",
      "relationship_sentence": "ImpScore’s core definition of implicitness as a gap between literal semantics and communicated meaning operationalizes Grice’s theory of conversational implicature."
    },
    {
      "title": "Thoughts and Utterances: The Pragmatics of Explicit Communication",
      "authors": "Robyn Carston",
      "year": 2002,
      "role": "Foundation",
      "relationship_sentence": "Carston’s explicature–implicature distinction directly motivates ImpScore’s use of (implicit, explicit) sentence pairs to instantiate and learn the semantic–pragmatic divergence."
    },
    {
      "title": "BLEURT: Learning Robust Metrics for Text Generation",
      "authors": "Thibault Sellam et al.",
      "year": 2020,
      "role": "Inspiration",
      "relationship_sentence": "BLEURT established the learnable, regression-based evaluator paradigm that ImpScore adopts to produce a scalar score aligned with human judgments, repurposed here to target implicitness rather than general text quality."
    },
    {
      "title": "COMET: A Neural Framework for MT Evaluation",
      "authors": "Ricardo Rei et al.",
      "year": 2020,
      "role": "Extension",
      "relationship_sentence": "COMET (and its QE variants) demonstrated training reference-free learned metrics via regression/ranking on human comparisons, a framework ImpScore extends to a new construct—implicitness—using contrastive training on implicit–explicit pairs."
    },
    {
      "title": "TransQuest: Translation Quality Estimation with Cross-lingual Transformers",
      "authors": "Tharindu Ranasinghe et al.",
      "year": 2020,
      "role": "Related Problem",
      "relationship_sentence": "TransQuest showed that reference-free, sentence-level scalar scoring can be learned effectively from supervision, informing ImpScore’s choice to build a reference-free metric for a specific property (implicitness)."
    },
    {
      "title": "Abductive Commonsense Reasoning",
      "authors": "Chandra Bhagavatula et al.",
      "year": 2020,
      "role": "Gap Identification",
      "relationship_sentence": "aNLI highlighted models’ weaknesses on inferences requiring unstated (implicit) information, underscoring the need for targeted measurement and motivating ImpScore’s explicit quantification of implicitness."
    },
    {
      "title": "Social Bias Frames: Reasoning about Social Implications of Language",
      "authors": "Maarten Sap et al.",
      "year": 2020,
      "role": "Gap Identification",
      "relationship_sentence": "By formalizing annotations of implied social meaning, Social Bias Frames exposed the difficulty of modeling implicit content and the absence of a general scalar metric to quantify it, a gap ImpScore addresses."
    }
  ],
  "synthesis_narrative": "ImpScore’s central idea—quantifying implicitness as the divergence between semantic content and pragmatic interpretation—traces directly to foundational pragmatics. Grice’s theory of conversational implicature provides the theoretical basis for treating what is said versus what is meant as separable, while Carston’s explicature–implicature framework sharpens this distinction and directly suggests pairing implicit utterances with explicit counterparts that articulate the communicated content. On the methodological side, the paper stands on the lineage of learned evaluation metrics. BLEURT established that pretrained encoders can be fine-tuned as regressors to yield scalar judgments aligned with human preferences, while COMET (especially its QE, reference-free variants) demonstrated effective training of such metrics using regression/ranking objectives without explicit references. TransQuest further reinforced that sentence-level, reference-free scalar prediction can be reliably learned, guiding ImpScore’s decision to adopt a reference-free, learnable scoring function. The problem impetus comes from persistent gaps in handling implicit content: Abductive Commonsense Reasoning (aNLI) and Social Bias Frames show that current systems struggle with unstated implications and social inferences, yet lack a principled, general-purpose metric to quantify how implicit a sentence is. ImpScore fuses these threads—Gricean/Carston pragmatics with learned, reference-free metric training—to deliver an interpretable, contrastively trained scalar measure of implicitness.",
  "analysis_timestamp": "2026-01-06T23:09:26.634372"
}