{
  "prior_works": [
    {
      "title": "UnitBox: An Advanced Object Detection Network",
      "authors": "Jiahui Yu et al.",
      "year": 2016,
      "arxiv_id": "1608.01471",
      "role": "Foundation",
      "relationship_sentence": "Established IoU-based regression as the training target for boxes, the exact objective this work rethinks by regressing only to the proposal–ground-truth intersection rather than the full ground-truth extent."
    },
    {
      "title": "Generalized Intersection over Union: A Metric and A Loss for Bounding Box Regression",
      "authors": "Hamid Rezatofighi et al.",
      "year": 2019,
      "arxiv_id": "1902.09630",
      "role": "Gap Identification",
      "relationship_sentence": "Addressed IoU’s zero-gradient for non-overlapping boxes by penalizing enclosure, yet still requires extrapolating beyond visible content—precisely the limitation remedied by restricting regression to the intersection region."
    },
    {
      "title": "Soft-NMS — Improving Object Detection With One Line of Code",
      "authors": "Navaneeth Bodla et al.",
      "year": 2017,
      "arxiv_id": "1704.04503",
      "role": "Gap Identification",
      "relationship_sentence": "Replaced hard suppression with score decay to mitigate winner-takes-all NMS, highlighting that valuable overlapping boxes contain complementary evidence that should be aggregated rather than suppressed."
    },
    {
      "title": "Weighted Boxes Fusion: Ensembling Boxes for Object Detection Models",
      "authors": "Roman Solovyev et al.",
      "year": 2019,
      "arxiv_id": "1910.13302",
      "role": "Inspiration",
      "relationship_sentence": "Showed that combining multiple overlapping detections by averaging coordinates improves localization, directly inspiring aggregation across boxes but motivating a union-based combination instead of averaging."
    },
    {
      "title": "Acquisition of Localization Confidence for Accurate Object Detection (IoU-Net)",
      "authors": "Borui Jiang et al.",
      "year": 2018,
      "arxiv_id": "1807.11590",
      "role": "Gap Identification",
      "relationship_sentence": "Predicted IoU to guide NMS and ranking, yet still ultimately selected a single box per region, underscoring the missed opportunity to fuse spatial support from multiple detections."
    },
    {
      "title": "End-to-End Object Detection with Transformers (DETR)",
      "authors": "Nicolas Carion et al.",
      "year": 2020,
      "arxiv_id": "2005.12872",
      "role": "Baseline",
      "relationship_sentence": "Embodied the query-based paradigm where each query regresses directly to a full ground-truth box under set prediction, providing the primary baseline whose regression target and winner-takes-all behavior are replaced by intersection regression and union aggregation."
    }
  ],
  "synthesis_narrative": "IoU-based regression made bounding-box training scale-invariant by optimizing overlap instead of independent side offsets, as introduced by UnitBox, while Generalized IoU extended this to non-overlapping cases by penalizing enclosure to recover gradients. However, both objectives still drive predictions toward the entirety of the ground-truth box, inherently requiring extrapolation beyond the visual support available to each proposal or query. On the post-processing side, Soft-NMS softened the hard winner-takes-all behavior of standard NMS by decaying scores rather than suppressing them outright, revealing that overlapping hypotheses carry complementary evidence worth retaining. IoU-Net further emphasized this by predicting an IoU quality score to better rank detections and guide NMS, yet it ultimately still chose a single box per region. In contrast, aggregation approaches such as Weighted Boxes Fusion demonstrated that merging multiple overlapping detections can yield more accurate localization than selecting just one, though their coordinate averaging does not explicitly preserve full spatial support. Meanwhile, DETR codified the modern query-based setup that regresses directly to full ground-truth boxes, reinforcing the full-extent regression assumption across architectures. Together, these works exposed two coupled opportunities: regression targets that force extrapolation degrade localization, and winner-takes-all selection discards useful spatial cues. The present work synthesizes these insights by regressing only to the proposal–ground-truth intersection to stay within visual scope and then aggregating across boxes via union, preserving the combined spatial support that Soft-NMS and fusion methods hinted was valuable but never explicitly realized.",
  "target_paper": {
    "title": "Union-over-Intersections: Object Detection beyond Winner-Takes-All",
    "authors": "Aritra Bhowmik, Pascal Mettes, Martin R. Oswald, Cees G. M. Snoek",
    "conference": "ICLR",
    "year": 2025,
    "presentation_type": "spotlight",
    "keywords": "localization based feature representation, intersection over union, object detection.",
    "abstract": "This paper revisits the problem of predicting box locations in object detection architectures. Typically, each box proposal or box query aims to directly maximize the intersection-over-union score with the ground truth, followed by a winner-takes-all non-maximum suppression where only the highest scoring box in each region is retained. We observe that both steps are sub-optimal: the first involves regressing proposals to the entire ground truth, which is a difficult task even with large receptive fields, and the second neglects valuable information from boxes other than the top candidate. Instead of regressing proposals to the whole ground truth, we propose a simpler approach—regress only to the area of intersection between the proposal and the ground truth. This avoids the need for proposals to extrapolate beyond their visual scope, improving localization accuracy. Rather than adopting a winner-takes-all strategy, we take the union over the regressed intersections of all boxes in a re",
    "openreview_id": "HqLHY4TzGj",
    "forum_id": "HqLHY4TzGj"
  },
  "analysis_timestamp": "2026-01-06T09:56:17.664865"
}