{
  "prior_works": [
    {
      "title": "Separate visual pathways for perception and action",
      "authors": "A. David Milner and Melvyn A. Goodale",
      "year": 1992,
      "arxiv_id": "",
      "role": "Foundation",
      "relationship_sentence": "By establishing distinct dorsal and ventral visual pathways with different functional goals, this work motivates a stream-specific decomposition and alignment analysis that the new method explicitly performs."
    },
    {
      "title": "A Reduced-Dimension fMRI Shared Response Model",
      "authors": "Po-Hsuan Chen et al.",
      "year": 2015,
      "arxiv_id": "",
      "role": "Inspiration",
      "relationship_sentence": "SRM’s idea of describing brain activity via a small set of shared latent components directly inspires using component-based representations, which the new work extends with sparsity and applies within cortical streams to align with DNNs."
    },
    {
      "title": "Sparse Principal Component Analysis",
      "authors": "Hui Zou et al.",
      "year": 2006,
      "arxiv_id": "",
      "role": "Extension",
      "relationship_sentence": "The sparse decomposition in this paper builds on SPCA-style objectives to extract sparse loading vectors, enabling interpretable components that reveal category-selective axes within each visual stream."
    },
    {
      "title": "Learning the parts of objects by non-negative matrix factorization",
      "authors": "Daniel D. Lee and H. Sebastian Seung",
      "year": 1999,
      "arxiv_id": "",
      "role": "Inspiration",
      "relationship_sentence": "NMF’s demonstration that sparse, parts-based factors yield interpretable visual features motivates seeking sparse component bases in neural data to uncover parts-like selectivity across streams."
    },
    {
      "title": "Representational similarity analysis – connecting the branches of systems neuroscience",
      "authors": "Nikolaus Kriegeskorte et al.",
      "year": 2008,
      "arxiv_id": "",
      "role": "Foundation",
      "relationship_sentence": "RSA provides the foundational framework for brain–model representational comparison that the new Sparse Component Alignment is designed to refine by operating over sparse, interpretable axes rather than undifferentiated representational dissimilarities."
    },
    {
      "title": "Similarity of neural network representations revisited",
      "authors": "Simon Kornblith et al.",
      "year": 2019,
      "arxiv_id": "1905.00414",
      "role": "Baseline",
      "relationship_sentence": "CKA is a primary baseline metric for comparing representations, and the new method is proposed to address CKA’s lack of component-level interpretability by aligning brains and DNNs along sparse components."
    },
    {
      "title": "Brain-Score: Which Artificial Neural Network for Object Recognition is Most Brain-Like?",
      "authors": "Martin Schrimpf et al.",
      "year": 2018,
      "arxiv_id": "",
      "role": "Baseline",
      "relationship_sentence": "Brain-Score’s global alignment benchmarks motivate the need for a fine-grained alternative, and the new approach targets this gap by quantifying stream- and component-specific alignment that global scores miss."
    }
  ],
  "synthesis_narrative": "Evidence that the visual system comprises distinct pathways for perception and action established that dorsal and ventral streams implement different computations, motivating analyses that respect stream-specific structure. Component-based models of fMRI, particularly the Shared Response Model, showed that brain responses can be captured by low-dimensional latent axes that summarize shared variance across subjects. In parallel, methods such as Sparse PCA and non-negative matrix factorization demonstrated that imposing sparsity yields parts-based, interpretable factors that map cleanly onto meaningful features in visual data. For comparing biological and artificial representations, representational similarity analysis provided a general geometry-based framework, and CKA offered a robust, widely used similarity measure for neural network representations. Large-scale benchmarks like Brain-Score then standardized global model–brain comparisons, emphasizing that single-task DNNs can predict neural responses surprisingly well but leaving open how alignment varies across pathways and along interpretable representational axes. Taken together, these works revealed both the feasibility and the limits of current practice: low-dimensional components can summarize brain activity, sparsity yields interpretability, and alignment metrics enable model–brain comparison, yet standard metrics average over dimensions and ignore pathway structure. The natural next step is to learn sparse, interpretable components within each visual stream and to assess alignment along these axes. By combining SRM-like componentization with sparsity principles from SPCA/NMF and embedding them in an alignment framework that refines RSA/CKA, the new approach isolates pathway-specific components and quantifies how DNNs align with those components, resolving the mismatch between global alignment and functional specialization.",
  "target_paper": {
    "title": "Sparse components distinguish visual pathways & their alignment to neural networks",
    "authors": "Ammar I Marvi, Nancy Kanwisher, Meenakshi Khosla",
    "conference": "ICLR",
    "year": 2025,
    "presentation_type": "spotlight",
    "keywords": "visual representations, alignment, sparse decomposition, neural pathways, brain and machine vision",
    "abstract": "The ventral, dorsal, and lateral streams in high-level human visual cortex are implicated in distinct functional processes. Yet, deep neural networks (DNNs) trained on a single task model the entire visual system surprisingly well, hinting at common computational principles across these pathways. To explore this inconsistency, we applied a novel sparse decomposition approach to identify the dominant components of visual representations within each stream. Consistent with traditional neuroscience research, we find a clear difference in component response profiles across the three visual streams—identifying components selective for faces, places, bodies, text, and food in the ventral stream; social interactions, implied motion, and hand actions in the lateral stream; and some less interpretable components in the dorsal stream. Building on this, we introduce Sparse Component Alignment (SCA), a new method for measuring representational alignment between brains and machines that better capt",
    "openreview_id": "IqHeDe2lbl",
    "forum_id": "IqHeDe2lbl"
  },
  "analysis_timestamp": "2026-01-06T07:35:09.269617"
}