{
  "prior_works": [
    {
      "title": "Learning Transferable Visual Models From Natural Language Supervision",
      "authors": "Alec Radford et al.",
      "year": 2021,
      "role": "Foundation",
      "relationship_sentence": "CLIP established contrastive vision–language pretraining for zero-shot recognition, the core paradigm RASO adopts to endow surgical object recognition with open-set, text-driven capabilities using weak tag–image–text supervision."
    },
    {
      "title": "HowTo100M: Learning a Text-Video Embedding by Watching Hundred Million Narrated Video Clips",
      "authors": "Antoine Miech et al.",
      "year": 2019,
      "role": "Foundation",
      "relationship_sentence": "HowTo100M demonstrated that large-scale narrated instructional videos and ASR transcripts enable scalable weak supervision, directly motivating RASO’s use of surgical lecture videos as a massive weakly-labeled source."
    },
    {
      "title": "End-to-End Learning of Visual Representations from Uncurated Instructional Videos",
      "authors": "Antoine Miech et al.",
      "year": 2020,
      "role": "Extension",
      "relationship_sentence": "MIL-NCE introduced robust learning from noisy narration–video pairs via contrastive objectives, informing RASO’s strategies for filtering and aligning noisy lecture narrations to produce reliable tag–image–text pairs."
    },
    {
      "title": "Recognize Anything: A Strong Image Tagging Model",
      "authors": "X. Zhang et al.",
      "year": 2023,
      "role": "Inspiration",
      "relationship_sentence": "RAM showed that large-scale weakly supervised tag mining can train a universal image tagger; RASO explicitly adapts this ‘recognize anything’ tagging paradigm to the surgical domain with domain-specific tag mining from lectures."
    },
    {
      "title": "BLIP: Bootstrapping Language-Image Pre-training for Unified Vision-Language Understanding and Generation",
      "authors": "Junnan Li et al.",
      "year": 2022,
      "role": "Extension",
      "relationship_sentence": "BLIP’s bootstrapped filtering/curation of noisy web image–text data informed RASO’s design of a scalable pipeline that turns noisy lecture narrations into higher-quality tag–image–text supervision."
    },
    {
      "title": "EndoNet: A Deep Architecture for Surgical Workflow Recognition",
      "authors": "Andru P. Twinanda et al.",
      "year": 2016,
      "role": "Gap Identification",
      "relationship_sentence": "EndoNet (and the Cholec80 setting) relied on extensive manual annotations for tool/phase recognition; RASO directly addresses this limitation by replacing heavy supervision with a large-scale weakly supervised tagging pipeline."
    }
  ],
  "synthesis_narrative": "RASO’s core innovation—scalable weakly supervised vision–language pretraining for open-set recognition of surgical objects—sits at the intersection of two lines of work: learning from narrated instructional videos and universal image tagging for open-world recognition. CLIP provided the foundational formulation for zero-shot recognition via contrastive image–text pretraining, which RASO adopts to couple visual embeddings with surgical terminology. The narrated-video lineage, inaugurated at scale by HowTo100M and operationalized robustly with MIL-NCE, demonstrated that ASR transcripts from instructional content can supervise representation learning despite temporal and linguistic noise. RASO transposes this idea to the surgical domain, mining lecture videos to automatically construct tag–image–text pairs and using filtering/alignment strategies inspired by contrastive training on noisy pairs. On the recognition side, RAM showed that large, weakly mined tag corpora can yield powerful universal taggers; RASO directly adapts this ‘recognize anything’ paradigm to surgery, curating a domain vocabulary and leveraging tags as supervision to unlock open-set capabilities. BLIP’s bootstrapped curation of noisy web pairs further informs RASO’s scalable data pipeline, improving the quality of weak supervision. Finally, earlier supervised surgical systems such as EndoNet exposed the bottleneck of heavy manual annotation for tools and phases; RASO explicitly targets this gap by replacing costly labels with automatically generated tag–image–text supervision, enabling broad coverage across procedures and objects while delivering state-of-the-art zero-shot and supervised performance.",
  "analysis_timestamp": "2026-01-06T23:08:23.933661"
}