{
  "prior_works": [
    {
      "title": "Prediction of drug–target interaction networks from the integration of chemical and genomic spaces",
      "authors": "Yoshihiro Yamanishi et al.",
      "year": 2008,
      "role": "Foundation",
      "relationship_sentence": "This work formalized DTI by coupling chemical and protein similarity spaces, establishing the similarity-driven problem formulation that the paper’s similarity-aware evaluation explicitly quantifies and controls in train/test splits."
    },
    {
      "title": "Toward more realistic drug–target interaction predictions",
      "authors": "Tommi Pahikkala et al.",
      "year": 2015,
      "role": "Baseline",
      "relationship_sentence": "Introduced KronRLS and the KIBA scoring/dataset regime that became standard baselines; the new paper reevaluates such models under similarity-aware splits, showing that conventional (often random) splits inflate performance near high-similarity regions."
    },
    {
      "title": "DeepDTA: Deep Drug–Target Binding Affinity Prediction",
      "authors": "Hakime Öztürk et al.",
      "year": 2018,
      "role": "Baseline",
      "relationship_sentence": "A canonical deep baseline for DTA typically reported under random or weakly controlled splits; the paper targets this exact evaluation practice, revealing drop-offs on low-similarity samples and re-benchmarking DeepDTA under similarity-aware splits."
    },
    {
      "title": "MoleculeNet: A benchmark for molecular machine learning",
      "authors": "Zhenqin Wu et al.",
      "year": 2018,
      "role": "Inspiration",
      "relationship_sentence": "MoleculeNet popularized scaffold-based splitting to mitigate structure leakage, directly inspiring the paper’s central idea to make similarity an explicit axis of evaluation and to go beyond heuristics with an optimization-based split that matches desired similarity distributions."
    },
    {
      "title": "Evaluating Protein Transfer Learning with TAPE",
      "authors": "Roshan Rao et al.",
      "year": 2019,
      "role": "Inspiration",
      "relationship_sentence": "TAPE’s sequence-identity-aware splits for remote homology demonstrated protein-side similarity control; the paper generalizes this notion to DTA by jointly accounting for protein and compound similarity when constructing evaluation splits."
    },
    {
      "title": "Open Graph Benchmark: Datasets for Machine Learning on Graphs",
      "authors": "Weihua Hu et al.",
      "year": 2020,
      "role": "Related Problem",
      "relationship_sentence": "OGB standardized scaffold-based splits for molecular graphs, reinforcing that domain-specific similarity-aware splits are critical; the paper extends this principle with a formal optimization to achieve any target similarity distribution across drugs and targets."
    },
    {
      "title": "Therapeutics Data Commons: Machine Learning Datasets and Tasks for Drug Discovery and Development",
      "authors": "Kexin Huang et al.",
      "year": 2021,
      "role": "Gap Identification",
      "relationship_sentence": "TDC defined warm/cold drug/target/both splits for DTI/DTA, but these are coarse; the paper identifies this gap and proposes a similarity-aware evaluation framework that continuously controls and matches desired similarity distributions instead of discrete cold-start categories."
    }
  ],
  "synthesis_narrative": "The paper’s core contribution—a similarity-aware evaluation framework for drug–target affinity prediction—emerges directly from the lineage that defined similarity as central to DTI/DTA and from benchmarks that exposed the pitfalls of random splitting. Yamanishi et al. established the foundational formulation of DTI as learning across chemical and genomic similarity spaces, making similarity the natural axis for generalization. Building on that ecosystem, Pahikkala et al. (KronRLS/KIBA) and DeepDTA became standard baselines reported largely under random or weakly constrained splits; these practices created the precise overestimation the paper diagnoses when test samples resemble training data. Parallel advances in benchmarking emphasized similarity-aware evaluation: MoleculeNet popularized scaffold splits to reduce molecular structure leakage, while TAPE showed that stringent protein sequence-identity control is essential for assessing remote homology generalization. OGB further normalized scaffold-based splits across graph benchmarks, highlighting that domain-informed splits materially change conclusions. Yet TDC’s widely adopted warm/cold drug/target/both splits remain coarse, lacking continuous control over similarity distributions. The present work unifies and extends these threads: it explicitly quantifies compound and protein similarity, formulates train/test partitioning as an optimization problem to match any desired similarity profile, and re-benchmarks canonical DTA models to reveal their sharp degradation on low-similarity regimes—thereby addressing a critical gap left by heuristic or categorical split protocols.",
  "analysis_timestamp": "2026-01-06T23:09:26.642899"
}