{
  "prior_works": [
    {
      "title": "Passing messages between biological networks to refine predicted interactions (PANDA)",
      "authors": "Glass et al.",
      "year": 2013,
      "arxiv_id": null,
      "role": "Baseline",
      "relationship_sentence": "GeSubNet generalizes PANDA’s knowledge-integrating strategy by encoding curated gene-interaction networks with a GNN so that physical interactions explicitly constrain subtype-specific edge prediction."
    },
    {
      "title": "Estimating sample-specific regulatory networks (LIONESS)",
      "authors": "Kuijjer et al.",
      "year": 2019,
      "arxiv_id": null,
      "role": "Baseline",
      "relationship_sentence": "GeSubNet addresses LIONESS’s sample-specific network derivation from aggregate models by jointly learning a unified representation that yields subtype-specific networks while leveraging prior interaction knowledge."
    },
    {
      "title": "The joint graphical lasso for inverse covariance estimation across multiple classes",
      "authors": "Danaher et al.",
      "year": 2014,
      "arxiv_id": null,
      "role": "Foundation",
      "relationship_sentence": "GeSubNet operationalizes the joint estimation principle from the joint graphical lasso by learning a shared embedding that separates common from subtype-specific gene interactions across disease subtypes."
    },
    {
      "title": "Variational Deep Embedding: An Unsupervised and Generative Approach to Clustering (VaDE)",
      "authors": "Jiang et al.",
      "year": 2017,
      "arxiv_id": "1611.05148",
      "role": "Inspiration",
      "relationship_sentence": "GeSubNet adopts VaDE’s core idea of using a deep generative model with a discrete latent structure to discover disease subtypes directly from gene expression profiles."
    },
    {
      "title": "Variational Graph Auto-Encoders",
      "authors": "Kipf et al.",
      "year": 2016,
      "arxiv_id": "1611.07308",
      "role": "Extension",
      "relationship_sentence": "GeSubNet extends the VGAE concept of GNN-based node embeddings for edge reconstruction by conditioning the graph encoder on curated gene-interaction priors and coupling it with subtype embeddings for interaction prediction."
    },
    {
      "title": "Network-based stratification of tumor mutations",
      "authors": "Hofree et al.",
      "year": 2013,
      "arxiv_id": null,
      "role": "Foundation",
      "relationship_sentence": "GeSubNet builds on the NBS insight that integrating patient molecular profiles with interaction networks improves disease subtyping, unifying subtype discovery with interaction-aware graph representation learning."
    }
  ],
  "synthesis_narrative": "PANDA introduced a principled way to integrate prior biological interaction knowledge with gene expression to reconstruct regulatory networks, demonstrating that curated PPIs and motif data can anchor data-driven edge inference. LIONESS showed how to derive individualized networks from population-level reconstructions, providing a route toward context-specific interaction maps but relying on post hoc sample deconvolution rather than joint learning. The joint graphical lasso formalized simultaneous estimation of multiple related class-specific networks via shared structure, highlighting a need for representations that capture both common and condition-specific edges. VaDE established a deep generative framework in which a discrete latent variable discovers clusters directly from data, yielding robust unsupervised subtype discovery. Variational Graph Auto-Encoders demonstrated that GNN encoders can learn node embeddings whose inner products reconstruct graph edges, offering a flexible mechanism for link prediction conditioned on graph structure. Network-Based Stratification revealed that patient subtyping improves when molecular profiles are coupled to protein interaction networks, underscoring the value of network priors in stratification.\nTogether these works expose an opportunity: jointly discover disease subtypes while inferring subtype-specific gene interactions grounded in known physical networks. GeSubNet synthesizes VaDE-style generative subtyping with VGAE-inspired graph encoding, uses PANDA’s knowledge-integration principle to preserve physical interactions, and adopts the joint-estimation spirit of the graphical lasso to separate shared versus subtype-specific edges, thereby overcoming LIONESS’s post hoc limitation and NBS’s lack of gene-level interaction prediction.",
  "target_paper": {
    "title": "GeSubNet: Gene Interaction Inference for Disease Subtype Network Generation",
    "authors": "Ziwei Yang, Zheng Chen, Xin Liu, Rikuto Kotoge, Peng Chen, Yasuko Matsubara, Yasushi Sakurai, Jimeng Sun",
    "conference": "ICLR",
    "year": 2025,
    "presentation_type": "oral",
    "keywords": "Gene Functional Networks, Disease Subtypes, Bioinformatics",
    "abstract": "Retrieving gene functional networks from knowledge databases presents a challenge due to the mismatch between disease networks and subtype-specific variations. Current solutions, including statistical and deep learning methods, often fail to effectively integrate gene interaction knowledge from databases or explicitly learn subtype-specific interactions. To address this mismatch, we propose GeSubNet, which learns a unified representation capable of predicting gene interactions while distinguishing between different disease subtypes. Graphs generated by such representations can be considered subtype-specific networks. GeSubNet is a multi-step representation learning framework with three modules: First, a deep generative model learns distinct disease subtypes from patient gene expression profiles. Second, a graph neural network captures representations of prior gene networks from knowledge databases, ensuring accurate physical gene interactions. Finally, we integrate these two representa",
    "openreview_id": "ja4rpheN2n",
    "forum_id": "ja4rpheN2n"
  },
  "analysis_timestamp": "2026-01-06T12:10:49.066256"
}