{
  "prior_works": [
    {
      "title": "Investigating Causal Relations by Econometric Models and Cross-spectral Methods",
      "authors": "Clive W. J. Granger",
      "year": 1969,
      "role": "Foundation",
      "relationship_sentence": "AERCA’s core idea of discovering directed temporal dependencies is grounded in Granger’s formulation of causality in time series, which it explicitly learns and exploits for root cause analysis."
    },
    {
      "title": "Intervention Analysis with Applications to Economic and Environmental Problems",
      "authors": "George E. P. Box and George C. Tiao",
      "year": 1975,
      "role": "Foundation",
      "relationship_sentence": "AERCA’s definition of anomalies as interventions on the data-generating process directly builds on Box–Tiao’s intervention analysis view of shocks as exogenous perturbations to time series."
    },
    {
      "title": "Grouped graphical Granger modeling for gene networks",
      "authors": "Aurélie C. Lozano et al.",
      "year": 2009,
      "role": "Extension",
      "relationship_sentence": "AERCA extends sparse Granger causal discovery ideas exemplified by grouped-lasso VAR, but augments them by explicitly modeling the innovation (exogenous) distributions to enable root cause identification."
    },
    {
      "title": "Estimation of a Structural Vector Autoregression Model using Non-Gaussianity",
      "authors": "Aapo Hyvärinen et al.",
      "year": 2010,
      "role": "Inspiration",
      "relationship_sentence": "The insight that identification comes from the distributional properties of exogenous shocks in SVAR directly inspires AERCA’s strategy to model the normal distribution of exogenous variables and detect deviations as root causes."
    },
    {
      "title": "Neural Granger Causality",
      "authors": "Alex Tank et al.",
      "year": 2018,
      "role": "Baseline",
      "relationship_sentence": "AERCA builds on neural Granger causal discovery as a baseline capability, but goes beyond it by integrating causal discovery with explicit exogenous-noise modeling for root cause analysis."
    },
    {
      "title": "Causal Discovery with Attention-Based Convolutional Neural Networks",
      "authors": "Mehdi Nauta et al.",
      "year": 2019,
      "role": "Related Problem",
      "relationship_sentence": "TCDF informs AERCA’s causal discovery component, yet AERCA addresses TCDF’s limitation by linking discovered Granger causes to exogenous interventions to perform root cause identification."
    },
    {
      "title": "Graph Deviation Networks for Anomaly Detection in Multivariate Time Series",
      "authors": "Ailin Deng and Bryan Hooi",
      "year": 2021,
      "role": "Gap Identification",
      "relationship_sentence": "GDN highlights the gap of graph-based anomaly detection lacking causal directionality and root-cause attribution, which AERCA fills by discovering Granger-causal structure and attributing anomalies to deviating exogenous shocks."
    }
  ],
  "synthesis_narrative": "AERCA’s intellectual lineage fuses classic Granger causality with intervention-based views of anomalies and modern learnable causal discovery. The foundation is Granger’s 1969 definition of temporal causality, which AERCA explicitly learns among variables and then exploits for attribution. Box and Tiao’s intervention analysis provides the conceptual bridge to anomaly-centric reasoning: viewing irregular events as exogenous shocks to the generative mechanism. Building practical discovery machinery draws on sparse Granger frameworks such as Lozano et al.’s grouped-lasso VAR, which established identifiable, scalable Granger graph recovery in high dimensions. Hyvärinen et al.’s SVAR work is a key inspiration for AERCA’s core innovation: modeling the distributional properties of exogenous shocks. By characterizing the innovations under normal conditions, AERCA can flag departures as the sources of observed anomalies, paralleling the idea that non-Gaussian or distributional structure of shocks enables identification. Modern neural approaches—Tank et al.’s Neural Granger Causality and Nauta et al.’s TCDF—inform AERCA’s differentiable causal discovery component, but neither links discovered structure to exogenous-intervention deviations for root cause analysis. Finally, graph-based anomaly detectors like GDN expose a gap: they model dependencies for detection but lack causal direction and principled attribution. AERCA directly addresses this by jointly discovering Granger-causal structure and learning normal innovation distributions, enabling precise, causally grounded root cause identification.",
  "analysis_timestamp": "2026-01-06T23:09:26.589578"
}