{
  "prior_works": [
    {
      "title": "Anchor Graph Regularization for Large-Scale Semi-Supervised Learning",
      "authors": "Wei Liu, Junfeng He, Shih-Fu Chang",
      "year": 2010,
      "role": "Foundational bipartite-to-sample graph reconstruction",
      "relationship_sentence": "SIIHPC’s step that transforms partial bipartition (sample–prototype) information back into an original sample–sample similarity leverages the anchor-graph reconstruction idea of building dense affinities from a bipartite representation."
    },
    {
      "title": "Similarity Learning via Self-Representation",
      "authors": "Feiping Nie, Xiaoqian Wang, Heng Huang",
      "year": 2016,
      "role": "Graph-by-reconstruction paradigm without hard nonnegativity",
      "relationship_sentence": "The paper’s move to relax traditional nonnegative constraints and learn similarities through reconstruction is directly inspired by self-representation–based similarity learning that regularizes reconstruction coefficients instead of enforcing strict nonnegativity."
    },
    {
      "title": "Auto-Weighted Multiple Graph Learning: A Unified Framework for Multi-View Clustering",
      "authors": "Feiping Nie, Jing Li, Xuelong Li",
      "year": 2016,
      "role": "Consensus graph learning across views",
      "relationship_sentence": "SIIHPC recovers missing similarities by tying view-exclusive graphs to a shared consensus graph, a strategy rooted in auto-weighted multi-graph learning that fuses per-view structures into a common consensus topology."
    },
    {
      "title": "Partial Multi-View Clustering",
      "authors": "Xiaochun Cao, Changqing Zhang, Huazhu Fu, Si Liu",
      "year": 2014,
      "role": "Early IMVC baseline that ignores missing views",
      "relationship_sentence": "By highlighting the limitation of exploiting only observed samples in partial-view settings, this work motivates SIIHPC’s similarity-level imputation rather than discarding missing portions."
    },
    {
      "title": "Doubly Aligned Incomplete Multi-View Clustering (DAIMC)",
      "authors": "Zhao et al.",
      "year": 2016,
      "role": "Prototype/indicator–sharing IMVC formulation",
      "relationship_sentence": "SIIHPC departs from DAIMC-like single shared prototype/indicator assumptions by introducing hybrid prototype groups per view to better capture heterogeneous view structures."
    },
    {
      "title": "One-Pass Incomplete Multi-View Clustering (OPIMC)",
      "authors": "Zhao et al.",
      "year": 2016,
      "role": "Prototype-based IMVC with bipartite modeling of incomplete data",
      "relationship_sentence": "The paper generalizes the prototype-centric, bipartite formulation in OPIMC by reconstructing a sample-level similarity from partial bipartite links and extending to flexible, per-view hybrid prototypes for richer representation."
    }
  ],
  "synthesis_narrative": "SIIHPC’s core advances—similarity-level imputation tied to a cross-view consensus graph and intra-view hybrid-group prototypes—sit at the intersection of bipartite reconstruction, self-representation similarity learning, and multi-graph consensus principles. Anchor Graph Regularization established the practice of deriving dense sample–sample affinities from a compact bipartite representation, a blueprint SIIHPC uses to convert partial bipartition signals (due to missing views) back into a standard similarity graph. Complementing this, self-representation–based similarity learning showed that high-quality graphs can be learned via reconstruction with appropriate regularization rather than strict nonnegativity, motivating SIIHPC’s relaxation of nonnegative constraints to better fit real data geometry.\n\nOn the multi-view side, AMGL formalized learning a consensus structure from multiple view-specific graphs, directly informing SIIHPC’s mechanism that imputes missing similarities by coupling each view’s exclusive similarity to a shared consensus graph. Classic IMVC methods such as PVC, DAIMC, and OPIMC exposed two key limitations SIIHPC addresses: (i) they often ignore missing samples or rely only on observed pairs, and (ii) they typically enforce a single shared set of prototypes/cluster indicators across all views. SIIHPC remedies (i) by operating at the similarity level to recover unobserved relations via consensus-guided imputation, and tackles (ii) by introducing hybrid prototype groups within each view, enabling flexible, view-specific representation capacity while still aligning through a learned consensus graph. Together, these strands yield a simple yet effective IMVC pipeline that unifies reconstruction-driven graph learning with principled cross-view consensus and richer per-view prototyping.",
  "analysis_timestamp": "2026-01-07T00:02:04.911161"
}