{
  "prior_works": [
    {
      "title": "ℓp Row Sampling by Lewis Weights",
      "authors": "Michael B. Cohen et al.",
      "year": 2015,
      "arxiv_id": "1412.0583",
      "role": "Extension",
      "relationship_sentence": "The paper’s one-pass column-oriented sketches for underdetermined ℓp regression adapt the Lewis-weights/sensitivity framework to the dual ℓq constraints, effectively turning row-sampling ideas of Cohen–Peng into column/edge sampling for estimating ℓp flow costs."
    },
    {
      "title": "Spectral Sparsification in the Dynamic Streaming Model",
      "authors": "Michael Kapralov et al.",
      "year": 2014,
      "arxiv_id": null,
      "role": "Baseline",
      "relationship_sentence": "For p=2 (electrical flows), their dynamic-streaming sparsifiers give near-optimal space estimators of b^T L^+ b, serving as the p=2 baseline that the present work generalizes to all p and to underdetermined column-arrival regression beyond graphs."
    },
    {
      "title": "Spectral Sparsification in the Semi-Streaming Setting",
      "authors": "Jonathan A. Kelner et al.",
      "year": 2013,
      "arxiv_id": "1302.5550",
      "role": "Inspiration",
      "relationship_sentence": "The resparsify-on-arrival methodology for maintaining a small edge set while approximating quadratic energy inspires the paper’s one-pass maintenance of a small set of high-sensitivity columns/edges that preserves ℓp objective value."
    },
    {
      "title": "Low-Rank Approximation and Regression in Input Sparsity Time",
      "authors": "Kenneth L. Clarkson et al.",
      "year": 2013,
      "arxiv_id": "1207.6365",
      "role": "Gap Identification",
      "relationship_sentence": "This work’s sketch-and-solve methods address overdetermined (row-arrival) regression, and its inability to handle underdetermined column-arrival settings directly motivates the new dual-oriented streaming approach developed here."
    },
    {
      "title": "Atomic Decomposition by Basis Pursuit",
      "authors": "Scott S. Chen et al.",
      "year": 1998,
      "arxiv_id": null,
      "role": "Foundation",
      "relationship_sentence": "It formalizes the p=1 case (basis pursuit) of minimizing ||x||1 subject to Ax=b, which is a primary special case within the paper’s unified underdetermined ℓp regression/flow formulation."
    },
    {
      "title": "Electrical Flows, Laplacian Systems, and Faster Approximation of Maximum Flow in Undirected Graphs",
      "authors": "Paul Christiano et al.",
      "year": 2011,
      "arxiv_id": "1010.2921",
      "role": "Related Problem",
      "relationship_sentence": "By casting max flow and related problems through the lens of electrical (ℓ2) flows, this work motivates treating ℓp flows as a unifying objective across p and informs the paper’s focus on estimating optimal ℓp flow costs from edge streams."
    },
    {
      "title": "Graph Sketches: Sparsification, Spanners, and Subgraphs",
      "authors": "Kook Jin Ahn et al.",
      "year": 2012,
      "arxiv_id": null,
      "role": "Foundation",
      "relationship_sentence": "It establishes the edge-insertion streaming model and graph sketching primitives that underlie interpreting column-arrival matrices as graph streams when A is an incidence matrix."
    }
  ],
  "synthesis_narrative": "Lewis-weight sampling established that ℓp regression objectives can be preserved by selecting high-sensitivity rows, giving provable subspace embeddings and sample complexity guarantees tailored to p. Spectral sparsification in dynamic streams showed that one can maintain near-linear-size summaries of a graph that preserve quadratic energies b^T L^+ b, yielding accurate electrical-flow costs in small space even under adversarial edge updates. The semi-streaming resparsify-on-arrival technique refined this approach, repeatedly compressing edges based on leverage-like scores to keep sketches tiny while preserving energy. Sketch-and-solve regression in input-sparsity time demonstrated powerful one-pass linear-algebraic sketches, but crucially for overdetermined, row-arrival settings, leaving the dual, column-arrival regime unaddressed. Basis pursuit introduced the canonical ℓ1 minimization under linear constraints, anchoring the ℓp family’s underdetermined formulation. Electrical-flow methods connected ℓ2 energies with flow optimization and even max-flow approximations, highlighting ℓp norms as a common language for flows. Graph sketching works formalized the edge-insertion model and provided core primitives for maintaining flow-relevant summaries under streaming. Together, these works reveal both a methodological toolkit—sensitivity sampling, resparsification, and spectral sketching—and a gap: no one-pass method for underdetermined, column-arrival ℓp regression or general ℓp flows. The current paper synthesizes Lewis-weight style sensitivities in the dual ℓq space with resparsify-on-arrival ideas to maintain a small, one-pass column/edge summary that provably preserves optimal ℓp objective values, thereby extending spectral-style guarantees from p=2 to all p and unifying regression and flow estimation in the column-arrival streaming model.",
  "target_paper": {
    "title": "Streaming Algorithms For $\\ell_p$ Flows and $\\ell_p$ Regression",
    "authors": "Amit Chakrabarti, Jeffrey Jiang, David Woodruff, Taisuke Yasuda",
    "conference": "ICLR",
    "year": 2025,
    "presentation_type": "spotlight",
    "keywords": "Regression, Streaming, Online algorithms, Flows",
    "abstract": "We initiate the study of one-pass streaming algorithms for underdetermined $\\ell_p$ linear regression problems of the form\n  $$\n      \\min_{\\mathbf A\\mathbf x = \\mathbf b} \\lVert\\mathbf x\\rVert_p \\,, \\qquad \n      \\text{where } \\mathbf A \\in \\mathbb R^{n \\times d} \\text{ with } n \\ll d \\,,\n  $$\n  which generalizes basis pursuit ($p = 1$) and least squares solutions to\n  underdetermined linear systems ($p = 2$). We study the column-arrival\n  streaming model, in which the columns of $\\mathbf A$ are presented one by one in a\n  stream. When $\\mathbf A$ is the incidence matrix of a graph, this corresponds to an\n  edge insertion graph stream, and the regression problem captures $\\ell_p$\n  flows which includes transshipment ($p = 1$), electrical flows ($p = 2$), and\n  max flow ($p = \\infty$) on undirected graphs as special cases. Our goal is to\n  design algorithms which use space much less than the entire stream, which has\n  a length of $d$.\n\n  For the task of estimating the cost of the $\\ell",
    "openreview_id": "Kpjvm2mB0K",
    "forum_id": "Kpjvm2mB0K"
  },
  "analysis_timestamp": "2026-01-06T14:52:37.490159"
}