{
  "prior_works": [
    {
      "title": "Equivariant Diffusion for Molecule Generation in 3D",
      "authors": "Emiel Hoogeboom et al.",
      "year": 2022,
      "arxiv_id": "2203.17003",
      "role": "Extension",
      "relationship_sentence": "ShEPhERD directly extends this SE(3)-equivariant diffusion framework by co-diffusing not only atomic graphs and coordinates but also auxiliary 3D interaction fields (shape, electrostatics, and pharmacophores) within the same denoising process."
    },
    {
      "title": "E(n) Equivariant Graph Neural Networks",
      "authors": "Victor Garcia Satorras et al.",
      "year": 2021,
      "arxiv_id": "2102.09844",
      "role": "Foundation",
      "relationship_sentence": "ShEPhERD’s denoiser relies on an SE(3)/E(n)-equivariant message-passing backbone of the EGNN family to ensure rotational/translational equivariance when learning coupled updates for molecular coordinates and interaction representations."
    },
    {
      "title": "GeoDiff: A Geometric Diffusion Model for Molecular Conformation Generation",
      "authors": "Minkai Xu et al.",
      "year": 2022,
      "arxiv_id": "2203.02923",
      "role": "Related Problem",
      "relationship_sentence": "ShEPhERD adopts GeoDiff-style coordinate noise schedules and score parameterizations for stable SE(3)-equivariant denoising of 3D molecular structures, then augments them to simultaneously model interaction profiles."
    },
    {
      "title": "ROCS: Rapid Overlay of Chemical Structures",
      "authors": "Paul C. D. Hawkins et al.",
      "year": 2007,
      "arxiv_id": null,
      "role": "Baseline",
      "relationship_sentence": "The Gaussian shape-overlap similarity formalized by ROCS provides both a principal baseline and the concrete shape-similarity objective that ShEPhERD learns to match and conditions on during generation."
    },
    {
      "title": "Comparative Molecular Field Analysis (CoMFA): Effect of Shape on Binding of Steroids to Carrier Proteins",
      "authors": "Richard D. Cramer et al.",
      "year": 1988,
      "arxiv_id": null,
      "role": "Foundation",
      "relationship_sentence": "CoMFA’s explicit modeling of steric and electrostatic fields as 3D interaction determinants motivates ShEPhERD’s choice to learn and denoise shape and electrostatic potential representations jointly with structure."
    },
    {
      "title": "Pharmit: interactive exploration of chemical space using pharmacophores and shape",
      "authors": "Joseph L. Sunseri et al.",
      "year": 2016,
      "arxiv_id": null,
      "role": "Foundation",
      "relationship_sentence": "Pharmit’s formulation of directional pharmacophore constraints combined with shape-based screening directly informs ShEPhERD’s directional pharmacophore representation and the composed 3D similarity criteria used for conditioning/evaluation."
    },
    {
      "title": "DiffDock: Diffusion Steps, Twists, and Turns for Molecular Docking",
      "authors": "Alessandro Corso et al.",
      "year": 2023,
      "arxiv_id": "2210.01776",
      "role": "Inspiration",
      "relationship_sentence": "By showing that SE(3)-equivariant diffusion can be conditioned on 3D interaction context (protein pockets) to generate plausible ligand poses, DiffDock inspired ShEPhERD’s idea to condition generation on ligand-centric 3D interaction profiles."
    }
  ],
  "synthesis_narrative": "Equivariant diffusion for 3D molecules established that atoms, bonds, and coordinates can be modeled coherently under SE(3) symmetry, with Equivariant Diffusion for Molecule Generation in 3D providing a practical denoising framework that couples graph and coordinate generation. E(n) Equivariant Graph Neural Networks supplied the equivariant message-passing backbone that enables robust, rotation/translation-consistent updates in such models. GeoDiff refined score parameterization and noise scheduling for stable coordinate diffusion on molecular conformations, illustrating how 3D structures can be denoised effectively. In ligand-based discovery, ROCS formalized Gaussian shape-overlap as a fast, effective similarity function for identifying bioisosteres by aligning 3D shapes. Comparative Molecular Field Analysis (CoMFA) demonstrated that steric and electrostatic fields capture key interaction determinants, motivating the use of electrostatic potential fields alongside shape. Pharmit operationalized directional pharmacophore constraints and combined them with shape screening, highlighting the practical value of directional features for capturing specific interaction geometries. DiffDock showed that conditioning diffusion on 3D interaction context improves generative plausibility in protein-ligand settings, validating interaction-aware conditioning within an SE(3)-equivariant diffusion paradigm. Taken together, these works expose an opportunity: shape, electrostatics, and pharmacophores—long used as separate similarity functions—could be learned as a joint interaction profile within an equivariant generative model. Building on equivariant diffusion’s joint graph–coordinate denoising and the field-based insights from CoMFA/ROCS/Pharmit, the next step is to co-diffuse molecular structure with its interaction fields and to condition generation directly on desired 3D interaction profiles, thereby unifying ligand-based similarity objectives with modern equivariant generative modeling.",
  "target_paper": {
    "title": "ShEPhERD: Diffusing shape, electrostatics, and pharmacophores for bioisosteric drug design",
    "authors": "Keir Adams, Kento Abeywardane, Jenna Fromer, Connor W. Coley",
    "conference": "ICLR",
    "year": 2025,
    "presentation_type": "oral",
    "keywords": "3D molecular generation, drug design, molecules",
    "abstract": "Engineering molecules to exhibit precise 3D intermolecular interactions with their environment forms the basis of chemical design. In ligand-based drug design, bioisosteric analogues of known bioactive hits are often identified by virtually screening chemical libraries with shape, electrostatic, and pharmacophore similarity scoring functions. We instead hypothesize that a generative model which learns the joint distribution over 3D molecular structures and their interaction profiles may facilitate 3D interaction-aware chemical design. We specifically design ShEPhERD, an SE(3)-equivariant diffusion model which jointly diffuses/denoises 3D molecular graphs and representations of their shapes, electrostatic potential surfaces, and (directional) pharmacophores to/from Gaussian noise. Inspired by traditional ligand discovery, we compose 3D similarity scoring functions to assess ShEPhERD’s ability to conditionally generate novel molecules with desired interaction profiles. We demonstrate ShE",
    "openreview_id": "KSLkFYHlYg",
    "forum_id": "KSLkFYHlYg"
  },
  "analysis_timestamp": "2026-01-06T09:06:12.258302"
}