{
  "prior_works": [
    {
      "title": "Conditional Neural Processes",
      "authors": "Marta Garnelo et al.",
      "year": 2018,
      "arxiv_id": "1807.01613",
      "role": "Extension",
      "relationship_sentence": "RESuM pre-trains a Conditional Neural Process to summarize auxiliary simulation knowledge into a conditional function prior and uses that CNP output to inform the prior/mean of its Gaussian-process surrogate for rare-event responses."
    },
    {
      "title": "Predicting the Output from a Complex Computer Code when Fast Approximations are Available",
      "authors": "M. C. Kennedy and A. O'Hagan",
      "year": 2000,
      "arxiv_id": null,
      "role": "Foundation",
      "relationship_sentence": "RESuM adopts the Kennedy–O’Hagan autoregressive co-kriging framework as the backbone multi-fidelity Gaussian Process through which it fuses low- and high-fidelity simulations."
    },
    {
      "title": "Multi-fidelity Gaussian process regression for computer experiments",
      "authors": "Loïc Le Gratiet",
      "year": 2013,
      "arxiv_id": null,
      "role": "Extension",
      "relationship_sentence": "RESuM builds on Le Gratiet’s multi-fidelity GP regression formulation to model fidelity correlations and then augments that GP with a learned CNP-informed prior to improve data-efficiency in the rare-event regime."
    },
    {
      "title": "Deep Kernel Learning",
      "authors": "Andrew G. Wilson et al.",
      "year": 2016,
      "arxiv_id": "1511.02222",
      "role": "Inspiration",
      "relationship_sentence": "RESuM follows the deep-kernel learning principle of combining neural representations with GP inference by injecting a neural (CNP) prior into a GP to encode inductive bias from auxiliary simulations."
    },
    {
      "title": "Efficient Global Reliability Analysis for Nonlinear Implicit Performance Functions",
      "authors": "B. J. Bichon et al.",
      "year": 2008,
      "arxiv_id": null,
      "role": "Foundation",
      "relationship_sentence": "RESuM targets the reliability-based design objective formalized by EGRA—minimizing failure/rare-event probabilities with a kriging surrogate—while overcoming its data inefficiency via multi-fidelity modeling and learned priors."
    },
    {
      "title": "Estimation of small failure probabilities in high dimensions by Subset Simulation",
      "authors": "S. K. Au and J. L. Beck",
      "year": 2001,
      "arxiv_id": null,
      "role": "Gap Identification",
      "relationship_sentence": "RESuM addresses the computational burden highlighted by Subset Simulation for very small probabilities by learning a surrogate that generalizes across design parameters instead of re-estimating each design with massive sampling."
    },
    {
      "title": "AK-MCS: An Active Learning Reliability Method Combining Kriging and Monte Carlo Simulation",
      "authors": "B. Echard, N. Gayton, and M. Lemaire",
      "year": 2011,
      "arxiv_id": null,
      "role": "Baseline",
      "relationship_sentence": "RESuM improves over AK-MCS-style kriging estimators by replacing per-design adaptive sampling with a CNP-informed multi-fidelity GP that shares information across the design space for rare-event probability modeling."
    }
  ],
  "synthesis_narrative": "Autoregressive co-kriging established a principled way to couple low- and high-fidelity simulators, letting fast approximations inform expensive predictions through a Gaussian-process hierarchy. Subsequent multi-fidelity GP regression refinements clarified how to model cross-fidelity correlations and propagate uncertainty coherently across inputs and fidelities. In parallel, Conditional Neural Processes showed how to meta-learn task-specific function priors from context sets, enabling fast adaptation to new tasks by conditioning on small, noisy observations. Deep kernel learning demonstrated that neural representations can be fused with GP inference to encode rich inductive biases while retaining calibrated uncertainty. In reliability-based design, EGRA crystallized the objective of optimizing designs by minimizing failure (rare-event) probabilities using kriging surrogates, while classical variance-reduction strategies such as Subset Simulation and active-learning schemes like AK‑MCS highlighted the practical difficulty of estimating very small probabilities without prohibitive numbers of high-fidelity simulations.\nThese strands collectively exposed an opportunity: combine multi-fidelity surrogates that reduce cost with meta-learned priors that inject domain knowledge, specifically for design objectives defined by tiny probabilities. The natural next step is to condition a GP-based multi-fidelity surrogate on a neural prior learned from auxiliary simulations, so the model generalizes across designs and fidelities while remaining uncertainty-aware in the rare-event tail. By aligning CNP-conditioned priors with co-kriging structure, one can target reliability-style objectives with far fewer high-fidelity evaluations, directly addressing the data inefficiency that limits EGRA, Subset Simulation, and AK‑MCS in extreme rare-event regimes.",
  "target_paper": {
    "title": "RESuM: A Rare Event Surrogate Model for  Physics Detector Design",
    "authors": "Ann-Kathrin Schuetz, A.W.P. Poon, Aobo Li",
    "conference": "ICLR",
    "year": 2025,
    "presentation_type": "spotlight",
    "keywords": "surrogate model, simulation, rare event search, AI4Sci, AI for physics, conditional neural process, Bayesian methods, emulator, Multi-Fidelity Gaussian Process",
    "abstract": "The experimental discovery of neutrinoless double-beta decay (NLDBD) would answer one of the most important questions in physics: Why is there more matter than antimatter in our universe? To maximize the chances of discovery, NLDBD experiments must optimize their detector designs to minimize the probability of background events contaminating the detector. Given that this probability is inherently low, design optimization either requires extremely costly simulations to generate sufficient background counts or contending with significant variance. In this work, we formalize this dilemma as a Rare Event Design (RED) problem: identifying optimal design parameters when the design metric to be minimized is inherently small. We then designed the Rare Event Surrogate Model (RESuM) for physics detector design optimization under RED conditions. RESuM uses a pre-trained Conditional Neural Process (CNP) model to incorporate additional prior knowledge into a Multi-Fidelity Gaussian Process model. W",
    "openreview_id": "lqTILjL6lP",
    "forum_id": "lqTILjL6lP"
  },
  "analysis_timestamp": "2026-01-06T19:40:02.618756"
}