{
  "prior_works": [
    {
      "title": "SKEMPI 2.0: an updated benchmark of changes in protein–protein binding energy, kinetics and thermodynamics upon mutation",
      "authors": "Jankauskaitė et al.",
      "year": 2019,
      "role": "Foundation",
      "relationship_sentence": "Defines the standard PPI ΔΔG prediction task and supplies the core benchmark used to evaluate methods under severe data scarcity, a key motivation for transferring knowledge from pretraining."
    },
    {
      "title": "Flex ddG: Rosetta ensemble-based estimation of changes in protein–protein binding affinity upon mutation",
      "authors": "Barlow et al.",
      "year": 2018,
      "role": "Baseline",
      "relationship_sentence": "Provides a primary physics-based baseline grounded in the thermodynamic cycle for PPI ΔΔG; the present work starts from the same thermodynamic definition but replaces costly conformational sampling with Boltzmann-aligned use of learned inverse-folding likelihoods."
    },
    {
      "title": "Deep generative models of genetic variation capture the effects of mutations",
      "authors": "Riesselman et al.",
      "year": 2018,
      "role": "Inspiration",
      "relationship_sentence": "Introduces the idea that log-likelihood differences from unsupervised generative models can approximate mutational effects via a statistical-energy view, directly inspiring this paper’s use of model log-likelihoods to estimate ΔΔG."
    },
    {
      "title": "Generative models for graph-based protein design",
      "authors": "Ingraham et al.",
      "year": 2019,
      "role": "Foundation",
      "relationship_sentence": "Established modeling p(sequence|structure) for inverse folding and interpreting negative log-likelihood as a statistical energy; this paper leverages that quantity and, via Bayes plus Boltzmann, aligns it to physical binding free energy changes."
    },
    {
      "title": "ProteinMPNN: Protein sequence design by learning probabilistic models of sequences conditioned on backbone",
      "authors": "Dauparas et al.",
      "year": 2022,
      "role": "Extension",
      "relationship_sentence": "Provides a state-of-the-art inverse folding model whose log-likelihoods are directly used and explicitly aligned to ΔΔG in this work, improving over prior ad hoc use of raw likelihood differences."
    },
    {
      "title": "ESM-IF1: Inverse folding with a sequence–structure transformer",
      "authors": "Hsu et al.",
      "year": 2022,
      "role": "Extension",
      "relationship_sentence": "Supplies a powerful structure-conditioned sequence likelihood that this paper repurposes; the Boltzmann Alignment formalism calibrates ESM-IF1 log-likelihoods to binding free-energy differences."
    },
    {
      "title": "SAAMBE-3D: Predicting the effect of mutations on protein–protein interactions",
      "authors": "Pahari et al.",
      "year": 2020,
      "role": "Gap Identification",
      "relationship_sentence": "Representative supervised ΔΔG predictor relying on hand-crafted/physics-derived features; its limited generalization and data dependence motivate a principled alignment of pretrained inverse-folding knowledge to ΔΔG."
    }
  ],
  "synthesis_narrative": "The paper’s core idea—Boltzmann Alignment of inverse-folding log-likelihoods to predict ΔΔG for protein–protein interactions—arises from unifying thermodynamic principles with advances in structure-conditioned generative modeling. SKEMPI 2.0 formalized the PPI ΔΔG task and, by highlighting data scarcity, motivated leveraging pretrained models rather than purely supervised training. Physics-based methods such as Rosetta Flex ddG grounded ΔΔG prediction in the thermodynamic cycle, but their reliance on explicit conformational sampling is computationally intensive. DeepSequence provided the conceptual bridge that differences in model log-likelihoods can act as statistical energies reflecting mutational impact, suggesting a route to energy prediction without direct simulation. In parallel, inverse folding was established by Ingraham et al., who modeled p(sequence|structure) and interpreted negative log-likelihood as a sequence ‘energy’ for a given backbone; subsequent high-capacity models such as ProteinMPNN and ESM-IF1 delivered strong, calibrated log-likelihoods conditioned on structure. Prior uses of these scores for mutation assessment, however, lacked a principled thermodynamic alignment to binding free energy and did not account for conformational ensembles. The present work combines the Boltzmann distribution with Bayes’ theorem to re-express intractable p(structure|sequence) ratios in terms of accessible p(sequence|structure) likelihoods from inverse folding, thereby directly aligning statistical energies to ΔΔG. This addresses limitations of feature-engineered predictors like SAAMBE-3D and computationally heavy physics methods, yielding a data-efficient, thermodynamically grounded estimator of mutational effects on PPIs.",
  "analysis_timestamp": "2026-01-06T23:09:26.598566"
}