{
  "prior_works": [
    {
      "title": "K-Planes: Efficient Neural Fields via Multiplanar Factorization",
      "authors": "Fridovich-Keil et al.",
      "year": 2022,
      "role": "Foundational 4D representation",
      "relationship_sentence": "DynamicCity adopts the 4D-to-2D multi-plane (hex-plane) factorization introduced by K-Planes and replaces the standard per-plane feature aggregation with a learned Projection Module, directly addressing the limitations of naive summation/averaging in K-Planes for better 4D fitting."
    },
    {
      "title": "EG3D: Efficient Geometry-aware 3D Generative Adversarial Networks",
      "authors": "Chan et al.",
      "year": 2022,
      "role": "Planar feature representation and generative prior",
      "relationship_sentence": "EG3D’s tri-plane representation and simple feature fusion popularized generating volumetric fields from planar features, which DynamicCity generalizes to 4D and explicitly improves upon by learning the projection from 4D features to planes instead of using naive averaging."
    },
    {
      "title": "TensoRF: Tensorial Radiance Fields",
      "authors": "Chen et al.",
      "year": 2022,
      "role": "Tensor factorization and efficient volume reconstruction",
      "relationship_sentence": "The idea of reconstructing dense volumetric fields from compact factorized components in TensoRF inspired DynamicCity’s Expansion & Squeeze strategy to parallelly reconstruct 3D feature volumes from hex-plane factors, improving both speed and accuracy over per-point querying."
    },
    {
      "title": "HyperNeRF: A Higher-Dimensional Representation for Topologically Varying Neural Radiance Fields",
      "authors": "Park et al.",
      "year": 2021,
      "role": "Higher-dimensional modeling of dynamics",
      "relationship_sentence": "HyperNeRF established modeling scene dynamics by augmenting spatial coordinates with additional dimensions, a conceptual foundation that DynamicCity adopts for 4D occupancy with semantics while pursuing a far more compact hex-plane encoding."
    },
    {
      "title": "Block-NeRF: Scalable Large Scene Neural Rendering",
      "authors": "Tancik et al.",
      "year": 2022,
      "role": "Scaling to city-scale scenes",
      "relationship_sentence": "Block-NeRF’s emphasis on scaling neural fields to city-scale motivates DynamicCity’s focus on large-scale urban settings, where the proposed compact hex-plane VAE and parallel reconstruction are crucial for tractable 4D generation."
    },
    {
      "title": "SceneDreamer: Unbounded 3D Scene Generation from 2D Image Collections",
      "authors": "Kong et al.",
      "year": 2023,
      "role": "Generative pipeline for large scenes",
      "relationship_sentence": "Building on SceneDreamer’s generative paradigm for large outdoor scenes, DynamicCity extends from static 3D generation to dynamic 4D occupancy with semantics, replacing prior static representations with a hex-plane VAE tailored for dynamics."
    }
  ],
  "synthesis_narrative": "DynamicCity’s core advances—compact 4D representation via hex-planes with a learned Projection Module and an Expansion & Squeeze strategy for fast volume reconstruction—sit at the intersection of three threads of prior work. First, the higher-dimensional modeling of dynamics pioneered by HyperNeRF establishes the value of treating time as an additional coordinate, motivating DynamicCity’s 4D occupancy formulation. Second, planar factorization methods, notably EG3D’s tri-planes and K-Planes’ general multi-plane factorization for N-D fields, demonstrate that projecting high-dimensional fields onto axis-aligned planes yields tractable generative models. DynamicCity directly builds on this idea but replaces the field-to-plane mapping’s naive feature averaging with a learned Projection Module tuned for 4D occupancy semantics, substantially improving fitting quality. Third, tensor-factorized neural fields such as TensoRF reveal that dense volumes can be reconstructed efficiently from compact factors; DynamicCity operationalizes this insight for 4D occupancy by introducing a parallel Expansion & Squeeze step that reconstructs 3D feature volumes without expensive per-point queries.\nComplementing these representation advances, large-scale scene efforts like Block-NeRF and SceneDreamer underscore the need for scalable generative pipelines in expansive urban environments. DynamicCity fuses these strands—higher-dimensional dynamics, multi-plane factorization, and efficient factor-to-volume reconstruction—to deliver a practical, semantically aware 4D occupancy generator capable of modeling large, dynamic city scenes.",
  "analysis_timestamp": "2026-01-06T23:42:48.095543"
}