{
  "prior_works": [
    {
      "title": "Pocket2Mol: Efficient molecular sampling based on pocket-conditioned graph generative models",
      "authors": "Liu et al.",
      "year": 2021,
      "arxiv_id": "",
      "role": "Baseline",
      "relationship_sentence": "CBGBench adopts and reimplements Pocket2Mol as a key pocket-conditioned generator and reframes it under a unified complex-binding-graph completion interface to enable standardized comparisons."
    },
    {
      "title": "DiffDock: Diffusion Steps, Twists, and Turns for Molecular Docking",
      "authors": "Corso et al.",
      "year": 2023,
      "arxiv_id": "2210.01776",
      "role": "Related Problem",
      "relationship_sentence": "DiffDock’s diffusion-based, SE(3)-aware pose generation motivates treating docking/pose prediction as a sub-task of complex binding graph completion and serves as a primary baseline within the unified framework."
    },
    {
      "title": "EquiBind: Geometric Deep Learning for Drug Binding Structure Prediction",
      "authors": "Stärk et al.",
      "year": 2022,
      "arxiv_id": "2202.05146",
      "role": "Related Problem",
      "relationship_sentence": "EquiBind’s geometric matching over protein–ligand interaction graphs reinforces the interaction-graph view that CBGBench generalizes into a fill-in-the-blank complex completion paradigm and provides a contrasting baseline for pose tasks."
    },
    {
      "title": "GuacaMol: Benchmarking Models for de Novo Molecular Design",
      "authors": "Brown et al.",
      "year": 2019,
      "arxiv_id": "1811.09621",
      "role": "Inspiration",
      "relationship_sentence": "GuacaMol showed the value of standardized, modular benchmarks and clear metrics for molecule generation, directly motivating CBGBench’s standardized, extensible benchmarking for structure-based, target-aware settings."
    },
    {
      "title": "The PDBbind Database: Collection of Binding Affinities for Protein–Ligand Complexes",
      "authors": "Wang et al.",
      "year": 2004,
      "arxiv_id": "",
      "role": "Foundation",
      "relationship_sentence": "PDBbind provides the core protein–ligand complex structures and affinities that underpin SBDD training/evaluation, which CBGBench systematizes into consistent task definitions and splits."
    },
    {
      "title": "A Cross-Docked Dataset for Pose Selection and Binding Affinity",
      "authors": "Francoeur et al.",
      "year": 2020,
      "arxiv_id": "",
      "role": "Foundation",
      "relationship_sentence": "CrossDocked2020 formalizes large-scale, pocket-centered complex data and rigorous splits for docking, which CBGBench leverages to standardize data protocols across its unified tasks."
    },
    {
      "title": "Deep Generative Models for 3D Linker Design (DeLinker)",
      "authors": "Imrie et al.",
      "year": 2020,
      "arxiv_id": "2001.10369",
      "role": "Inspiration",
      "relationship_sentence": "DeLinker’s formulation of molecular design as ‘fill-in-the-blank’ 3D graph completion between anchors inspires CBGBench’s central idea of casting SBDD as completion of a protein–ligand complex binding graph with the ligand as the blank."
    }
  ],
  "synthesis_narrative": "Pocket-conditioned generative modeling emerged with methods like Pocket2Mol, which directly synthesize ligands using graph-based generation constrained by the 3D geometry and chemistry of a protein pocket, but with bespoke data handling and metrics. In parallel, pose-prediction methods such as DiffDock and EquiBind framed protein–ligand complexes geometrically, using SE(3)-aware diffusion or geometric matching on interaction graphs to place ligands in pockets; these works reinforced treating complexes as structured graphs that span protein and ligand components. Benchmarking in molecular generation was professionalized by GuacaMol, which demonstrated how standardized tasks, metrics, and modular implementations yield fair, reproducible comparisons—though its scope excluded protein-structure conditioning. Foundational datasets like PDBbind provided curated protein–ligand complexes with binding affinities, while CrossDocked2020 scaled pocket-centered complex data and rigorous splits for docking and pose tasks. Independently, DeLinker established a concrete “fill-in-the-blank” generative paradigm by completing missing molecular segments in 3D, proving that graph completion can be a natural generative interface. Together, these works expose a gap: SBDD methods operate on similar protein–ligand graphs yet remain fragmented across tasks, datasets, and implementations, hampering comparability. The natural next step is to unify them by casting target-aware drug design as complex binding graph completion, standardizing data protocols from PDBbind/CrossDocked, and integrating pocket-conditioned generation (Pocket2Mol) and pose baselines (DiffDock/EquiBind) within a modular, extensible benchmark that spans multiple sub-tasks.",
  "target_paper": {
    "title": "CBGBench: Fill in the Blank of Protein-Molecule Complex Binding Graph",
    "authors": "Haitao Lin, Guojiang Zhao, Odin Zhang, Yufei Huang, Lirong Wu, Cheng Tan, Zicheng Liu, Zhifeng Gao, Stan Z. Li",
    "conference": "ICLR",
    "year": 2025,
    "presentation_type": "spotlight",
    "keywords": "Molecule Generation Benchmark, Target-Aware Drug Design, Generative Model",
    "abstract": "Structure-based drug design (SBDD) aims to generate potential drugs that can bind to a target protein and is greatly expedited by the aid of AI techniques in generative models. However, a lack of systematic understanding persists due to the diverse settings, complex implementation, difficult reproducibility, and task singularity. Firstly, the absence of standardization can lead to unfair comparisons and inconclusive insights. To address this dilemma, we propose CBGBench, a comprehensive benchmark for SBDD, that unifies the task as a generative graph completion, analogous to fill-in-the-blank of the 3D complex binding graph. By categorizing existing methods based on their attributes, CBGBench facilitates a modular and extensible framework that implements cutting-edge methods. Secondly, a single de novo molecule generation task can hardly reflect their capabilities. To broaden the scope, we adapt these models to a range of tasks essential in drug design, considered sub-tasks within the g",
    "openreview_id": "mOpNrrV2zH",
    "forum_id": "mOpNrrV2zH"
  },
  "analysis_timestamp": "2026-01-06T12:35:52.384688"
}