{
  "prior_works": [
    {
      "title": "Blockwise Parallel Decoding for Deep Autoregressive Models",
      "authors": "Mitchell Stern et al.",
      "year": 2018,
      "arxiv_id": null,
      "role": "Foundation",
      "relationship_sentence": "Introduced the draft-and-verify paradigm that underlies token-list verification, the core procedural template that speculative sampling builds upon and that this paper refines for multi-draft settings."
    },
    {
      "title": "Fast Inference from Transformers via Speculative Decoding",
      "authors": "Yair Leviathan et al.",
      "year": 2023,
      "arxiv_id": null,
      "role": "Foundation",
      "relationship_sentence": "Established single-draft speculative sampling with an accept/reject rule guaranteeing exact target distribution, which this work uses as the second stage of its canonical two-step decomposition."
    },
    {
      "title": "Optimal Multi‑Draft Speculative Sampling via Linear Programming",
      "authors": "Zhang et al.",
      "year": 2024,
      "arxiv_id": null,
      "role": "Baseline",
      "relationship_sentence": "Formulated the optimal token-level selection in multi-draft speculative sampling as a linear program maximizing acceptance, which this paper decomposes into an IS-based intermediate selection followed by single-draft speculation."
    },
    {
      "title": "Speculative Decoding as Optimal Transport",
      "authors": "Liu et al.",
      "year": 2024,
      "arxiv_id": null,
      "role": "Extension",
      "relationship_sentence": "Showed the equivalence between optimal token assignment and an optimal-transport coupling, providing the structural LP view that this paper leverages to derive a canonical two-step factorization and limits."
    },
    {
      "title": "Optimally Combining Sampling Techniques for Monte Carlo Rendering",
      "authors": "Eric Veach and Leonidas J. Guibas",
      "year": 1995,
      "arxiv_id": null,
      "role": "Foundation",
      "relationship_sentence": "Introduced multiple importance sampling for combining independent proposal distributions, directly informing the paper’s first-stage weighted-IS selection across multiple draft models."
    },
    {
      "title": "On the Acceptance Rate and Exactness of Speculative Decoding",
      "authors": "Sun et al.",
      "year": 2024,
      "arxiv_id": null,
      "role": "Gap Identification",
      "relationship_sentence": "Analyzed acceptance probability and exactness conditions for single-draft speculative decoding, motivating this paper’s derivation of necessary and sufficient conditions and explicit expressions in the multi-draft (two identical drafts) case."
    }
  ],
  "synthesis_narrative": "Blockwise Parallel Decoding formalized the draft-and-verify pattern that allows proposing multiple tokens and conditionally verifying them against a stronger model, establishing the procedural backbone for token-list acceptance schemes. Building on that, Fast Inference from Transformers via Speculative Decoding laid out a single-draft accept/reject mechanism that preserves the target model’s distribution, specifying the exact correctness criterion and acceptance rules now standard in speculative sampling. Subsequent work cast multi-draft token selection as a linear program that maximizes the probability of accepting one of several proposals, revealing an optimal policy over token lists under multiple independent drafts. A complementary strand connected this LP to optimal transport, showing the token-assignment structure is a coupling between proposal and target distributions. Orthogonally, multiple importance sampling provided the principled way to combine several independent proposals into an unbiased selection through appropriately weighted draws. Finally, theoretical analyses of acceptance rates characterized exactness and tight bounds in the single-draft case, clarifying when perfect acceptance is attainable and where bottlenecks arise. Taken together, these works exposed both the structural LP/OT nature of optimal multi-draft selection and the statistical principle for combining proposals via importance weights. The present paper synthesizes these insights by proving a canonical two-step factorization—an IS-style intermediate selection followed by single-draft speculation—and by tightening theory with necessary and sufficient conditions and explicit acceptance expressions for two identical drafts, thereby pinpointing the fundamental limits of multi-draft speculative sampling.",
  "target_paper": {
    "title": "Multi-Draft Speculative Sampling: Canonical Decomposition and Theoretical Limits",
    "authors": "Ashish J Khisti, MohammadReza Ebrahimi, Hassan Dbouk, Arash Behboodi, Roland Memisevic, Christos Louizos",
    "conference": "ICLR",
    "year": 2025,
    "presentation_type": "spotlight",
    "keywords": "speculative decoding, multi draft speculative sampling, large language models, weighted importance sampling, optimal transport",
    "abstract": "We consider multi-draft speculative sampling, where the proposal sequences are sampled independently from different draft models.  At each step, a  token-level draft selection scheme takes a list of valid tokens as input and produces an output token whose distribution matches that of the target model. Previous works have demonstrated that the optimal scheme (which maximizes the probability of accepting one of the input tokens) can be cast as a solution to a linear program. In this work we show that the optimal scheme can be decomposed into a two-step solution: in the first step an importance sampling (IS) type scheme is used to select one intermediate token; in the second step (single-draft) speculative sampling is applied to generate the output token.  For the case of two identical draft models we further 1) establish a necessary and sufficient condition on the distributions of the target and draft models for the acceptance probability to equal one and 2) provide an explicit expressio",
    "openreview_id": "N1L5TgtkAw",
    "forum_id": "N1L5TgtkAw"
  },
  "analysis_timestamp": "2026-01-06T13:34:38.131205"
}