{
  "prior_works": [
    {
      "title": "Barycenters in the Wasserstein space",
      "authors": "M. Agueh et al.",
      "year": 2011,
      "arxiv_id": null,
      "role": "Foundation",
      "relationship_sentence": "This paper formalized Wasserstein barycenters as minimizers of weighted sums of W2 distances, which the present work constrains (in the sliced setting) to equalize barycenter-to-marginal distances for marginal fairness."
    },
    {
      "title": "Sliced and Radon Wasserstein Barycenters of Measures",
      "authors": "N. Bonneel et al.",
      "year": 2015,
      "arxiv_id": null,
      "role": "Baseline",
      "relationship_sentence": "They introduced the practical computation of sliced Wasserstein barycenters via averaging 1D barycenters over random projections, the very baseline whose uniform weighting is revisited here to enforce approximately equal distances to all marginals."
    },
    {
      "title": "Generalized Sliced Wasserstein Distances",
      "authors": "S. Kolouri et al.",
      "year": 2019,
      "arxiv_id": null,
      "role": "Related Problem",
      "relationship_sentence": "By showing that altering the slicing transform (generalized Radon) changes the induced geometry and performance, this work motivates the idea that selecting appropriate slicing distributions can improve efficiency and fidelity of sliced OT-based barycenter objectives."
    },
    {
      "title": "Max-Sliced Wasserstein Distance",
      "authors": "I. Deshpande et al.",
      "year": 2019,
      "arxiv_id": null,
      "role": "Inspiration",
      "relationship_sentence": "Their maximization over projection directions demonstrates that learned slicing directions enhance discriminative power and sample efficiency, directly inspiring the paper’s slicing distribution selection to speed up fairness-aware SW barycenter computation."
    },
    {
      "title": "Distributional Sliced Wasserstein",
      "authors": "K. Nguyen et al.",
      "year": 2022,
      "arxiv_id": null,
      "role": "Extension",
      "relationship_sentence": "This work proposes learning a distribution over projections rather than using fixed random slices, an idea the current paper extends by selecting slicing distributions to accelerate its surrogate marginal-fairness SW barycenter objectives."
    },
    {
      "title": "Trimmed Barycenters of Probability Measures",
      "authors": "J. Álvarez-Esteban et al.",
      "year": 2016,
      "arxiv_id": null,
      "role": "Gap Identification",
      "relationship_sentence": "By revealing that heterogeneity and outliers bias barycenters and proposing trimming (with a tuning parameter) for robustness, this paper highlights the gap that the current work fills with hyperparameter-free surrogates targeting equalized barycenter-to-marginal distances."
    }
  ],
  "synthesis_narrative": "Wasserstein barycenters were formalized as minimizers of weighted sums of Wasserstein distances, establishing the geometric notion of an average measure in optimal transport (Agueh and Carlier). To make this tractable, sliced variants compute barycenters by projecting measures onto lines, solving 1D problems, and averaging over projections, yielding an efficient computational baseline (Bonneel et al.). Subsequent advances showed that the slicing mechanism itself shapes behavior: generalized slicing via alternative Radon transforms alters the geometry and quality of sliced OT estimates (Kolouri et al.). Beyond fixed random projections, optimizing projection directions can markedly improve discrimination and sample efficiency, as evidenced by max-sliced Wasserstein distances (Deshpande et al.). Pushing this further, learning a distribution over projections reduces variance and accelerates sliced OT computations (Nguyen et al.), indicating that projection selection is a powerful lever. Parallel work on robustness exposed that heterogeneous marginals can skew barycenters and proposed trimming to mitigate outliers, albeit at the cost of tuning hyperparameters (Álvarez-Esteban et al.). Together, these strands surfaced a gap: the standard (uniform-weight) sliced barycenter can be inefficient and can yield uneven barycenter-to-marginal distances under heterogeneity. The natural next step is to explicitly target marginal-distance fairness within the sliced framework and to leverage learned slicing distributions for efficiency. The paper synthesizes these insights by casting fairness as a constrained SWB problem and introducing hyperparameter-free surrogate objectives, while adopting slicing distribution selection to achieve practical, efficient computation.",
  "target_paper": {
    "title": "Towards Marginal Fairness Sliced Wasserstein Barycenter",
    "authors": "Khai Nguyen, Hai Nguyen, Nhat Ho",
    "conference": "ICLR",
    "year": 2025,
    "presentation_type": "spotlight",
    "keywords": "Sliced Wasserstein Barycenter, Optimal Transport, Sliced Wasserstein, Averaging Measures.",
    "abstract": "The Sliced Wasserstein barycenter (SWB) is a widely acknowledged method for efficiently generalizing the averaging operation within probability measure spaces. However, achieving marginal fairness SWB, ensuring approximately equal distances from the barycenter to marginals, remains unexplored. The uniform weighted SWB is not necessarily the optimal choice to obtain the desired marginal fairness barycenter due to the heterogeneous structure of marginals and the non-optimality of the optimization. As the first attempt to tackle the problem, we define the marginal fairness sliced Wasserstein barycenter (MFSWB) as a constrained SWB problem. Due to the computational disadvantages of the formal definition, we propose two hyperparameter-free and computationally tractable surrogate MFSWB problems that implicitly minimize the distances to marginals and encourage marginal fairness at the same time. To further improve the efficiency, we perform slicing distribution selection and obtain the third ",
    "openreview_id": "NQqJPPCesd",
    "forum_id": "NQqJPPCesd"
  },
  "analysis_timestamp": "2026-01-06T20:05:36.629956"
}