{
  "prior_works": [
    {
      "title": "Causal Interpretation of Stochastic Differential Equations",
      "authors": "Søren Wengel Mogensen and Niels Richard Hansen",
      "year": 2020,
      "arxiv_id": "",
      "role": "Foundation",
      "relationship_sentence": "Their formulation that causal edges in SDEs are determined by which coordinates enter each other’s differentials directly underpins the acyclic dependence graph (with self-loops) on which our interval CI constraints and identifiability results are built."
    },
    {
      "title": "Graphical models for marked point processes based on local independence",
      "authors": "Vanessa Didelez",
      "year": 2008,
      "arxiv_id": "",
      "role": "Inspiration",
      "relationship_sentence": "The local independence principle establishing conditional independence relationships over time intervals for continuous-time processes motivates our construction of interval-based CI constraints for SDE coordinate processes."
    },
    {
      "title": "Markov Properties for Acyclic Directed Mixed Graphs",
      "authors": "Thomas S. Richardson",
      "year": 2003,
      "arxiv_id": "",
      "role": "Foundation",
      "relationship_sentence": "The ADMG framework and m-separation criterion provide the ancestral-graph target and separation semantics we use to formalize recovery under partial observation and latent confounding."
    },
    {
      "title": "Detecting causal associations in large nonlinear time series using PCMCI",
      "authors": "Jakob Runge et al.",
      "year": 2019,
      "arxiv_id": "",
      "role": "Gap Identification",
      "relationship_sentence": "PCMCI’s time-ordered CI paradigm highlights the value of exploiting temporal direction but is limited to discrete-time lag graphs and does not address latent confounding, motivating our move to SDE-induced ancestral graphs and interval CIs with partial observability."
    },
    {
      "title": "Kernel Measures of Conditional Dependence",
      "authors": "Kenji Fukumizu, Arthur Gretton, Xiaohai Sun, Bernhard Schölkopf",
      "year": 2008,
      "arxiv_id": "",
      "role": "Foundation",
      "relationship_sentence": "Their characterization of conditional independence via conditional cross-covariance operators in RKHS forms the statistical backbone for our consistent signature-kernel CI test on path-valued variables."
    },
    {
      "title": "Kernel-based Conditional Independence Test and Application in Causal Discovery",
      "authors": "Kun Zhang, Jonas Peters, Dominik Janzing, Bernhard Schölkopf",
      "year": 2011,
      "arxiv_id": "",
      "role": "Extension",
      "relationship_sentence": "We adapt the practical KCI testing scheme by replacing Euclidean kernels with signature kernels on path space and proving its validity for CI between coordinate-process segments of SDEs."
    },
    {
      "title": "The Signature Kernel",
      "authors": "Cristopher Salvi et al.",
      "year": 2021,
      "arxiv_id": "",
      "role": "Inspiration",
      "relationship_sentence": "Signature kernels provide characteristic, efficiently computable RKHS embeddings for paths, enabling our nonparametric CI testing of entire process segments central to the practical CI oracle."
    }
  ],
  "synthesis_narrative": "Stochastic differential equations can encode causal structure through their coefficients: which coordinates enter each other’s differentials determines directed dependencies and naturally allows self-loops, as formalized by Mogensen and Hansen. Beyond pointwise conditioning, Didelez introduced local independence for continuous-time processes, articulating conditional independence constraints over time intervals that align with the way information flows in continuous time. When variables are partially observed, Richardson’s acyclic directed mixed graphs and m-separation provide the correct graphical semantics for ancestral targets under marginalization and latent confounding. In time series, PCMCI demonstrated how leveraging temporal ordering within CI-based discovery boosts orientation power, but its discrete-time lag framework and lack of principled latent-variable handling leave gaps for continuous-time systems. On the statistical testing side, Fukumizu et al. grounded conditional independence in operators on reproducing kernel Hilbert spaces, enabling consistent nonparametric CI tests, with Zhang et al. providing a practical KCI procedure widely used in causal discovery. For sequential data, Salvi and collaborators developed signature kernels, yielding characteristic, efficiently computable embeddings of entire paths suitable for hypothesis testing on processes. Bringing these threads together, a natural opportunity emerges: define CI constraints tailored to SDE-induced dependence graphs over selected intervals and use them for sound, complete causal discovery of ancestral graphs—even under partial observation—while supplying a practical oracle by marrying RKHS CI testing with signature kernels to handle path-valued variables. This synthesis replaces discrete lag models with SDE-native interval CIs, exploits time directionality for unique orientation, and supplies a consistent, flexible CI test that operates directly on trajectory segments.",
  "target_paper": {
    "title": "Signature Kernel Conditional Independence Tests in Causal Discovery for Stochastic Processes",
    "authors": "Georg Manten, Cecilia Casolo, Emilio Ferrucci, Søren Wengel Mogensen, Cristopher Salvi, Niki Kilbertus",
    "conference": "ICLR",
    "year": 2025,
    "presentation_type": "spotlight",
    "keywords": "causality, dynamical systems, stochastic processes, causal discovery, signature kernel",
    "abstract": "Inferring the causal structure underlying stochastic dynamical systems from observational data holds great promise in domains ranging from science and health to finance. Such processes can often be accurately modeled via stochastic differential equations (SDEs), which naturally imply causal relationships via `which variables enter the differential of which other variables'. In this paper, we develop conditional independence (CI) constraints on coordinate processes over selected intervals that are Markov with respect to the acyclic dependence graph (allowing self-loops) induced by a general SDE model. We then provide a sound and complete causal discovery algorithm, capable of handling both fully and partially observed data, and uniquely recovering the underlying or induced ancestral graph by exploiting time directionality assuming a CI oracle. Finally, to make our algorithm practically usable, we also propose a flexible, consistent signature kernel-based CI test to infer these constrain",
    "openreview_id": "Nx4PMtJ1ER",
    "forum_id": "Nx4PMtJ1ER"
  },
  "analysis_timestamp": "2026-01-06T11:06:32.247836"
}