{
  "prior_works": [
    {
      "title": "Whole-brain functional imaging at cellular resolution using light-sheet microscopy",
      "authors": "Ahrens MB et al.",
      "year": 2013,
      "role": "Foundation",
      "relationship_sentence": "This work established the light-sheet imaging paradigm for cellular-resolution whole-brain activity in larval zebrafish, providing the essential experimental modality on which ZAPBench’s dataset and problem formulation directly rely."
    },
    {
      "title": "Light-sheet functional imaging in fictively behaving zebrafish",
      "authors": "Vladimirov N et al.",
      "year": 2014,
      "role": "Extension",
      "relationship_sentence": "By extending light-sheet imaging to behaving fish and demonstrating stabilized, volumetric recordings of nearly all neurons, this paper provided the concrete data-collection template that ZAPBench scales and formalizes into a standardized forecasting task."
    },
    {
      "title": "WeatherBench: A benchmark data set for data-driven weather forecasting",
      "authors": "Rasp S et al.",
      "year": 2020,
      "role": "Inspiration",
      "relationship_sentence": "WeatherBench pioneered an open, domain-specific forecasting benchmark with standardized tasks and metrics; ZAPBench explicitly follows this model to structure whole-brain neural activity prediction as a community benchmark."
    },
    {
      "title": "Brain-Score: Which Artificial Neural Network for Object Recognition is most Brain-Like?",
      "authors": "Schrimpf M et al.",
      "year": 2018,
      "role": "Inspiration",
      "relationship_sentence": "Brain-Score demonstrated how neuroscience can advance via shared benchmarks and leaderboards; ZAPBench adapts this benchmark philosophy to neural activity forecasting at whole-brain scale."
    },
    {
      "title": "Whole-brain serial-section electron microscopy in larval zebrafish",
      "authors": "Hildebrand DGC et al.",
      "year": 2017,
      "role": "Gap Identification",
      "relationship_sentence": "This study showed the feasibility of synaptic-resolution mapping of the zebrafish brain but lacked paired, standardized functional forecasting tasks; ZAPBench explicitly addresses this gap by providing a functional benchmark from a brain undergoing synaptic-level mapping to enable future structure-function integration."
    },
    {
      "title": "Inferring single-trial neural population dynamics using sequential auto-encoders",
      "authors": "Pandarinath C et al.",
      "year": 2018,
      "role": "Related Problem",
      "relationship_sentence": "LFADS introduced state-of-the-art neural dynamics modeling for predicting neural activity over time; ZAPBench leverages and evaluates such time-series modeling approaches as baselines for cellular-resolution whole-brain forecasting."
    },
    {
      "title": "Convolutional LSTM Network: A Machine Learning Approach for Precipitation Nowcasting",
      "authors": "Shi X et al.",
      "year": 2015,
      "role": "Baseline",
      "relationship_sentence": "ConvLSTM established a canonical spatiotemporal forecasting architecture that ZAPBench adopts as a primary volumetric video modeling baseline for predicting future neural activity."
    }
  ],
  "synthesis_narrative": "ZAPBench’s core innovation—framing cellular-resolution whole-brain neural activity prediction as a standardized benchmark—stands on two intertwined lineages. First, foundational zebrafish imaging advances by Ahrens et al. and Vladimirov et al. made it technically possible to record near-comprehensive neural activity with light-sheet microscopy, including during behavior. These works defined the acquisition regime and stabilized volumetric data characteristics that ZAPBench now formalizes into a reproducible forecasting task with motion-stabilized, voxel-level segmentations.\n\nSecond, the paper draws directly from benchmarking paradigms that catalyzed progress in other fields. WeatherBench provided a blueprint for domain-focused, open forecasting benchmarks with fixed datasets, tasks, and metrics; Brain-Score demonstrated how neuroscience can accelerate via community benchmarks and leaderboards. ZAPBench fuses these ideas to create a rigorous, shared yardstick for whole-brain neural dynamics.\n\nOn the modeling side, ZAPBench’s initial baselines trace to established spatiotemporal and neural-dynamics methods. ConvLSTM represents a canonical approach for video-like forecasting extended here to volumetric neural data, while LFADS exemplifies latent dynamical systems models for predicting neural activity over time. Finally, Hildebrand et al.’s whole-brain EM mapping in zebrafish highlights a critical gap—structural detail without paired, standardized functional forecasting—which ZAPBench is poised to bridge by providing a functional benchmark from a brain undergoing synaptic-level reconstruction, enabling future structure-informed prediction.",
  "analysis_timestamp": "2026-01-06T23:09:26.590520"
}