{
  "prior_works": [
    {
      "title": "SchNet: A continuous-filter convolutional neural network for modeling quantum interactions",
      "authors": "Kristof T. Schütt et al.",
      "year": 2017,
      "arxiv_id": "1706.08566",
      "role": "Gap Identification",
      "relationship_sentence": "SchNet popularized radius-cutoff molecular graphs without theoretical guarantees of simultaneous connectivity and sparsity, a limitation this paper explicitly targets with a provably connected and sparse construction."
    },
    {
      "title": "Directional Message Passing for Molecular Graphs (DimeNet)",
      "authors": "Johannes Klicpera et al.",
      "year": 2020,
      "arxiv_id": "2003.03123",
      "role": "Gap Identification",
      "relationship_sentence": "DimeNet shows the value of angular information on standard cutoff graphs but leaves the underlying graph non-rigid, motivating the present work’s rigid graph where edge distances and dihedral angles uniquely fix geometry."
    },
    {
      "title": "E(n) Equivariant Graph Neural Networks",
      "authors": "Victor Garcia Satorras et al.",
      "year": 2021,
      "arxiv_id": "2102.09844",
      "role": "Baseline",
      "relationship_sentence": "EGNN relies on sparse neighbor graphs built with heuristic cutoffs, and the proposed principled construction is designed to plug into such equivariant GNNs while guaranteeing sparsity, connectivity, and rigidity."
    },
    {
      "title": "On graphs and the rigidity of plane skeletal structures",
      "authors": "Gerard Laman",
      "year": 1970,
      "arxiv_id": "",
      "role": "Foundation",
      "relationship_sentence": "Laman’s combinatorial rigidity counts underpin the paper’s sparsity–rigidity tradeoff, informing an edge-count regime where a sparse graph can still be rigid."
    },
    {
      "title": "Conditions for unique graph realizations",
      "authors": "Bruce Hendrickson",
      "year": 1992,
      "arxiv_id": "",
      "role": "Foundation",
      "relationship_sentence": "Hendrickson’s conditions for (global) rigidity provide the theoretical lens used to argue that distances plus dihedral constraints over the constructed graph uniquely determine 3D configurations."
    },
    {
      "title": "Pebble game algorithms and sparse graphs",
      "authors": "Audrey Lee and Ileana Streinu",
      "year": 2008,
      "arxiv_id": "",
      "role": "Extension",
      "relationship_sentence": "Pebble-game rigidity algorithms directly inform how to certify or assemble minimally rigid (sparse) subgraphs, which the paper adapts to ensure guaranteed rigidity while keeping edge count low."
    },
    {
      "title": "Voronoi diagrams—A survey of a fundamental geometric data structure",
      "authors": "Franz Aurenhammer",
      "year": 1991,
      "arxiv_id": "",
      "role": "Inspiration",
      "relationship_sentence": "Voronoi/Delaunay proximity graphs offer hyperparameter-free, connected, and typically sparse adjacencies that inspire the paper’s use of geometry-driven neighbor selection strengthened with rigidity guarantees."
    }
  ],
  "synthesis_narrative": "Radius-based neighbor graphs became the default for molecular GNNs with SchNet, which operationalized continuous filters over local environments defined by a fixed cutoff but offered no guarantees that such graphs remain both sparse and connected. DimeNet demonstrated that encoding directional geometry via distances and angles markedly improves accuracy, yet its underlying cutoff graphs remain non-rigid, leaving spatial arrangements underconstrained by the graph structure itself. EGNN further showed that equivariance leverages geometric signals effectively, while still depending on heuristically constructed neighborhood graphs for scalability. In parallel, classical rigidity theory established how sparsity and rigidity can coexist: Laman gave tight edge-count conditions for minimal rigidity, Hendrickson characterized when edge-length–constrained frameworks are uniquely realizable, and pebble-game algorithms by Lee and Streinu provided practical tools to certify and extract sparse rigid subgraphs. From computational geometry, Voronoi/Delaunay proximity constructions showed how to obtain hyperparameter-free, geometry-driven adjacencies that are connected and typically sparse. Together, these strands exposed a gap: modern molecular GNNs benefit from geometric features but rest on graphs that lack provable connectivity, sparsity, and rigidity. The natural next step is to synthesize proximity-based, hyperparameter-free neighbor selection with rigidity-theoretic guarantees, yielding a graph whose edge set remains bounded while ensuring connectivity and generic rigidity so that edge distances and dihedral angles suffice to uniquely determine 3D structure—thereby providing a theoretically grounded substrate for equivariant and directional message passing.",
  "target_paper": {
    "title": "A Theoretically-Principled Sparse, Connected, and Rigid Graph Representation of Molecules",
    "authors": "Shih-Hsin Wang, Yuhao Huang, Justin M. Baker, Yuan-En Sun, Qi Tang, Bao Wang",
    "conference": "ICLR",
    "year": 2025,
    "presentation_type": "oral",
    "keywords": "Graph representation, sparsity, connectivity, rigidity, molecules, learning",
    "abstract": "Graph neural networks (GNNs) -- learn graph representations by exploiting the graph's sparsity, connectivity, and symmetries -- have become indispensable for learning geometric data like molecules. However, the most used graphs (e.g., radial cutoff graphs) in molecular modeling lack theoretical guarantees for achieving connectivity and sparsity simultaneously, which are essential for the performance and scalability of GNNs. Furthermore, existing widely used graph construction methods for molecules lack rigidity, limiting GNNs' ability to exploit graph nodes' spatial arrangement. In this paper, we introduce a new hyperparameter-free graph construction of molecules and beyond with sparsity, connectivity, and rigidity guarantees. Remarkably, our method consistently generates connected and sparse graphs with the edge-to-node ratio being bounded above by 3. Our graphs' rigidity guarantees that edge distances and dihedral angles are sufficient to uniquely determine the general spatial arrang",
    "openreview_id": "OIvg3MqWX2",
    "forum_id": "OIvg3MqWX2"
  },
  "analysis_timestamp": "2026-01-06T18:24:54.329590"
}