{
  "prior_works": [
    {
      "title": "Social Chemistry 101: Learning to Reason about Social and Moral Norms",
      "authors": "Maarten Sap et al.",
      "year": 2020,
      "arxiv_id": "",
      "role": "Foundation",
      "relationship_sentence": "By framing everyday situations in terms of social and moral rules-of-thumb, it established the everyday normative context that DailyDilemmas extends into explicit two-action dilemmas with annotated affected parties and value trade-offs."
    },
    {
      "title": "Delphi: Towards Machine Ethics and Norms",
      "authors": "Liwei Jiang et al.",
      "year": 2021,
      "arxiv_id": "2110.07574",
      "role": "Inspiration",
      "relationship_sentence": "Delphi showed that LMs can make normative judgments over everyday scenarios but are brittle and opaque about underlying values, directly motivating DailyDilemmas’ controlled dilemma design and explicit value labeling to diagnose model value preferences."
    },
    {
      "title": "SCRUPLES: A Corpus of Community Ethical Judgments",
      "authors": "Nicholas Lourie et al.",
      "year": 2021,
      "arxiv_id": "",
      "role": "Foundation",
      "relationship_sentence": "By surfacing ambiguity and disagreement in community ethical judgments on everyday narratives, it highlighted the need for datasets that capture contested choices, which DailyDilemmas formalizes via paired actions and explicit value dimensions."
    },
    {
      "title": "The Moral Machine experiment",
      "authors": "Edmond Awad et al.",
      "year": 2018,
      "arxiv_id": "",
      "role": "Foundation",
      "relationship_sentence": "It established large-scale pairwise moral dilemmas and cross-cultural analysis, a paradigm DailyDilemmas adapts from trolley settings to quotidian life with value tags for each option and identified affected parties."
    },
    {
      "title": "Constitutional AI: Harmlessness from AI Feedback",
      "authors": "Yuntao Bai et al.",
      "year": 2022,
      "arxiv_id": "2212.08073",
      "role": "Gap Identification",
      "relationship_sentence": "By aligning models to a fixed set of stated principles, it raised the question of which values models actually prioritize in practice, which DailyDilemmas directly probes by mapping choices to value frameworks across everyday dilemmas."
    },
    {
      "title": "World Values Survey: Round 7 (2017–2021) Cross-National Data-Set",
      "authors": "Ronald Inglehart et al.",
      "year": 2020,
      "arxiv_id": "",
      "role": "Foundation",
      "relationship_sentence": "It provides a canonical taxonomy of human values that DailyDilemmas explicitly uses to code actions and aggregate model preferences along sociological value dimensions."
    },
    {
      "title": "Moral Foundations Theory: The Pragmatic Validity of Moral Pluralism",
      "authors": "Jesse Graham et al.",
      "year": 2013,
      "arxiv_id": "",
      "role": "Foundation",
      "relationship_sentence": "Its psychologically grounded moral dimensions supply one of the key lenses through which DailyDilemmas annotates and analyzes the values implicated by each action choice."
    }
  ],
  "synthesis_narrative": "Social Chemistry 101 showed that everyday situations can be represented by compact social and moral rules-of-thumb, making normative reasoning over daily life a tractable modeling target. Delphi then demonstrated that language models can render such judgments but often do so opaquely and inconsistently, revealing the need for structured probes that expose the value trade-offs behind model outputs. SCRUPLES surfaced ambiguity and community disagreement in ethical judgments, underscoring that many real decisions are contested rather than clear-cut and thus require formulations that capture competing, legitimate values. The Moral Machine experiment pioneered large-scale pairwise moral dilemmas with cross-cultural analysis, validating pairwise choice as a vehicle to elicit preferences, albeit within stylized trolley scenarios. In parallel, the World Values Survey articulated sociological value dimensions suitable for aggregating preferences across topics and populations, while Moral Foundations Theory provided psychologically grounded moral dimensions for coding what values a choice implicates. Constitutional AI reframed alignment as adherence to an explicit set of principles, highlighting a gap between declared constitutions and the values models actually enact under pressure. Together, these works reveal a missing diagnostic: everyday, two-sided dilemmas with explicit affected parties and value tags that allow principled aggregation across established value taxonomies. DailyDilemmas synthesizes these insights by pairing quotidian choices, annotating their implicated values, and analyzing model selections through WVS and MFT lenses (among others), thereby turning opaque moral judgments into measurable value preferences and exposing how aligned models prioritize values in practice.",
  "target_paper": {
    "title": "DailyDilemmas: Revealing Value Preferences of LLMs with Quandaries of Daily Life",
    "authors": "Yu Ying Chiu, Liwei Jiang, Yejin Choi",
    "conference": "ICLR",
    "year": 2025,
    "presentation_type": "spotlight",
    "keywords": "language model, moral dilemma, model alignment, machine ethics, value alignment",
    "abstract": "As users increasingly seek guidance from LLMs for decision-making in daily life, many of these decisions are not clear-cut and depend significantly on the personal values and ethical standards of people. We present DailyDilemmas, a dataset of 1,360 moral dilemmas encountered in everyday life. Each dilemma presents two possible actions, along with affected parties and relevant human values for each action. Based on these dilemmas, we gather a repository of human values covering diverse everyday topics, such as interpersonal relationships, workplace, and environmental issues. With DailyDilemmas, we evaluate LLMs on these dilemmas to determine what action they will choose and the values represented by these action choices. Then, we analyze values through the lens of five theoretical frameworks inspired by sociology, psychology, and philosophy, including the World Values Survey, Moral Foundations Theory, Maslow's Hierarchy of Needs, Aristotle's Virtues, and Plutchik's Wheel of Emotions. Fo",
    "openreview_id": "PGhiPGBf47",
    "forum_id": "PGhiPGBf47"
  },
  "analysis_timestamp": "2026-01-06T06:56:11.462734"
}