{
  "prior_works": [
    {
      "title": "Prevalence of Neural Collapse During the Terminal Phase of Deep Learning",
      "authors": "Papyan et al.",
      "year": 2020,
      "arxiv_id": "2004.13665",
      "role": "Inspiration",
      "relationship_sentence": "The discovery that deep classifiers’ penultimate-layer features collapse to class-mean clusters arranged as a simplex ETF directly inspired hypothesizing and testing for an analogous clustering law in visuomotor latent spaces."
    },
    {
      "title": "Neural Collapse Under MSE Loss: Proximity to and Dynamics Towards Global Optimum",
      "authors": "Fang et al.",
      "year": 2021,
      "arxiv_id": null,
      "role": "Extension",
      "relationship_sentence": "By showing NC-like clustering can arise under square-loss regression, this work provides the theoretical bridge justifying why continuous-action behavior cloning should exhibit control-oriented latent clusters without cross-entropy labels."
    },
    {
      "title": "A Tutorial on Visual Servo Control",
      "authors": "Hutchinson et al.",
      "year": 1996,
      "arxiv_id": null,
      "role": "Foundation",
      "relationship_sentence": "The classic visual servoing formulation that steers motion by the sign and magnitude of relative pose errors directly motivates defining control-oriented classes as relative pose orthants (REPO) for analyzing latent clusters."
    },
    {
      "title": "End-to-End Training of Deep Visuomotor Policies",
      "authors": "Levine et al.",
      "year": 2016,
      "arxiv_id": "1504.00702",
      "role": "Foundation",
      "relationship_sentence": "This work established the image-encoder–to–action-decoder pipeline trained from demonstrations, providing the exact vision-to-action channel whose latent geometry is examined."
    },
    {
      "title": "Transporter Networks: Rearranging the Visual World for Robotic Manipulation",
      "authors": "Zeng et al.",
      "year": 2020,
      "arxiv_id": "2010.14406",
      "role": "Inspiration",
      "relationship_sentence": "By parameterizing actions as spatial displacements between object and goal in SE(2), it foregrounded relative pose as the operative variable for manipulation, informing the REPO-based class design used to interpret latent clusters."
    },
    {
      "title": "ALVINN: An Autonomous Land Vehicle in a Neural Network",
      "authors": "Pomerleau",
      "year": 1989,
      "arxiv_id": null,
      "role": "Foundation",
      "relationship_sentence": "Introduced behavior cloning as supervised mapping from observations to actions, the learning paradigm under which the studied visuomotor representations are trained."
    }
  ],
  "synthesis_narrative": "Neural Collapse revealed that as training proceeds, deep classifiers’ penultimate features concentrate around class means that form a simplex ETF, aligning with last-layer weights and enabling tight geometric predictions of representations (Papyan et al., 2020). Subsequent analyses extended this behavior beyond cross-entropy classification, showing that square-loss training can also induce collapse-like clustering, thereby connecting the phenomenon to regression settings (Fang et al., 2021). In manipulation, classic visual servoing formalized control as acting on relative pose error signals—particularly their signs and magnitudes—establishing a control-theoretic partition of state space that naturally discretizes into orthants (Hutchinson et al., 1996). End-to-end visuomotor learning operationalized an image encoder feeding an action decoder trained from demonstrations, defining the precise vision-to-action channel whose internal representations can be probed (Levine et al., 2016). In parallel, Transporter Networks emphasized that manipulation can be effectively parameterized by relative spatial displacements between objects and goals, directly elevating relative pose as the central control variable (Zeng et al., 2020). Foundationally, behavior cloning provided the supervised mapping from observations to actions that underlies modern visuomotor policies (Pomerleau, 1989).\nTogether, these works suggest that if visuomotor policies are trained via behavior cloning on tasks parameterized by relative pose, then the encoder’s latent space should organize around control-relevant equivalence classes analogous to neural collapse. The combination of NC’s clustering insight, its MSE-loss extension to continuous outputs, and control theory’s relative-pose partitioning motivates defining REPO-based classes and predicts that discrete-action policies cluster by action labels while continuous-action policies cluster by control-oriented pose categories—precisely the geometry this paper formalizes and empirically validates.",
  "target_paper": {
    "title": "Control-oriented Clustering of Visual Latent Representation",
    "authors": "Han Qi, Haocheng Yin, Heng Yang",
    "conference": "ICLR",
    "year": 2025,
    "presentation_type": "spotlight",
    "keywords": "neural collapse, learning from demonstration, vision-based learning control",
    "abstract": "We initiate a study of the geometry of the visual representation space ---the information channel from the vision encoder to the action decoder--- in an image-based control pipeline learned from behavior cloning. Inspired by the phenomenon of *neural collapse* (NC) in image classification, we empirically demonstrate the prevalent emergence of a similar *law of clustering* in the visual representation space. Specifically, \n\n- In discrete image-based control (e.g., Lunar Lander), the visual representations cluster according to the natural discrete action labels;\n\n- In continuous image-based control (e.g., Planar Pushing and Block Stacking), the clustering emerges according to ``control-oriented'' classes that are based on (a) the relative pose between the object and the target in the input or (b) the relative pose of the object induced by expert actions in the output. Each of the classes corresponds to one relative pose orthant (REPO).\n\nBeyond empirical observation, we show such a law of",
    "openreview_id": "pPQPQ7Yd58",
    "forum_id": "pPQPQ7Yd58"
  },
  "analysis_timestamp": "2026-01-06T13:15:17.377335"
}