{
  "prior_works": [
    {
      "title": "Learning Physical Intuition of Block Towers by Example",
      "authors": "J. Lerer, S. Gross, R. Fergus",
      "year": 2016,
      "role": "dataset/task + method for visual physics prediction",
      "relationship_sentence": "Established a canonical image-based stability judgment task that crystallized object-property and dynamics evaluation, directly informing PhysBench’s object stability/physics-based dynamics categories."
    },
    {
      "title": "Interaction Networks for Learning about Objects, Relations and Physics",
      "authors": "P. W. Battaglia, R. Pascanu, M. Lai, D. J. Rezende, K. Kavukcuoglu",
      "year": 2016,
      "role": "method (object-centric relational physics modeling)",
      "relationship_sentence": "Provided the object-centric, relation-based lens for physical reasoning that underpins PhysBench’s capability dimensions around object properties, inter-object relations, and dynamics."
    },
    {
      "title": "CATER: A Diagnostic Dataset for Compositional Actions and TEmporal Reasoning",
      "authors": "R. Girdhar, J. Carreira, C. Doersch, A. Zisserman",
      "year": 2019,
      "role": "dataset/benchmark (video temporal reasoning)",
      "relationship_sentence": "Introduced controlled video diagnostics for spatiotemporal tracking and occlusion, motivating PhysBench’s inclusion of temporal, occlusion, and compositional action reasoning in video."
    },
    {
      "title": "Something-Something V2: A Dataset for Recognizing Human-Object Interactions",
      "authors": "R. Goyal et al.",
      "year": 2018,
      "role": "dataset (real-world video, human–object interactions)",
      "relationship_sentence": "Brought diverse, fine-grained human–object interactions that emphasize affordances and object properties, informing PhysBench’s coverage of physical object properties and relationships in realistic videos."
    },
    {
      "title": "CLEVRER: Collision Events for Video Representation and Reasoning",
      "authors": "K. Yi, C. Gan, Y. Li, A. Torralba, J. B. Tenenbaum, J. Wu",
      "year": 2020,
      "role": "dataset/benchmark (video QA for intuitive physics and causality)",
      "relationship_sentence": "Pioneered causal, temporal, and counterfactual video QA about collisions, directly inspiring PhysBench’s interleaved video–text question design and its focus on causal/dynamic physical reasoning."
    },
    {
      "title": "PHYSION: Evaluating Physical Prediction from Vision in Humans and Machines",
      "authors": "D. M. Bear et al.",
      "year": 2021,
      "role": "dataset/benchmark (intuitive physics prediction)",
      "relationship_sentence": "Established broad physics scenarios and human–machine comparison protocols, which PhysBench extends to VLMs with richer modality interleaving and a wider capability taxonomy."
    }
  ],
  "synthesis_narrative": "PhysBench’s core contribution—a comprehensive, multimodal benchmark that diagnoses vision-language models’ understanding of the physical world—builds directly on three strands of prior work: classic image-based physics judgments, object-centric relational reasoning, and diagnostic video benchmarks for intuitive physics and temporal causality. Lerer et al. (2016) crystallized image-only physics prediction via block-tower stability, highlighting that visual cues must be grounded in dynamics—an archetype PhysBench generalizes into broader object-property and stability assessments. Battaglia et al.’s Interaction Networks (2016) provided the object-centric relational perspective that frames physical understanding as interactions among entities, which maps naturally onto PhysBench’s capability dimensions spanning object properties, inter-object relations, scene constraints, and dynamics.\nCLEVRER (2020) and CATER (2019) introduced controlled video diagnostics for causal, temporal, and counterfactual reasoning about physical events, shaping PhysBench’s emphasis on temporally grounded reasoning and interleaved video–text questions. Something-Something V2 (2018) added realism, diversity, and human–object affordances, motivating PhysBench’s inclusion of real-world interactions beyond synthetic setups. Finally, PHYSION (2021) broadened intuitive physics evaluation and human–machine comparisons; PhysBench extends this line to modern VLMs, unifying image and video modalities with text, expanding the scenario space (19 subclasses across four domains), and standardizing large-scale evaluation across many models. Collectively, these works supplied the task archetypes, modeling perspective, and evaluation protocols that PhysBench integrates into a single, physics-centric benchmark tailored to stress-test and improve VLMs’ physical world understanding.",
  "analysis_timestamp": "2026-01-06T23:42:48.102713"
}