{
  "prior_works": [
    {
      "title": "La prévision: ses lois logiques, ses sources subjectives",
      "authors": "Bruno de Finetti",
      "year": 1937,
      "arxiv_id": null,
      "role": "Foundation",
      "relationship_sentence": "This work’s Dutch book/coherence principle directly underpins the paper’s arbitrage-based consistency metric by formalizing when a set of probabilities admits a sure-profit bet."
    },
    {
      "title": "Combinatorial Information Market Design",
      "authors": "Robin Hanson",
      "year": 2003,
      "arxiv_id": null,
      "role": "Foundation",
      "relationship_sentence": "Hanson’s cost-function prediction markets operationalize arbitrage-free price constraints across logically related events, which the paper adapts as a general procedure for detecting incoherent forecasts."
    },
    {
      "title": "Efficient Market Making via Convex Optimization",
      "authors": "Jacob Abernethy et al.",
      "year": 2013,
      "arxiv_id": null,
      "role": "Extension",
      "relationship_sentence": "This work’s convex-optimization view of market makers provides the computational lens for quantifying maximum arbitrage (sure-profit) against inconsistent quotes, which the paper repurposes to score LLM forecast consistency."
    },
    {
      "title": "Strictly Proper Scoring Rules, Prediction, and Estimation",
      "authors": "Tilmann Gneiting et al.",
      "year": 2007,
      "arxiv_id": null,
      "role": "Gap Identification",
      "relationship_sentence": "By framing evaluation via proper scoring rules that require realized outcomes, this paper highlights the core limitation the new arbitrage-based metric overcomes—instantaneous assessment without ground truth."
    },
    {
      "title": "SelfCheckGPT: Zero-Resource Black-Box Hallucination Detection for Generative Large Language Models",
      "authors": "Yao Khai Manakul et al.",
      "year": 2023,
      "arxiv_id": "2303.08896",
      "role": "Inspiration",
      "relationship_sentence": "SelfCheckGPT’s idea of using internal consistency among model outputs as a proxy for correctness directly inspires evaluating forecasters via logical-consistency checks rather than resolved outcomes."
    },
    {
      "title": "Beyond Accuracy: Behavioral Testing of NLP Models with CheckList",
      "authors": "Marco Tulio Ribeiro et al.",
      "year": 2020,
      "arxiv_id": "2005.04118",
      "role": "Inspiration",
      "relationship_sentence": "CheckList’s template-driven generation of logically related test cases motivates the paper’s automated system for instantiating consistency checks from base forecasting questions."
    }
  ],
  "synthesis_narrative": "De Finetti established the Dutch book criterion, showing that a set of probability assignments is rational only if it precludes a sure-profit bet; this coherence notion precisely characterizes when forecasts are internally consistent. Hanson translated coherence into market design, using cost-function prediction markets to ensure arbitrage-free prices across logically related outcomes, and thus operationalized practical tests for inconsistencies like complementary events not summing to one. Abernethy and colleagues cast such market makers in a convex-optimization framework, quantifying and computing maximum arbitrage when quotes violate constraints—making inconsistency measurable as exploitable profit. On the evaluation side, Gneiting and Raftery formalized strictly proper scoring rules as the normative way to assess probabilistic forecasts, but these inherently require waiting for outcomes to resolve. In NLP, SelfCheckGPT showed that internal agreement among a model’s own outputs can serve as a proxy for correctness without ground truth. Complementarily, CheckList demonstrated how templated, logically related test suites can be programmatically generated to probe specific behavioral properties. Taken together, these strands revealed a gap: forecasting urgently needs instant, outcome-free evaluation, and there exists a principled notion—arbitrage—that both defines inconsistency and can be computed over logically related questions. The paper synthesizes these insights by auto-generating structured forecasting question sets (à la CheckList), eliciting probabilistic predictions, and scoring them via the maximum arbitrage implied by de Finetti/Hanson-style coherence, computed with the optimization tools inspired by Abernethy et al., thereby offering a ground-truth-free, quantitative consistency benchmark for LLM forecasters.",
  "target_paper": {
    "title": "Consistency Checks for Language Model Forecasters",
    "authors": "Daniel Paleka, Abhimanyu Pallavi Sudhir, Alejandro Alvarez, Vineeth Bhat, Adam Shen, Evan Wang, Florian Tramèr",
    "conference": "ICLR",
    "year": 2025,
    "presentation_type": "oral",
    "keywords": "forecasting, markets, trading, LLM, evaluation, eval, consistency, robustness",
    "abstract": "Forecasting is a task that is difficult to evaluate: the ground truth can only be known in the future. Recent work showing LLM forecasters rapidly approaching human-level performance begs the question: how can we benchmark and evaluate these forecasters *instantaneously*? Following the consistency check framework, we measure the performance of forecasters in terms of the consistency of their predictions on different logically-related questions. We propose a new, general consistency metric based on *arbitrage*: for example, if a forecasting AI illogically predicts that both the Democratic and Republican parties have 60\\% probability of winning the 2024 US presidential election, an arbitrageur could trade against the forecaster's predictions and make a profit. We build an automated evaluation system that generates a set of base questions, instantiates consistency checks from these questions, elicits the predictions of the forecaster, and measures the consistency of the predictions. We th",
    "openreview_id": "r5IXBlTCGc",
    "forum_id": "r5IXBlTCGc"
  },
  "analysis_timestamp": "2026-01-06T06:41:39.394441"
}