{
  "prior_works": [
    {
      "title": "How Powerful are Graph Neural Networks?",
      "authors": "Keyulu Xu et al.",
      "year": 2019,
      "arxiv_id": "1810.00826",
      "role": "Foundation",
      "relationship_sentence": "This work formalized MPNN expressivity via 1-WL, providing the baseline framework that the paper quantitatively refines by showing how spectral invariants change homomorphism-counting power beyond the 1-WL regime."
    },
    {
      "title": "Weisfeiler and Leman Go Neural: Higher-Order Graph Neural Networks",
      "authors": "Christopher Morris et al.",
      "year": 2019,
      "arxiv_id": "1810.02244",
      "role": "Related Problem",
      "relationship_sentence": "By linking higher-order GNNs to k-WL and substructure counting, this paper established the homomorphism-counting lens for expressivity that is extended here to characterize what spectral-invariant architectures can exactly count."
    },
    {
      "title": "Provably Powerful Graph Networks",
      "authors": "Haggai Maron et al.",
      "year": 2019,
      "arxiv_id": "1905.11136",
      "role": "Inspiration",
      "relationship_sentence": "This work showed invariant/equivariant networks can implement explicit homomorphism counts of small templates, directly inspiring the present paper’s homomorphism-based proof technique to identify exactly-countable tree-like patterns with spectral invariants."
    },
    {
      "title": "Universal Invariant and Equivariant Graph Neural Networks",
      "authors": "Mathieu Keriven et al.",
      "year": 2019,
      "arxiv_id": "1905.10947",
      "role": "Foundation",
      "relationship_sentence": "Their characterization of invariant graph functions as (limits of) polynomial functions of adjacency/Laplacian underpins the paper’s use of spectral moments to derive precise homomorphism-counting capabilities."
    },
    {
      "title": "The Logical Expressiveness of Graph Neural Networks",
      "authors": "Pablo Barceló et al.",
      "year": 2021,
      "arxiv_id": "1905.13195",
      "role": "Gap Identification",
      "relationship_sentence": "By pinning MPNNs to C2 and exposing their inability to count many subgraphs, this paper motivates addressing that gap, which the current work fills by proving what additional homomorphism counts become exact when spectral invariants are used."
    },
    {
      "title": "Spectra of Graphs",
      "authors": "Andries E. Brouwer et al.",
      "year": 2011,
      "arxiv_id": null,
      "role": "Foundation",
      "relationship_sentence": "Classical spectral moment identities (e.g., sums of eigenvalue powers equaling closed-walk counts) provide the mathematical bridge the paper exploits to connect spectral invariants to exact homomorphism counts for specific tree-like templates."
    }
  ],
  "synthesis_narrative": "Xu et al. established that message-passing GNNs are bounded by 1-WL, motivating expressivity analyses in terms of structures these networks can or cannot distinguish. Morris et al. connected higher-order GNNs to k-WL and substructure counting, crystallizing a homomorphism-counting perspective for expressivity: certain architectures are exactly characterized by the graph templates whose homomorphisms they can count. Maron et al. demonstrated that invariant/equivariant architectures can implement explicit homomorphism polynomials, making homomorphism counts a constructive tool rather than just a characterization. Keriven and Peyré showed invariant graph functions arise as polynomial functions of adjacency/Laplacian, tying invariance to traces and spectral moments that encode structured walk counts. Barceló et al. formalized the logical limits of MPNNs in C2, highlighting their inability to count many subgraphs and calling for principled ways to surpass these limits. Finally, Brouwer and Haemers provided the spectral moment equalities linking eigenvalue power sums to closed-walk counts, the key algebraic identities connecting spectra to combinatorial counts.\nBringing these threads together, a natural opportunity emerges: use the polynomial/spectral viewpoint to translate spectral invariants into precise homomorphism-counting capabilities and quantify how this extends WL-bounded MPNNs. By leveraging spectral moment identities within the homomorphism-count framework pioneered for higher-order and invariant networks, the paper pinpoints a concrete, exactly-countable family—parallel trees—and derives a hierarchy across spectral-invariant architectural variants and depths. This synthesis turns the abstract promise of spectra into a rigorous, quantitative expressivity statement about what subgraphs spectral-invariant GNNs can exactly count.",
  "target_paper": {
    "title": "Homomorphism Expressivity of Spectral Invariant Graph Neural Networks",
    "authors": "Jingchu Gai, Yiheng Du, Bohang Zhang, Haggai Maron, Liwei Wang",
    "conference": "ICLR",
    "year": 2025,
    "presentation_type": "oral",
    "keywords": "Graph Neural Network, Expressive Power, Spectral Invariant, Graph Homomorphism, Weisfeiler-Lehman",
    "abstract": "Graph spectra are an important class of structural features on graphs that have shown promising results in enhancing Graph Neural Networks (GNNs). Despite their widespread practical use, the theoretical understanding of the power of spectral invariants --- particularly their contribution to GNNs --- remains incomplete. In this paper, we address this fundamental question through the lens of homomorphism expressivity, providing a comprehensive and quantitative analysis of the expressive power of spectral invariants. Specifically, we prove that spectral invariant GNNs can homomorphism-count exactly a class of specific tree-like graphs which we refer to as \\emph{parallel trees}. We highlight the significance of this result in various contexts, including establishing a quantitative expressiveness hierarchy across different architectural variants, offering insights into the impact of GNN depth, and understanding the subgraph counting capabilities of spectral invariant GNNs. In particular, ou",
    "openreview_id": "rdv6yeMFpn",
    "forum_id": "rdv6yeMFpn"
  },
  "analysis_timestamp": "2026-01-06T09:39:11.473210"
}