{
  "prior_works": [
    {
      "title": "Competitive Hebbian learning through spike-timing-dependent synaptic plasticity",
      "authors": "Song et al.",
      "year": 2000,
      "arxiv_id": null,
      "role": "Foundation",
      "relationship_sentence": "This work provides the specific STDP-based Hebbian mechanism that the paper uses in a spiking network to self-organize orientation selectivity and drive competition among connections."
    },
    {
      "title": "Models of orientation and ocular dominance column development: A critical comparison",
      "authors": "Erwin et al.",
      "year": 1995,
      "arxiv_id": null,
      "role": "Foundation",
      "relationship_sentence": "This comparison codified the canonical Hebbian framework with short-range excitation and long-range inhibition (Mexican-hat interactions) that the paper directly operationalizes in spiking form to produce pinwheels vs. salt-and-pepper regimes."
    },
    {
      "title": "Retinal origin of orientation maps in visual cortex",
      "authors": "Paik et al.",
      "year": 2011,
      "arxiv_id": null,
      "role": "Inspiration",
      "relationship_sentence": "By showing that the arrangement and overlap of ON/OFF retinal mosaics can determine orientation-map topology, this study directly motivates the model’s manipulation of input visual field overlap across species."
    },
    {
      "title": "Random wiring, ganglion cell mosaics, and the functional architecture of the visual cortex",
      "authors": "Schottdorf et al.",
      "year": 2014,
      "arxiv_id": "1304.7089",
      "role": "Gap Identification",
      "relationship_sentence": "This paper’s random-wiring account for rodent salt-and-pepper maps highlights the lack of a unified mechanistic learning explanation that the current work addresses with explicit spiking Hebbian dynamics and connectivity-range control."
    },
    {
      "title": "Universality in the evolution of orientation columns in the visual cortex",
      "authors": "Kaschube et al.",
      "year": 2010,
      "arxiv_id": null,
      "role": "Foundation",
      "relationship_sentence": "Their quantitative pinwheel statistics across columnar species provide the empirical constraints and evaluation targets the model uses to validate pinwheel-like structures under specific parameter regimes."
    },
    {
      "title": "Orientation preference patterns in mammalian visual cortex: a wire length minimization approach",
      "authors": "Koulakov et al.",
      "year": 2001,
      "arxiv_id": null,
      "role": "Related Problem",
      "relationship_sentence": "By linking intracortical wiring cost and connection range to pinwheel layout, this work informs the paper’s analysis of how localized connectivity versus long-range competition shape emergent map topology."
    }
  ],
  "synthesis_narrative": "Spike-timing-dependent plasticity introduced a concrete Hebbian mechanism for competitive synaptic modification, demonstrating how precise spike timing can self-organize selectivity and stabilize circuits through competition among inputs. Classic developmental map models established that Hebbian correlation learning combined with Mexican-hat lateral interactions—short-range excitation paired with longer-range inhibition—naturally yields orientation columns with pinwheels and defined how lateral interaction range sculpts map topology. Independently, a retinal-origin perspective showed that the arrangement and overlap of ON/OFF mosaics in the input can set the orientation map’s global organization, highlighting input overlap as a decisive factor. A random-wiring account then argued that in rodents, salt-and-pepper architecture can arise without structured learning, underscoring the need to reconcile species differences within a mechanistic framework. Quantitative analyses of columnar species revealed universal pinwheel statistics and robust layout features, providing stringent empirical targets for any mechanistic model. Finally, wiring-length minimization linked intracortical connection range and morphological constraints to pinwheel patterns, suggesting that structural parameters co-determine map topology. Together these works implied that orientation map organization depends jointly on Hebbian competition, lateral interaction scales, input overlap, and wiring constraints; yet a single mechanistic model spanning salt-and-pepper and pinwheel regimes was missing. Building on STDP-based Hebbian self-organization with explicit Mexican-hat interactions, parameterized by input overlap and connection range consistent with morphological constraints, the present study unifies these insights to reproduce both regimes and evaluates them against universal pinwheel statistics, thereby explaining how species-specific physiology tunes coding efficiency and robustness.",
  "target_paper": {
    "title": "Emergent Orientation Maps —— Mechanisms, Coding Efficiency and Robustness",
    "authors": "Haixin Zhong, Haoyu Wang, Wei P Dai, Yuchao Huang, Mingyi Huang, Rubin Wang, Anna Wang Roe, yuguo yu",
    "conference": "ICLR",
    "year": 2025,
    "presentation_type": "spotlight",
    "keywords": "Vision, Energy Efficient Coding, Neural Network, Sensory Coding, Spiking Mechanisms",
    "abstract": "Extensive experimental studies have shown that in lower mammals, neuronal orientation preference in the primary visual cortex is organized in disordered \"salt-and-pepper\" organizations. In contrast, higher-order mammals display a continuous variation in orientation preference, forming pinwheel-like structures. Despite these observations, the spiking mechanisms underlying the emergence of these distinct topological structures and their functional roles in visual processing remain poorly understood. To address this, we developed a self-evolving spiking neural network model with Hebbian plasticity, trained using physiological parameters characteristic of rodents, cats, and primates, including retinotopy, neuronal morphology, and connectivity patterns. Our results identify critical factors, such as the degree of input visual field overlap, neuronal connection range, and the balance between localized connectivity and long-range competition, that determine the emergence of either salt-and-pe",
    "openreview_id": "rySLejeB1k",
    "forum_id": "rySLejeB1k"
  },
  "analysis_timestamp": "2026-01-06T10:38:56.953510"
}