{
  "prior_works": [
    {
      "title": "Bypassing the Kohn–Sham equations with machine learning",
      "authors": "N. Brockherde et al.",
      "year": 2017,
      "arxiv_id": "1609.02815",
      "role": "Foundation",
      "relationship_sentence": "This work established learning electron density as a supervised task by mapping potentials to densities and energies, providing the conceptual and evaluative template for predicting full charge-density fields directly with machine learning."
    },
    {
      "title": "Big Data Meets Quantum Chemistry: The Δ-Machine Learning Approach",
      "authors": "R. Ramakrishnan et al.",
      "year": 2015,
      "arxiv_id": null,
      "role": "Foundation",
      "relationship_sentence": "It introduced Δ-learning to bridge low- and high-fidelity quantum methods, directly underpinning the strategy of pretraining on abundant PBE data and fine-tuning toward scarce HSE-level accuracy for charge density."
    },
    {
      "title": "Quantum chemical accuracy from machine learning with a small training set",
      "authors": "M. Bogojeski et al.",
      "year": 2020,
      "arxiv_id": null,
      "role": "Extension",
      "relationship_sentence": "By demonstrating multi-fidelity corrections and small-data fine-tuning to reach high-level quantum accuracy, this work concretely motivates the PBE-to-HSE transfer learning protocol used for enhanced-precision densities."
    },
    {
      "title": "The Materials Project: A materials genome approach to accelerating materials innovation",
      "authors": "A. Jain et al.",
      "year": 2013,
      "arxiv_id": null,
      "role": "Foundation",
      "relationship_sentence": "It established large-scale PBE-level DFT data and curation workflows for inorganic crystals, shaping the data assembly strategy and stability filters behind the large PBE charge-density corpus."
    },
    {
      "title": "JARVIS-DFT: A database for materials science",
      "authors": "K. Choudhary et al.",
      "year": 2018,
      "arxiv_id": null,
      "role": "Gap Identification",
      "relationship_sentence": "By pairing widespread PBE calculations with limited HSE evaluations for select properties but lacking comprehensive charge-density fields, it highlighted the multi-fidelity opportunity and the absence of HSE-level densities that this work explicitly fills."
    },
    {
      "title": "Crystal Graph Convolutional Neural Networks for an accurate and interpretable prediction of material properties",
      "authors": "T. Xie et al.",
      "year": 2018,
      "arxiv_id": "1710.10324",
      "role": "Baseline",
      "relationship_sentence": "CGCNN introduced the crystal-graph representation and message passing that serve here as the principal baseline architecture adapted to regress electron-density representations from periodic structures."
    },
    {
      "title": "Benchmarking materials property prediction methods: The Matbench test set and Automatminer reference",
      "authors": "A. Dunn et al.",
      "year": 2020,
      "arxiv_id": "2005.00707",
      "role": "Gap Identification",
      "relationship_sentence": "As the de facto materials ML benchmark suite without any electron-density targets, it exposed the benchmarking gap this work addresses by defining standardized charge-density prediction tasks."
    }
  ],
  "synthesis_narrative": "Brockherde et al. framed electron density prediction as a learnable map, proving that data-driven models can reproduce densities and associated energies without solving Kohn–Sham equations, and establishing practical metrics for assessing density fields. Ramakrishnan et al. introduced the Δ-learning principle to lift low-fidelity quantum estimates to high-fidelity targets, while Bogojeski et al. showed that multi-fidelity corrections and small-data fine-tuning can attain quantum-chemical accuracy efficiently. Jain et al.’s Materials Project demonstrated how large, carefully curated PBE-level DFT corpora for inorganic crystals enable scalable supervised learning, and Choudhary et al.’s JARVIS-DFT paired PBE with select HSE calculations, illustrating the value of multi-fidelity datasets yet leaving charge-density fields largely unexplored. Xie and Grossman’s CGCNN provided the dominant crystal-graph representation and message-passing baseline for learning from periodic materials, and Dunn et al.’s Matbench defined rigorous benchmarking practices in materials ML but omitted electron-density prediction tasks. Together these works revealed that electron densities are learnable targets, that multi-fidelity transfer can efficiently bridge accuracy gaps, and that large PBE-scale resources can seed models if complemented by scarce high-level data. The natural next step was to create a standardized, crystal-focused benchmark that operationalizes Δ-learning from PBE to HSE for full charge-density fields, leverages established crystal GNN baselines, and adheres to transparent benchmarking protocols. By assembling a large PBE charge-density corpus with a targeted HSE subset and designing tasks around pretraining-to-finetuning, the approach synthesizes these insights into a practical route to enhanced-precision density prediction in inorganic crystals.",
  "target_paper": {
    "title": "ECD: A Machine Learning Benchmark for Predicting Enhanced-Precision Electronic Charge Density in Crystalline Inorganic Materials",
    "authors": "Pin Chen, Zexin Xu, Qing Mo, Hongjin Zhong, Fengyang Xu, Yutong Lu",
    "conference": "ICLR",
    "year": 2025,
    "presentation_type": "oral",
    "keywords": "Electronic Charge Density, Crystalline Inorganic Materials, Graph Neural Network, Dataset",
    "abstract": "Supervised machine learning techniques are increasingly being adopted to speed up electronic structure predictions, serving as alternatives to first-principles methods like Density Functional Theory (DFT). Although current DFT datasets mainly emphasize chemical properties and atomic forces, the precise prediction of electronic charge density is essential for accurately determining a system's total energy and ground state properties. In this study, we introduce a novel electronic charge density dataset named ECD, which encompasses 140,646 stable crystal geometries with medium-precision Perdew–Burke–Ernzerhof (PBE) functional data. Within this dataset, a subset of 7,147 geometries includes high-precision electronic charge density data calculated using the Heyd–Scuseria–Ernzerhof (HSE) functional in DFT. By designing various benchmark tasks for crystalline materials and emphasizing training with large-scale PBE data while fine-tuning with a smaller subset of high-precision HSE data, we de",
    "openreview_id": "SBCMNc3Mq3",
    "forum_id": "SBCMNc3Mq3"
  },
  "analysis_timestamp": "2026-01-06T16:14:50.209612"
}