{
  "prior_works": [
    {
      "title": "Convergent sequences of dense graphs I: Subgraph frequencies, metric properties and testing",
      "authors": "Borgs et al.",
      "year": 2008,
      "role": "Foundation",
      "relationship_sentence": "Established the graphon framework, homomorphism densities, and the cut distance that this paper uses to formalize graphon-signal approximation and size-transferability."
    },
    {
      "title": "Large Networks and Graph Limits",
      "authors": "Lovász",
      "year": 2012,
      "role": "Foundation",
      "relationship_sentence": "Provides the canonical treatment of graphons and (decorated) homomorphism densities, directly underpinning the paper’s signal-weighted homomorphism densities and cut-metric analysis."
    },
    {
      "title": "Weisfeiler–Leman Tests for Graphons",
      "authors": "Böker et al.",
      "year": 2023,
      "role": "Foundation",
      "relationship_sentence": "Introduces the k-WL test in the graphon setting; the present work extends this to graphon-signal spaces and uses it as the expressivity benchmark for higher-order graphon networks."
    },
    {
      "title": "Invariant and Equivariant Graph Networks",
      "authors": "Maron et al.",
      "year": 2019,
      "role": "Foundation",
      "relationship_sentence": "Defines Invariant Graph Networks (IGNs) and their linear basis; this paper’s Invariant Graphon Networks (IWNs) are obtained by selecting the subset of IGN basis elements that induce bounded linear operators on graphons."
    },
    {
      "title": "Provably Powerful Graph Networks",
      "authors": "Maron et al.",
      "year": 2019,
      "role": "Related Problem",
      "relationship_sentence": "Connects higher-order invariant networks to k-WL power on finite graphs; the current work lifts this comparison to graphons by proving IWNs of order k are at least as powerful as k-WL on graphons."
    },
    {
      "title": "Universal Invariant and Equivariant Graph Neural Networks",
      "authors": "Keriven et al.",
      "year": 2019,
      "role": "Inspiration",
      "relationship_sentence": "Provides universal approximation results for invariant/equivariant graph functions via polynomial and homomorphism-based constructions, informing the paper’s Lp-universal approximation for graphon-signals."
    },
    {
      "title": "On the Expressive Power of Invariant Graph Networks",
      "authors": "Cai et al.",
      "year": 2022,
      "role": "Gap Identification",
      "relationship_sentence": "Analyzes IGN-small; this paper shows an even more restricted subset (bounded-operator basis) essentially matches that expressivity and extends the analysis from finite graphs to graphons with Lp guarantees."
    }
  ],
  "synthesis_narrative": "The paper’s core innovation—extending higher-order invariant graph networks to the graphon setting with Lp-approximation guarantees and k-WL-level expressivity—rests on two converging lines of work. On the graph limit side, Borgs et al. (2008) and Lovász (2012) provide the formal infrastructure of graphons, homomorphism densities, and the cut distance; these notions are repurposed here as signal-weighted homomorphism densities and as the metric foundation for approximation and transferability claims. Böker (2023) brings the Weisfeiler–Leman hierarchy to graphons; the present paper directly extends this to incorporate node signals and uses it as the expressivity yardstick to show that k-order IWNs match k-WL on graphons. On the higher-order GNN side, Maron et al. (2019) introduced Invariant Graph Networks and their linear basis; this work defines Invariant Graphon Networks by selecting the subset of basis elements corresponding to bounded operators in the graphon space. Maron et al. (2019, Provably Powerful) links higher-order networks to k-WL on finite graphs, a relationship this paper transposes to graphons. Keriven and Peyré (2019) provide universal approximation blueprints for invariant/equivariant mappings, which inform the Lp-universality proofs in the graphon-signal setting. Finally, Cai and Wang (2022) identify and analyze the restricted IGN-small class; this paper both closes a gap—showing an even smaller bounded-operator subset retains comparable power—and extends that expressivity theory from finite graphs to graphons.",
  "analysis_timestamp": "2026-01-06T23:09:26.605811"
}