{
  "prior_works": [
    {
      "title": "Query-Efficient Hard-Label Black-Box Attack: An Optimization-Based Approach",
      "authors": "Minhao Cheng et al.",
      "year": 2019,
      "role": "Foundation",
      "relationship_sentence": "This paper introduced the ray-based hard-label formulation g(θ)—the distance to the decision boundary along a ray computed via binary search—which is exactly the optimization objective the current work accelerates."
    },
    {
      "title": "Sign-OPT: A Query-Efficient Hard-Label Adversarial Attack",
      "authors": "Minhao Cheng et al.",
      "year": 2020,
      "role": "Baseline",
      "relationship_sentence": "Sign-OPT proposed the 'sign trick' gradient estimator for the ray objective; the present paper analyzes this estimator’s quality and replaces it with a prior-guided, projection-based estimator using transfer priors."
    },
    {
      "title": "RayS: A Ray Searching Method for Hard-Label Adversarial Attack",
      "authors": "Chen et al.",
      "year": 2020,
      "role": "Related Problem",
      "relationship_sentence": "RayS established ray search as a powerful hard-label baseline; the current work targets the same ray-minimization paradigm but boosts direction updates by integrating transfer-based priors into gradient estimation."
    },
    {
      "title": "HopSkipJumpAttack: A Query-Efficient Decision-Based Attack",
      "authors": "Jianbo Chen et al.",
      "year": 2020,
      "role": "Related Problem",
      "relationship_sentence": "HSJA refined decision-only gradient estimation with binary search for boundary distance; the present work adopts the same binary search evaluation of ray radii while addressing query cost via prior-informed gradients."
    },
    {
      "title": "Prior Convictions: Black-box Adversarial Attacks with Bandits and Priors",
      "authors": "Andrew Ilyas et al.",
      "year": 2019,
      "role": "Inspiration",
      "relationship_sentence": "This work introduced injecting explicit priors into zeroth-order gradient estimation to reduce variance; the present paper adapts this idea to the hard-label ray objective by projecting gradients onto transfer-based prior subspaces."
    },
    {
      "title": "P-RGF: A Prior-Guided Random Gradient-Free Attack",
      "authors": "Guo et al.",
      "year": 2020,
      "role": "Extension",
      "relationship_sentence": "P-RGF showed how surrogate gradients can serve as transferable priors to guide gradient-free estimation; the current work extends this mechanism to label-only ray-search by integrating surrogate-based priors into the estimator with theoretical guarantees."
    }
  ],
  "synthesis_narrative": "The core innovation of this paper builds squarely on the ray-based formulation of hard-label attacks introduced by OPT (Cheng et al., 2019), which turns decision-only attacks into a continuous optimization problem g(θ) given by the distance to the adversarial region along a ray, measured via binary search. Sign-OPT (Cheng et al., 2020) then provided the key practical tool—the sign-based gradient estimator for g(θ)—that made this formulation query-efficient; the present work directly interrogates that estimator’s quality and replaces it with a theoretically grounded, prior-guided alternative. Parallel advances in decision-based attacks, notably HSJA, reinforced binary search for boundary evaluation and efficient decision-only gradient estimation, practices that underpin how g(θ) is evaluated here. RayS further cemented ray searching as a strong baseline for hard-label attacks, highlighting that the efficiency bottleneck lies in how directions are chosen and updated—precisely the locus of this paper’s improvement. The conceptual leap comes from the line of work on priors for black-box gradient estimation: Bandits with Priors (Ilyas et al., 2019) showed that injecting structured priors dramatically reduces estimator variance, while P-RGF (Guo et al., 2020) demonstrated that surrogate-model gradients can be used as transfer-based priors within random gradient-free methods. The present paper directly extends these insights to the hard-label ray objective, proposing a projection-based integration of surrogate priors into the gradient estimator, thereby improving ray search efficiency both theoretically and empirically.",
  "analysis_timestamp": "2026-01-06T23:09:26.595011"
}