{
  "prior_works": [
    {
      "title": "GraphRNN: Generating Realistic Graphs with Deep Auto-regressive Models",
      "authors": "Jiaxuan You et al.",
      "year": 2018,
      "arxiv_id": "1802.08773",
      "role": "Baseline",
      "relationship_sentence": "This work is the main static graph-generation baseline whose sequential structure modeling THePUff must outperform and generalize beyond to handle temporal, heterogeneous graphs efficiently."
    },
    {
      "title": "NetGAN: Generating Graphs via Random Walks",
      "authors": "Aleksandar Bojchevski et al.",
      "year": 2018,
      "arxiv_id": "1803.00816",
      "role": "Baseline",
      "relationship_sentence": "NetGAN’s random-walk-based synthesis is a primary comparator that THePUff directly improves upon by moving from static homogeneous generation to privacy-preserving temporal heterogeneous graph generation."
    },
    {
      "title": "DyRep: Learning Representations over Dynamic Graphs",
      "authors": "Rakshit Trivedi et al.",
      "year": 2019,
      "arxiv_id": "1809.02657",
      "role": "Foundation",
      "relationship_sentence": "DyRep’s continuous-time relational event modeling (via conditional intensities for typed interactions) underpins the temporal edge-generation mechanism that THePUff adapts to synthesize time-stamped, relation-typed edges."
    },
    {
      "title": "Temporal Graph Networks for Deep Learning on Dynamic Graphs",
      "authors": "Emanuele Rossi et al.",
      "year": 2020,
      "arxiv_id": "2006.10637",
      "role": "Related Problem",
      "relationship_sentence": "TGN introduced history-aware temporal message passing that THePUff leverages conceptually to encode temporal contexts when parameterizing its generative process for dynamic, typed interactions."
    },
    {
      "title": "PATE-GAN: Generating Synthetic Data with Differential Privacy",
      "authors": "Graham J. G. Jordon et al.",
      "year": 2018,
      "arxiv_id": "1811.00713",
      "role": "Inspiration",
      "relationship_sentence": "PATE-GAN’s idea of combining a privatized view with limited guidance derived from original data motivates THePUff’s use of both a differentially perturbed graph and original signals to boost utility under DP."
    },
    {
      "title": "PrivBayes: Private Data Release via Bayesian Networks",
      "authors": "Jun Zhang et al.",
      "year": 2014,
      "arxiv_id": null,
      "role": "Foundation",
      "relationship_sentence": "PrivBayes established the perturb-then-synthesize pipeline for DP data generation, which THePUff generalizes from tabular Bayesian networks to temporal heterogeneous graph synthesis."
    },
    {
      "title": "Differentially Private Exponential Random Graph Estimation",
      "authors": "Krishna Karwa and Aleksandra B. Slavković",
      "year": 2016,
      "arxiv_id": null,
      "role": "Foundation",
      "relationship_sentence": "This work formalized edge-level randomized response mechanisms for networks, which THePUff extends to a DP perturbation tailored to time-stamped, relation-typed edges with temporal composition."
    },
    {
      "title": "Mining Heterogeneous Information Networks: Principles and Methodologies",
      "authors": "Yizhou Sun and Jiawei Han",
      "year": 2012,
      "arxiv_id": null,
      "role": "Foundation",
      "relationship_sentence": "This monograph defined the heterogeneous information network formalism (typed nodes/edges and meta-relations) that THePUff adopts as the core problem setting for heterogeneous temporal graph generation."
    }
  ],
  "synthesis_narrative": "Autoregressive graph generators like GraphRNN demonstrated how to synthesize realistic structures by sequentially adding nodes and edges, while NetGAN showed that random-walk distributions can drive plausible edge sampling, establishing strong but static, homogeneous baselines. DyRep introduced continuous-time relational event modeling with conditional intensities over node embeddings to capture when and which typed interactions occur, and Temporal Graph Networks contributed history-aware message passing with temporal memory to encode evolving contexts for dynamic edges. In the privacy domain, PrivBayes pioneered a perturb-then-synthesize pipeline that achieves differential privacy by first privatizing sufficient statistics before training a generator, and PATE-GAN revealed how privatized supervision can be combined with limited information from original data through teacher–student transfer to reclaim utility under DP. For graph-specific privacy, Karwa and Slavković formalized network-relevant randomized response and edge-DP machinery, while the heterogeneous information network framework of Sun and Han established the schema-level formalism for typed nodes, edges, and meta-relations.\nBringing these strands together reveals a gap: existing generators lack temporality and heterogeneity, DP graph methods target static homogeneous settings, and DP synthetic data techniques don’t capture relational-temporal dependencies. The natural next step is a DP mechanism that perturbs time-stamped, relation-typed edges with proper temporal composition, coupled with a continuous-time, history-aware generator that models typed interactions. By combining a privatized graph view with carefully constrained original-data guidance, one can recover utility and scalability, yielding an efficient, privacy-preserving generator for temporal heterogeneous graphs.",
  "target_paper": {
    "title": "Temporal Heterogeneous Graph Generation with Privacy, Utility, and Efficiency",
    "authors": "Xinyu He, Dongqi Fu, Hanghang Tong, Ross Maciejewski, Jingrui He",
    "conference": "ICLR",
    "year": 2025,
    "presentation_type": "spotlight",
    "keywords": "Temporal Graph, Heterogeneous Graph, Graph Generation",
    "abstract": "Nowadays, temporal heterogeneous graphs attract much research and industrial attention for building the next-generation Relational Deep Learning models and applications, due to their informative structures and features. While providing timely and precise services like personalized recommendations and question answering, this rich information also introduces extra exposure risk for each node in the graph. The distinctive local topology, the abundant heterogeneous features, and the time dimension of the graph data are more prone to expose sensitive information and narrow down the scope of victim candidates, which calls for well-defined protection techniques on graphs. To this end, we propose a Temporal Heterogeneous Graph Generator balancing Privacy, Utility, and Efficiency, named THePUff. More specifically, we first propose a differential privacy algorithm to perturb the input temporal heterogeneous graph for protecting privacy, and then utilize both the perturbed graph and the original",
    "openreview_id": "tj5xJInWty",
    "forum_id": "tj5xJInWty"
  },
  "analysis_timestamp": "2026-01-06T11:34:59.893689"
}