{
  "prior_works": [
    {
      "title": "SchNOrb: Unifying machine learning and quantum chemistry with a deep neural network for molecular orbitals",
      "authors": "Kristof T. Schütt et al.",
      "year": 2019,
      "arxiv_id": null,
      "role": "Extension",
      "relationship_sentence": "This work directly extends SchNOrb’s idea of learning AO-space Kohn–Sham operators and orbital/wavefunction information with an equivariant network, addressing SchNOrb’s small-molecule scaling limits by using a much larger AO-labeled corpus and introducing a physics-derived loss to enforce ground-state physicality."
    },
    {
      "title": "OrbNet: Deep learning for quantum chemistry using symmetry-adapted atomic-orbital features",
      "authors": "Yifan Qiao et al.",
      "year": 2020,
      "arxiv_id": null,
      "role": "Related Problem",
      "relationship_sentence": "This paper adopts OrbNet’s AO-centric, symmetry-adapted representation to scale learning with basis-function features, but pivots the prediction target from energies to full Kohn–Sham Hamiltonians to recover ground-state properties."
    },
    {
      "title": "PubChemQC Project: A large-scale first-principles electronic structure database for molecules",
      "authors": "Masayuki Nakata and Tomoki Shimazaki",
      "year": 2017,
      "arxiv_id": null,
      "role": "Foundation",
      "relationship_sentence": "The construction of PubChemQH follows PubChemQC’s large-scale DFT-at-scale pipeline over PubChem molecules, extending it to include Hamiltonian annotations to supply the volume and diversity needed for scalable Hamiltonian learning."
    },
    {
      "title": "Bypassing the Kohn–Sham equations with machine learning",
      "authors": "Felix Brockherde et al.",
      "year": 2017,
      "arxiv_id": null,
      "role": "Inspiration",
      "relationship_sentence": "This work motivated physics-informed supervision for electronic-structure ML; the new Wavefunction-derived objective similarly aligns predicted electronic structure with physically constrained quantities rather than minimizing naive element-wise errors."
    },
    {
      "title": "Pushing the frontiers of density functionals by solving the fractional electron problem (DM21)",
      "authors": "James Kirkpatrick et al.",
      "year": 2021,
      "arxiv_id": null,
      "role": "Inspiration",
      "relationship_sentence": "DM21 showed that constraint-driven, physics-based training objectives mitigate known DFT pathologies, directly inspiring a physically derived loss to prevent non-physical ground states when predicting Kohn–Sham Hamiltonians."
    },
    {
      "title": "E(n) Equivariant Graph Neural Networks",
      "authors": "Victor Garcia Satorras et al.",
      "year": 2021,
      "arxiv_id": "2102.09844",
      "role": "Foundation",
      "relationship_sentence": "EGNN provides the equivariant message-passing backbone to encode roto-translational symmetries of AO centers, enabling pairwise outputs that transform consistently with Hamiltonian tensor symmetries and thus serving as the architectural base."
    }
  ],
  "synthesis_narrative": "SchNOrb introduced the idea of directly learning Kohn–Sham operators and wavefunction information in the atomic-orbital basis with symmetry-aware neural networks, and enforced basic orbital orthonormality through tailored losses, but was limited to small molecules and modest datasets. OrbNet demonstrated that symmetry-adapted atomic-orbital features provide a scalable, AO-centric representation for learning quantum-chemical observables across large and chemically diverse corpora, though it targeted energies rather than the operators underlying ground-state properties. The PubChemQC project established a practical pipeline for large-scale, PubChem-wide first-principles computation, showing how to assemble massive, standardized molecular quantum datasets at scale. Earlier, work on bypassing Kohn–Sham with machine learning advocated physics-informed supervision, targeting electron-density and related quantities rather than purely data-fit losses. More recently, DM21 showed that embedding hard physical constraints into the learning objective reduces well-known DFT pathologies, improving generalization and physical fidelity. Finally, EGNN provided a light-weight, scalable equivariant message-passing architecture that encodes roto-translational symmetry for 3D molecular graphs and supports tensorial outputs compatible with operator symmetries.\nTaken together, these works reveal both the representation and architectural ingredients needed to predict operator-level quantities and the importance of physics-derived objectives for robustness, while also exposing two gaps: prior Hamiltonian predictors struggled to scale and energy-focused AO models did not recover operators or enforce ground-state physicality. By marrying an AO-centric, equivariant architecture with a PubChem-scale dataset and a constraint-driven loss aligned with wavefunction-derived observables, the present work naturally emerges as the next step to deliver scalable, physically faithful Kohn–Sham Hamiltonian prediction.",
  "target_paper": {
    "title": "Enhancing the Scalability and Applicability of Kohn-Sham Hamiltonians for Molecular Systems",
    "authors": "Yunyang Li, Zaishuo Xia, Lin Huang, Xinran Wei, Samuel Harshe, Han Yang, Erpai Luo, Zun Wang, Jia Zhang, Chang Liu, Bin Shao, Mark Gerstein",
    "conference": "ICLR",
    "year": 2025,
    "presentation_type": "spotlight",
    "keywords": "AI for Science, Quantum Chemistry, EGNN",
    "abstract": "Density Functional Theory (DFT) is a pivotal method within quantum chemistry and materials science, with its core involving the construction and solution of the Kohn-Sham Hamiltonian. Despite its importance, the application of DFT is frequently limited by the substantial computational resources required to construct the Kohn-Sham Hamiltonian. In response to these limitations, current research has employed deep-learning models to efficiently predict molecular and solid Hamiltonians, with roto-translational symmetries encoded in their neural networks. However, the scalability of prior models may be problematic when applied to large molecules, resulting in non-physical predictions of ground-state properties. In this study, we generate a substantially larger training set (PubChemQH) than used previously and use it to create a scalable model for DFT calculations with physical accuracy. For our model, we introduce a loss function derived from physical principles, which we call Wavefunction A",
    "openreview_id": "twEvvkQqPS",
    "forum_id": "twEvvkQqPS"
  },
  "analysis_timestamp": "2026-01-06T19:52:54.178183"
}