{
  "prior_works": [
    {
      "title": "Minimal representations of tropical rational functions",
      "authors": "Tran et al.",
      "year": 2024,
      "role": "Gap Identification",
      "relationship_sentence": "The paper explicitly targets and disproves a recent minimality approach proposed by Tran and Wang for tropical rational (difference-of-convex CPWL) representations, motivating the authors’ alternative polyhedral characterization of decompositions via an intersection of two translated cones."
    },
    {
      "title": "On functions representable as a difference of convex functions",
      "authors": "Hartman et al.",
      "year": 1959,
      "role": "Foundation",
      "relationship_sentence": "Hartman’s classical DC representation theorem underpins the existence and framing of DC decompositions, which this work specializes to CPWL functions and refines by characterizing all such decompositions (for a fixed complex) as a specific polyhedron whose vertices capture minimal solutions."
    },
    {
      "title": "Introduction to Toric Varieties",
      "authors": "Fulton et al.",
      "year": 1993,
      "role": "Foundation",
      "relationship_sentence": "Toric geometry’s support-function viewpoint shows that convex piecewise-linear functions on a fixed fan/polyhedral complex form a rational polyhedral cone; the present paper leverages this cone-of-convex-CPWL structure and extends it to DC decompositions by proving the set of decompositions is the intersection of two translated such cones."
    },
    {
      "title": "Submodular functions and convexity",
      "authors": "Lovász et al.",
      "year": 1983,
      "role": "Foundation",
      "relationship_sentence": "Lovász’s extension connects submodular set functions to convex CPWL functions, providing a canonical bridge between discrete submodularity and polyhedral convexity that the authors exploit when relating decompositions, bounded faces, and minimality within their decomposition polyhedron."
    },
    {
      "title": "Submodular functions, matroids, and certain polyhedra",
      "authors": "Edmonds et al.",
      "year": 1970,
      "role": "Foundation",
      "relationship_sentence": "Edmonds’ base polyhedron framework for submodular functions informs the paper’s identification of irreducible/minimal structures with bounded faces/vertices of a polyhedron, mirroring classical correspondences between extremal polyhedral geometry and combinatorial convexity."
    },
    {
      "title": "Algorithms for approximate minimization of the difference between submodular functions",
      "authors": "Iyer et al.",
      "year": 2012,
      "role": "Related Problem",
      "relationship_sentence": "Work on DS (difference-of-submodular) decompositions and their polyhedral underpinnings motivates treating CPWL DC decompositions through polyhedral lenses; the present paper generalizes this discrete-to-continuous pathway by giving an explicit polyhedral characterization for CPWL over fixed complexes."
    },
    {
      "title": "Tropical Geometry of Deep Neural Networks",
      "authors": "Zhang et al.",
      "year": 2018,
      "role": "Inspiration",
      "relationship_sentence": "By showing ReLU networks compute tropical rational (difference-of-convex CPWL) functions, this work directly motivates the quest for minimal-piece DC decompositions in learning, which the present paper addresses via a new decomposition polyhedron and vertex-minimality characterization."
    }
  ],
  "synthesis_narrative": "This paper’s core innovation—modeling all DC decompositions of a CPWL function (over a fixed polyhedral complex) as a polyhedron given by the intersection of two translated cones, and linking irreducible/minimal decompositions to bounded faces/vertices—emerges from a precise lineage. Hartman’s DC representation theorem lays the conceptual foundation that nonconvex functions can be expressed as differences of convex ones. Fulton’s toric support-function framework provides the structural fact that convex CPWL functions compatible with a fixed complex form a rational polyhedral cone, the exact geometric object the authors translate and intersect to parametrize DC decompositions. Lovász’s extension and Edmonds’ base polyhedron connect discrete submodularity to convex CPWL geometry and extremal polyhedral structure, directly informing the paper’s correspondence between irreducibility/minimality and bounded faces/vertices of the decomposition polyhedron. On the algorithmic/related-problem side, Iyer and Bilmes’s DS decomposition work motivates a polyhedral treatment of difference-type decompositions, which this paper elevates from discrete to continuous CPWL settings. Finally, Zhang–Naitzat–Lim’s tropical characterization of ReLU networks frames CPWL/DC decompositions as central to neural network theory, while Tran and Wang’s recent minimal-representation proposal highlights a gap the authors address by disproving that approach and replacing it with a correct polyhedral characterization tied to minimal-piece solutions.",
  "analysis_timestamp": "2026-01-06T23:09:26.611472"
}