{
  "prior_works": [
    {
      "title": "Learning-Augmented Streaming Algorithms for Frequency Estimation",
      "authors": "Hsu et al.",
      "year": 2019,
      "arxiv_id": null,
      "role": "Inspiration",
      "relationship_sentence": "They introduced the learning-augmented framework for frequency estimation via learned Count-Min/CountSketch, whose idea of coupling predictions with streaming sketches directly motivates replacing the sketching primitive with a prediction-aware Misra–Gries and extending the paradigm to matrix sketching."
    },
    {
      "title": "Finding Repeated Elements",
      "authors": "Misra et al.",
      "year": 1982,
      "arxiv_id": null,
      "role": "Extension",
      "relationship_sentence": "The paper builds a learning-augmented variant of the Misra–Gries heavy-hitters algorithm by using predictions to seed/protect counters, directly extending MG’s deterministic decrementing mechanism to obtain better error when predictions are accurate while preserving worst-case guarantees."
    },
    {
      "title": "An Improved Data Stream Summary: The Count-Min Sketch and its Applications",
      "authors": "Cormode et al.",
      "year": 2005,
      "arxiv_id": null,
      "role": "Baseline",
      "relationship_sentence": "Learned Count-Min from Hsu et al. is the primary baseline the new method surpasses; the paper explicitly targets and removes Count-Min’s collision-induced bias by replacing hashing with a prediction-aware MG design."
    },
    {
      "title": "Finding frequent items in data streams",
      "authors": "Charikar et al.",
      "year": 2002,
      "arxiv_id": null,
      "role": "Baseline",
      "relationship_sentence": "The learned CountSketch baseline (from Hsu et al.) motivates the new approach’s move away from randomized signs and hash collisions, with the proposed learned MG providing tighter, deterministic error-vs-prediction guarantees."
    },
    {
      "title": "Simple and Deterministic Matrix Sketching (Frequent Directions)",
      "authors": "Liberty",
      "year": 2013,
      "arxiv_id": null,
      "role": "Foundation",
      "relationship_sentence": "Frequent Directions provides the deterministic matrix sketching primitive that the paper augments with predictions, guiding the sketch toward predicted high-variance directions while retaining FD-style worst-case guarantees."
    },
    {
      "title": "Frequent Directions: Simple and Deterministic Matrix Sketching",
      "authors": "Ghashami et al.",
      "year": 2016,
      "arxiv_id": null,
      "role": "Extension",
      "relationship_sentence": "Their refined covariance/spectral error analysis and shrinkage proof techniques are directly used to analyze the learning-augmented FD variant, ensuring prediction adaptivity without sacrificing FD’s worst-case errors."
    }
  ],
  "synthesis_narrative": "Learning-augmented frequency estimation was crystallized by Hsu et al., who coupled predictions with Count-Min/CountSketch and proved error that improves with prediction quality while maintaining streaming guarantees. Misra and Gries introduced a deterministic counter-based heavy hitters scheme whose decrement-and-replace structure yields strong worst-case l1 guarantees and a natural mechanism to prioritize specific items. Count-Min offered a compact hashing-based summary but incurs collision-induced bias that persists even with learned prioritization, while CountSketch reduces bias via random signs but introduces variance that learned allocation cannot eliminate. For low-rank approximation, Liberty’s Frequent Directions provided a deterministic matrix sketch using shrinkage on singular values to control covariance error, establishing a robust primitive for adversarial streams. Ghashami et al. tightened FD’s covariance/spectral error analysis and clarified how uniform shrinkage ensures worst-case bounds, offering proof tools and metrics that benchmark any modification to FD.\nTogether, these works exposed a clear opportunity: learned Count-Min/CountSketch benefit from predictions but remain limited by hashing noise, while deterministic primitives (Misra–Gries, Frequent Directions) provide stable structure that could directly exploit predictions without randomness. The current paper synthesizes these insights by designing a prediction-aware Misra–Gries that seeds/protects counters based on learned heavy hitters, eliminating collision-driven error, and by developing a learning-augmented Frequent Directions that steers shrinkage toward predicted high-variance subspaces. Leveraging FD’s analysis (via Ghashami et al.) and the learning-augmented paradigm (Hsu et al.), the paper attains improved error when predictions are accurate while preserving worst-case streaming guarantees.",
  "target_paper": {
    "title": "Learning-Augmented Frequent Directions",
    "authors": "Anders Aamand, Justin Y. Chen, Siddharth Gollapudi, Sandeep Silwal, Hao WU",
    "conference": "ICLR",
    "year": 2025,
    "presentation_type": "spotlight",
    "keywords": "learning-augmented algorithms, algorithms with predictions, data streams, streaming algorithms, frequency estimation, heavy hitters, frequent directions, low-rank approximation",
    "abstract": "An influential paper of Hsu et al. (ICLR'19) introduced the study of learning-augmented streaming algorithms in the context of frequency estimation. A fundamental problem in the streaming literature, the goal of frequency estimation is to approximate the number of occurrences of items appearing in a long stream of data using only a small amount of memory. Hsu et al. develop a natural framework to combine the worst-case guarantees of popular solutions such as CountMin and CountSketch with learned predictions of high frequency elements. They demonstrate that learning the underlying structure of data can be used to yield better streaming algorithms, both in theory and practice.\n\nWe simplify and generalize past work on learning-augmented frequency estimation. Our first contribution is a learning-augmented variant of the Misra-Gries algorithm which improves upon the error of learned CountMin and learned CountSketch and achieves the state-of-the-art performance of randomized algorithms (Aama",
    "openreview_id": "WcZLG8XxhD",
    "forum_id": "WcZLG8XxhD"
  },
  "analysis_timestamp": "2026-01-06T06:57:55.388099"
}