{
  "prior_works": [
    {
      "title": "Diffusion Schrödinger Bridge with Applications to Score-Based Generative Modeling",
      "authors": "De Bortoli et al.",
      "year": 2021,
      "arxiv_id": null,
      "role": "Baseline",
      "relationship_sentence": "This work operationalized Schrödinger bridges for distribution matching using Euclidean Brownian reference dynamics, which our paper directly replaces with topology-aware heat diffusion to bring SB methods to graphs and simplicial complexes."
    },
    {
      "title": "Steering Between Gaussians via Schrödinger Bridges",
      "authors": "Chen et al.",
      "year": 2016,
      "arxiv_id": null,
      "role": "Extension",
      "relationship_sentence": "We generalize the linear-Gaussian SB closed-form (Riccati/covariance steering) of Chen–Georgiou–Pavon by instantiating the linear operator with the Hodge Laplacian that governs topological heat diffusion, yielding a closed-form topological Gaussian bridge with explicit time-marginals and SDE."
    },
    {
      "title": "Random walks on simplicial complexes and the normalized Hodge Laplacian",
      "authors": "Schaub et al.",
      "year": 2020,
      "arxiv_id": null,
      "role": "Foundation",
      "relationship_sentence": "Their construction of topology-aware diffusion via the (normalized) Hodge Laplacian provides the exact stochastic dynamics we adopt as the reference process for the Topological Schrödinger Bridge."
    },
    {
      "title": "Topological Signal Processing over Simplicial Complexes",
      "authors": "Barbarossa et al.",
      "year": 2020,
      "arxiv_id": null,
      "role": "Foundation",
      "relationship_sentence": "This paper formalizes cochain signal spaces (nodes, edges, faces) and the topological heat equation, which we use as the state space and linear dynamics on which our bridge evolves."
    },
    {
      "title": "Entropic Interpolations on Discrete Spaces",
      "authors": "Erbar et al.",
      "year": 2020,
      "arxiv_id": null,
      "role": "Gap Identification",
      "relationship_sentence": "By developing Schrödinger bridges for finite-state Markov chains (node-level graphs), this work highlights the limitation to scalar node distributions, which we address by extending SB to higher-order simplicial signals and topology-aware dynamics."
    },
    {
      "title": "Stochastic Interpolants: A Unifying Framework for Flows and Diffusions",
      "authors": "Albergo et al.",
      "year": 2023,
      "arxiv_id": null,
      "role": "Inspiration",
      "relationship_sentence": "Their bridge-based interpolation perspective that unifies flows and diffusions motivates our matching formulation while we endow the interpolant with topology-aware stochastic dynamics and derive a Gaussian closed form."
    }
  ],
  "synthesis_narrative": "Diffusion Schrödinger Bridge introduced a practical SB framework for distribution matching using Euclidean Brownian reference dynamics and score estimation, concretizing how one can learn paths between prescribed marginals in continuous spaces. Earlier, Chen, Georgiou, and Pavon derived closed-form linear–Gaussian bridges, showing that when the reference dynamics are linear with additive noise, one can compute time-marginals and drifts via covariance-steering Riccati equations. Independently, topological signal processing established that data on networks naturally live as cochains over simplicial complexes, and that their intrinsic diffusion is governed by Hodge Laplacians; Schaub and collaborators formalized topology-aware random walks and heat flow on edges and higher-order simplices through the normalized Hodge Laplacian, while Barbarossa and colleagues systematized cochain spaces and the topological heat equation. On discrete structures, Erbar and coauthors developed entropic interpolations (Schrödinger bridges) on finite Markov chains, clarifying how SB extends to graphs but essentially at the node (state) level. Albergo and collaborators framed stochastic interpolants that unify flows and diffusions via bridge-based drifts, highlighting a flexible path-space matching viewpoint.\nTogether these works exposed two opportunities: SB methods excel at path-space distribution matching but assumed Euclidean or node-level dynamics, whereas topology-aware diffusion naturally models signals and flows on simplicial complexes. The present paper fuses these threads by instantiating the SB reference dynamics with Hodge-Laplacian topological heat flow on cochains and then extending the linear–Gaussian bridge machinery to this operator, yielding closed-form topological Gaussian bridges (time-marginals and SDE) and a principled formulation for matching distributions on topological domains.",
  "target_paper": {
    "title": "Topological Schrödinger Bridge Matching",
    "authors": "Maosheng Yang",
    "conference": "ICLR",
    "year": 2025,
    "presentation_type": "spotlight",
    "keywords": "Schrödinger Bridge, Topological Signal Distribution Matching, Topological Stochastic Dynamics, Topological Generative Models",
    "abstract": "Given two boundary distributions, the \\emph{Schrödinger Bridge} (SB) problem seeks the “most likely” random evolution between them with respect to a reference process. It has revealed rich connections to recent machine learning methods for generative modeling and distribution matching. While these methods perform well in Euclidean domains, they are not directly applicable to topological domains such as graphs and simplicial complexes, which are crucial for data defined over network entities, such as node signals and edge flows. In this work, we propose the \\emph{Topological Schrödinger Bridge problem} ($\\mathcal{T}$SBP) for matching signal distributions on a topological domain. We set the reference process to follow some linear tractable \\emph{topology-aware} stochastic dynamics such as topological heat diffusion. For the case of Gaussian boundary distributions, we derive a \\emph{closed-form} topological SB ($\\mathcal{T}$SB) in terms of its time-marginal and stochastic differential. In",
    "openreview_id": "WzCEiBILHu",
    "forum_id": "WzCEiBILHu"
  },
  "analysis_timestamp": "2026-01-06T11:46:25.038611"
}