{
  "prior_works": [
    {
      "title": "CLEVR: A Diagnostic Dataset for Compositional Language and Elementary Visual Reasoning",
      "authors": "Johnson et al.",
      "year": 2017,
      "arxiv_id": "1612.06890",
      "role": "Foundation",
      "relationship_sentence": "CLEVR introduced procedurally generated scenes and compositional question programs to precisely probe visual-semantic reasoning, a blueprint this work adopts but re-centers on executable graphics programs to eliminate the vision front end."
    },
    {
      "title": "The Neuro-Symbolic Concept Learner: Interpreting Scenes, Words, and Sentences From Natural Supervision",
      "authors": "Mao et al.",
      "year": 2019,
      "arxiv_id": "1904.12584",
      "role": "Inspiration",
      "relationship_sentence": "NS-CL showed how executable symbolic programs can disentangle perception from reasoning, directly inspiring the idea to reason purely over the symbolic generative graphics program rather than rendered pixels."
    },
    {
      "title": "SCAN: Simplifying and Testing Systematic Generalization in Sequence-to-Sequence Models",
      "authors": "Lake and Baroni",
      "year": 2018,
      "arxiv_id": "1711.00350",
      "role": "Gap Identification",
      "relationship_sentence": "SCAN exposed failures of sequence models on compositional generalization, motivating the use of graphics programs to craft systematic splits that stress LLMs’ compositional spatial-semantic reasoning."
    },
    {
      "title": "On the Measure of Intelligence (ARC)",
      "authors": "Chollet",
      "year": 2019,
      "arxiv_id": "1911.01547",
      "role": "Gap Identification",
      "relationship_sentence": "ARC argued for contamination-resistant, procedurally generated abstraction tests, motivating the choice of symbolic graphics programs as a controllable domain unlikely to appear verbatim in LLM pretraining."
    },
    {
      "title": "CSGNet: Neural Shape Parser for Constructive Solid Geometry",
      "authors": "Sharma et al.",
      "year": 2018,
      "arxiv_id": "unknown",
      "role": "Foundation",
      "relationship_sentence": "CSGNet formalized 2D/3D shapes as executable CSG programs, providing the core notion that symbolic graphics programs carry precise geometric semantics that can be queried without images."
    },
    {
      "title": "DreamCoder: Growing Generalizable, Interpretable Knowledge with Wake-Sleep Program Induction",
      "authors": "Ellis et al.",
      "year": 2021,
      "arxiv_id": "2006.08381",
      "role": "Related Problem",
      "relationship_sentence": "DreamCoder demonstrated that graphics DSLs capture compositional structure enabling generalizable reasoning, informing the selection of vector/CSG-like primitives as a substrate for semantic querying."
    }
  ],
  "synthesis_narrative": "Procedurally generated worlds with compositional queries, as in CLEVR, established how to precisely probe visual-semantic reasoning using controllable scene generation and functional question programs. The neuro-symbolic concept learner (NS-CL) then showed that executable programs can cleanly separate perception from reasoning by operating over symbolic structures rather than raw pixels. SCAN revealed that sequence models struggle with systematic generalization, especially when compositional rules must be applied to novel combinations—an insight germane to constructing splits that target compositionality. ARC argued that robust intelligence evaluation demands procedurally generated, contamination-resistant tasks that rely on abstract reasoning rather than memorization, emphasizing careful domain design. From the graphics side, CSGNet formalized shapes as constructive solid geometry programs, making explicit that symbolic graphics programs encode exact geometric semantics. DreamCoder further demonstrated that graphics DSLs expose compositional regularities that support programmatic analysis and concept learning, underscoring the value of vector/CSG primitives for interpretable reasoning. Taken together, these works suggest a natural opportunity: use executable graphics programs themselves as the world model to test spatial-semantic reasoning without a vision encoder. By unifying CLEVR-style controlled compositional queries with ARC’s contamination-aware generation, leveraging NS-CL’s decoupling of perception and reasoning, and adopting CSG/DSL representations highlighted by CSGNet and DreamCoder, the present work formulates an evaluation where LLMs must “imagine” renderings from symbolic curve and stroke descriptions and answer semantics-rich questions, enabling targeted tests of compositional and spatial generalization.",
  "target_paper": {
    "title": "Can Large Language Models Understand Symbolic Graphics Programs?",
    "authors": "Zeju Qiu, Weiyang Liu, Haiwen Feng, Zhen Liu, Tim Z. Xiao, Katherine M. Collins, Joshua B. Tenenbaum, Adrian Weller, Michael J. Black, Bernhard Schölkopf",
    "conference": "ICLR",
    "year": 2025,
    "presentation_type": "spotlight",
    "keywords": "Large Language Models, Symbolic Graphics Programs",
    "abstract": "Against the backdrop of enthusiasm for large language models (LLMs), there is a growing need to scientifically assess their capabilities and shortcomings. This is nontrivial in part because it is difficult to find tasks which the models have not encountered during training. Utilizing symbolic graphics programs, we propose a domain well-suited to test multiple spatial-semantic reasoning skills of LLMs. Popular in computer graphics, these programs procedurally generate visual data. While LLMs exhibit impressive skills in general program synthesis and analysis, symbolic graphics programs offer a new layer of evaluation: they allow us to test an LLM's ability to answer semantic questions about the images or 3D geometries without a vision encoder. To semantically understand the symbolic programs, LLMs would need to possess the ability to \"imagine\" and reason how the corresponding graphics content would look with only the symbolic description of the local curvatures and strokes. We use this ",
    "openreview_id": "Yk87CwhBDx",
    "forum_id": "Yk87CwhBDx"
  },
  "analysis_timestamp": "2026-01-06T13:39:03.938605"
}