{
  "prior_works": [
    {
      "title": "Covariate-Assisted Spectral Clustering",
      "authors": "M. Binkiewicz et al.",
      "year": 2017,
      "arxiv_id": null,
      "role": "Inspiration",
      "relationship_sentence": "CASC showed that combining adjacency and covariate similarity in a joint spectral objective improves community recovery under contextual SBMs, directly inspiring JDR’s explicit alignment of leading eigenspaces of graph and feature matrices to guide rewiring and denoising."
    },
    {
      "title": "How to Learn a Graph from Smooth Signals",
      "authors": "V. Kalofolias",
      "year": 2016,
      "arxiv_id": null,
      "role": "Foundation",
      "relationship_sentence": "By formulating topology learning as choosing a graph whose Laplacian makes observed node features smooth, this work provides the optimization lens that JDR extends from smoothness to explicit spectral-space alignment for joint graph rewiring and feature denoising."
    },
    {
      "title": "Diffusion Improves Graph Learning",
      "authors": "J. Klicpera et al.",
      "year": 2019,
      "arxiv_id": "1911.05485",
      "role": "Baseline",
      "relationship_sentence": "GDC is a primary rewiring baseline that reweights edges via PPR/heat diffusion without using node attributes, a limitation JDR overcomes by steering rewiring through graph–feature spectral alignment."
    },
    {
      "title": "Learning Discrete Structures for Graph Neural Networks",
      "authors": "A. Franceschi et al.",
      "year": 2019,
      "arxiv_id": null,
      "role": "Gap Identification",
      "relationship_sentence": "LDS demonstrated that bilevel optimization can learn task-specific graph structure but is label-dependent and computationally heavy, motivating JDR’s unsupervised, closed-form spectral alignment as a scalable alternative for structure refinement."
    },
    {
      "title": "Graph Structure Learning for Robust Graph Neural Networks (Pro-GNN)",
      "authors": "W. Jin et al.",
      "year": 2020,
      "arxiv_id": null,
      "role": "Baseline",
      "relationship_sentence": "Pro-GNN jointly infers a clean graph using low-rank and sparsity with feature-smoothness regularization, whose homophily bias JDR addresses by aligning spectral subspaces to accommodate multi-class settings and heterophily while denoising features."
    },
    {
      "title": "Simplifying Graph Convolutional Networks",
      "authors": "F. Wu et al.",
      "year": 2019,
      "arxiv_id": "1902.07153",
      "role": "Inspiration",
      "relationship_sentence": "The Jaccard-based preprocessing heuristic prunes edges between nodes with dissimilar features, suggesting that structure–feature agreement should guide rewiring—a principle JDR formalizes by aligning leading spectral spaces rather than local pairwise similarities."
    },
    {
      "title": "Beyond Homophily in Graph Neural Networks: Current Limitations and Effective Designs",
      "authors": "Z. Zhu et al.",
      "year": 2020,
      "arxiv_id": null,
      "role": "Gap Identification",
      "relationship_sentence": "By pinpointing failures of smoothing-based GNNs and many rewiring techniques on heterophilous graphs and advocating frequency-aware designs, this work motivates JDR’s spectrum-alignment approach that remains effective across homophily and heterophily regimes."
    }
  ],
  "synthesis_narrative": "Covariate-Assisted Spectral Clustering established that incorporating node attributes by mixing covariate similarity with adjacency in a spectral objective can significantly improve community detection under contextual SBMs, highlighting the value of matching structural and attribute spectra. Complementing this, Kalofolias framed graph topology learning as finding a graph on which observed features are smooth, providing an optimization perspective for turning noisy attributes into graph-aware signals. Diffusion-based rewiring via personalized PageRank or heat kernels emerged as a strong, practical way to refine topology, albeit without leveraging node features. Bilevel graph structure learning further showed that task-driven topology inference is powerful but computationally demanding and dependent on labels. Robust GSL methods like Pro-GNN pursued joint graph recovery using low-rank and sparsity with feature smoothness priors, implicitly assuming homophily. Simple Jaccard pruning revealed that even heuristic, feature-guided edge edits can enhance learning by enforcing agreement between structure and attributes. Finally, the heterophily literature documented how smoothing-centric GNNs and many rewiring strategies falter when signal resides in higher frequencies, calling for frequency-aware alignment between features and graph. Against this backdrop, it was natural to synthesize a feature-aware, unsupervised alternative to diffusion and heavy bilevel GSL: align the leading spectral spaces of graph and feature matrices to guide both edge rewiring and feature denoising. This unifies CASC’s spectral fusion with signal-driven topology ideas, while addressing heterophily by aligning spectra rather than enforcing smoothness, and yields a scalable pre-processing that subsumes heuristic pruning and improves over feature-agnostic diffusion.",
  "target_paper": {
    "title": "Joint Graph Rewiring and Feature Denoising via Spectral Resonance",
    "authors": "Jonas Linkerhägner, Cheng Shi, Ivan Dokmanić",
    "conference": "ICLR",
    "year": 2025,
    "presentation_type": "oral",
    "keywords": "GNNs, Rewiring, Denoising, Spectral Resonance, cSBM",
    "abstract": "When learning from graph data, the graph and the node features both give noisy information about the node labels. In this paper we propose an algorithm to **j**ointly **d**enoise the features and **r**ewire the graph (JDR), which improves the performance of downstream node classification graph neural nets (GNNs). JDR works by aligning the leading spectral spaces of graph and feature matrices. It approximately solves the associated non-convex optimization problem in a way that handles graphs with multiple classes and different levels of homophily or heterophily. We theoretically justify JDR in a stylized setting and show that it consistently outperforms existing rewiring methods on a wide range of synthetic and real-world node classification tasks.",
    "openreview_id": "zBbZ2vdLzH",
    "forum_id": "zBbZ2vdLzH"
  },
  "analysis_timestamp": "2026-01-06T08:34:05.406774"
}