{
  "prior_works": [
    {
      "title": "AdWords and Generalized Online Matching",
      "authors": "Aranyak Mehta, Amin Saberi, Umesh Vazirani, Vijay Vazirani",
      "year": 2007,
      "role": "Foundational model and technique for online budgeted allocation via primal–dual/water-filling style algorithms.",
      "relationship_sentence": "The paper’s online resource-allocation setting and its use of distribution-aware, capacity-respecting policies build directly on the AdWords/online allocation framework, extending it with equity constraints and ex-ante/ex-post guarantees."
    },
    {
      "title": "Online Stochastic Matching: Beating 1−1/e",
      "authors": "Jon Feldman, Nikhil Korula, Vahab Mirrokni, Cliff Stein",
      "year": 2009,
      "role": "Introduced i.i.d./stochastic arrival models and ex-ante analysis for online allocation/matching.",
      "relationship_sentence": "The work’s reliance on known arrival distributions and ex-ante performance baselines for designing online policies directly follows the stochastic matching paradigm, which this paper augments with equity objectives."
    },
    {
      "title": "Fast Algorithms for Online Stochastic Convex Programming",
      "authors": "Shipra Agrawal, Nikhil R. Devanur",
      "year": 2014,
      "role": "General framework for solving online allocation as stochastic convex programs using primal-dual updates with distributional knowledge.",
      "relationship_sentence": "The paper operationalizes equity by casting proportional-share goals as convex constraints/objectives within a stochastic online optimization framework inspired by Agrawal–Devanur."
    },
    {
      "title": "Dominant Resource Fairness: Fair allocation of multiple resource types",
      "authors": "Ali Ghodsi, Matei Zaharia, Benjamin Hindman, Andy Konwinski, Scott Shenker, Ion Stoica",
      "year": 2011,
      "role": "Canonical fairness-by-demand principle for resource allocation (equalizing dominant shares).",
      "relationship_sentence": "The external equity notion—ensuring allocations proportional to heterogeneous demands—draws directly on DRF-style fairness-by-demand ideas, adapted here to sequential arrivals and stochastic guarantees."
    },
    {
      "title": "Rate control for communication networks: shadow prices, proportional fairness and stability",
      "authors": "Frank P. Kelly, Aman K. Maulloo, David K. H. Tan",
      "year": 1998,
      "role": "Introduced proportional fairness and the use of convex-analytic methods for equitable resource sharing.",
      "relationship_sentence": "The paper’s proportional-share equity targets and their convex formulation are conceptually grounded in proportional fairness, extended to online and group-constrained settings."
    },
    {
      "title": "Fairness in Learning: Classic and Contextual Bandits",
      "authors": "Matthew Joseph, Michael Kearns, Jamie Morgenstern, Aaron Roth",
      "year": 2016,
      "role": "Sequential decision-making with explicit fairness constraints and distinctions between ex-ante and realized notions of fairness.",
      "relationship_sentence": "The ex-ante/ex-post equity metrics in an online, sequential environment are informed by fairness-in-bandits formulations, which this paper repurposes for resource allocation rather than arm selection."
    },
    {
      "title": "A Reductions Approach to Fair Classification",
      "authors": "Alekh Agarwal, Alina Beygelzimer, Miroslav Dudík, John Langford, Hanna Wallach",
      "year": 2018,
      "role": "Optimization-based framework for enforcing group-parity constraints (e.g., demographic parity) via convex surrogates.",
      "relationship_sentence": "The internal equity model’s requirement that allocations track group proportions mirrors demographic-parity style constraints and motivates treating fairness as convex constraints inside an online optimizer."
    }
  ],
  "synthesis_narrative": "This paper fuses two mature lines of work—online resource allocation and formal fairness—to define and solve equity-driven allocation with sequential arrivals under distributional models. From the online allocation side, AdWords-style primal–dual methods and stochastic arrival models (Mehta et al.; Feldman et al.) supply the canonical setting: resources with capacities, heterogeneous agents, and ex-ante analysis relative to a stochastic benchmark. Agrawal–Devanur’s online stochastic convex programming provides the technical playbook for embedding additional structure—here, equity constraints—into distribution-aware primal–dual updates with concentration-based ex-post control.\nOn the fairness side, the external equity requirement (proportional-to-demand guarantees across arrival times) traces to proportional fairness and DRF: Kelly et al. establish convex formulations of proportional sharing, while DRF crystallizes fairness-by-demand in multi-resource environments; this paper adapts these principles to dynamic, stochastic arrivals and proves guarantees both in expectation (ex-ante) and on realized sequences (ex-post). The internal equity model maps group-level fairness to allocation: bandit fairness (Joseph et al.) clarifies ex-ante vs ex-post fairness in sequential decisions, and fair classification via reduction (Agarwal et al.) motivates implementing demographic-parity-like constraints as convex conditions that an online allocator can track. Together, these works enable the paper’s core contribution: principled online policies that achieve equitable resource shares proportional to demands or group prevalence, with rigorous ex-ante and ex-post guarantees under realistic stochastic arrival assumptions.",
  "analysis_timestamp": "2026-01-06T23:42:48.077371"
}