{
  "prior_works": [
    {
      "title": "Deep learning generalizes because the parameter-function map is biased towards simple functions",
      "authors": "Guillermo Valle-Pérez et al.",
      "year": 2018,
      "role": "Inspiration",
      "relationship_sentence": "Proposed that many more parameter settings implement simple functions than complex ones, directly motivating this paper’s core claim that a flat prior over parameters induces a non-uniform simplicity bias over functions."
    },
    {
      "title": "Neural networks are biased towards simple functions",
      "authors": "Samuel E. Mingard et al.",
      "year": 2020,
      "role": "Extension",
      "relationship_sentence": "Provided empirical and theoretical evidence quantifying the simplicity bias in neural networks, which this work extends to the conditional setting of interpolators and formalizes via the ‘narrow teacher’ lens."
    },
    {
      "title": "Bayesian Learning for Neural Networks",
      "authors": "Radford M. Neal",
      "year": 1996,
      "role": "Foundation",
      "relationship_sentence": "Established the foundational viewpoint that a distribution over parameters induces a prior over functions, a lens this paper adopts to analyze how a seemingly uniform parameter prior yields a rich, biased function prior."
    },
    {
      "title": "Deep Neural Networks as Gaussian Processes",
      "authors": "Jaehoon Lee et al.",
      "year": 2018,
      "role": "Foundation",
      "relationship_sentence": "Formalized the function-space perspective of randomly initialized networks, underpinning this paper’s argument that parameter redundancy drives a non-uniform function prior under ostensibly ‘flat’ parameter sampling."
    },
    {
      "title": "Reconciling modern machine-learning practice and the classical bias–variance trade-off",
      "authors": "Mikhail Belkin et al.",
      "year": 2019,
      "role": "Gap Identification",
      "relationship_sentence": "Framed the interpolation generalization puzzle (and double descent), the specific gap this paper addresses by proving that typical random interpolators generalize when a narrow teacher exists."
    },
    {
      "title": "Understanding deep learning requires rethinking generalization",
      "authors": "Chiyuan Zhang et al.",
      "year": 2017,
      "role": "Gap Identification",
      "relationship_sentence": "Showed that overparameterized networks can memorize yet still generalize, highlighting the need for a bias-based explanation that this paper supplies via the induced function prior from uniform parameters."
    },
    {
      "title": "Benign overfitting in linear regression",
      "authors": "Peter L. Bartlett et al.",
      "year": 2020,
      "role": "Related Problem",
      "relationship_sentence": "Characterized when interpolating linear models generalize due to low effective dimension, informing this paper’s ‘narrow teacher’ condition as the nonlinear neural-network analogue of small intrinsic complexity."
    }
  ],
  "synthesis_narrative": "The present work explains why a neural network sampled uniformly over parameters, conditioned on interpolating the data, can nonetheless generalize: a flat parameter prior induces a highly non-uniform prior over functions that favors simpler hypotheses, especially those implementable by narrow networks. This insight directly builds on the function-space view inaugurated by Neal (1996) and modernized by Lee et al. (2018), which assert that distributions over weights define priors over functions. Valle-Pérez et al. (2018) and Mingard et al. (2020) then argued and quantified that the parameter–function map is exponentially biased toward simple functions because many more parameter settings realize them—precisely the mechanism this paper formalizes for the conditional distribution over interpolators. The central motivation arises from the interpolation generalization puzzle articulated by Zhang et al. (2017) and Belkin et al. (2019): despite fitting the data exactly, overparameterized networks often generalize, a phenomenon this work explains without relying on optimization dynamics. Finally, the paper’s ‘narrow teacher’ assumption mirrors the low effective complexity conditions underpinning benign overfitting in linear models (Bartlett et al., 2020), translating that intuition to nonlinear networks: when labels are realizable by a smaller (narrow) network, the induced function prior concentrates mass on such simpler solutions. Together, these works directly shape the paper’s core innovation: a rigorous, function-prior explanation for why typical interpolating neural networks generalize under narrow teachers.",
  "analysis_timestamp": "2026-01-06T23:09:26.465446"
}