{
  "prior_works": [
    {
      "title": "Correlation Clustering",
      "authors": "Bansal et al.",
      "year": 2004,
      "role": "Foundation",
      "relationship_sentence": "Introduces the correlation clustering problem and the disagreements objective on complete signed graphs that this paper dynamically approximates in the vertex-stream setting."
    },
    {
      "title": "Clustering with Qualitative Information",
      "authors": "Charikar et al.",
      "year": 2003,
      "role": "Foundation",
      "relationship_sentence": "Provides the seminal constant-factor approximation framework and LP viewpoint for correlation clustering that set the target of O(1)-approximation the present work achieves while handling dynamic vertex updates."
    },
    {
      "title": "Aggregating Inconsistent Information: Ranking and Clustering",
      "authors": "Ailon et al.",
      "year": 2008,
      "role": "Inspiration",
      "relationship_sentence": "Introduces the randomized Pivot paradigm yielding constant-factor approximations on complete graphs; the new dynamic algorithm maintains a pivot-like partition and leverages its analysis to preserve an O(1)-approximation under vertex arrivals/deletions."
    },
    {
      "title": "Dynamic Correlation Clustering in O(1) Update Time",
      "authors": "Behnezhad et al.",
      "year": 2023,
      "role": "Baseline",
      "relationship_sentence": "Gives a 5-approximation with O(1) expected update time in edge streams; its limitation—O(D) update time when translated to vertex streams—directly motivates this paper’s core contribution of polylog n update time in the vertex-update model."
    },
    {
      "title": "Correlation Clustering with a Fixed Number of Clusters",
      "authors": "Giotis et al.",
      "year": 2006,
      "role": "Related Problem",
      "relationship_sentence": "Analyzes the complete-graph setting and disagreement structure for the k-cluster variant, informing techniques for reasoning about signed complete graphs that underlie the dynamic analysis here."
    },
    {
      "title": "Near-Optimal LP Rounding for Correlation Clustering",
      "authors": "Chawla et al.",
      "year": 2015,
      "role": "Foundation",
      "relationship_sentence": "Sharpens constant-factor approximation guarantees for correlation clustering via LP rounding, framing the benchmark that the present work matches in a dynamic regime rather than in static computation."
    }
  ],
  "synthesis_narrative": "The intellectual lineage of Dynamic Correlation Clustering in Sublinear Update Time begins with the formulation of correlation clustering by Bansal, Blum, and Chawla, which defined the disagreements objective on complete signed graphs that this work continues to optimize—but now under continuously evolving vertex sets. Charikar, Guruswami, and Wirth established the first constant-factor approximation framework and an LP-based perspective, setting the constant-approximation bar that remains the gold standard and that this paper preserves despite the complexity of dynamic vertex updates. Ailon, Charikar, and Newman’s Pivot method provided a simple, local, randomized template for achieving O(1) approximations on complete graphs; the present algorithm’s ability to maintain a pivot-style partition efficiently under vertex arrivals and random deletions is a direct methodological descendant of that idea. The most immediate baseline is the SODA 2023 result of Behnezhad et al., which achieved a 5-approximation with O(1) expected update time in edge streams; however, when naively adapted to vertex streams, it incurs O(D) update time per update. This explicit limitation is precisely what the current paper overcomes by designing a dynamic maintenance scheme with polylogarithmic amortized update time in the vertex-update model. Finally, works like Giotis–Guruswami on fixed-k correlation clustering and Chawla–Makarychev–Schramm–Yaroslavtsev on near-optimal LP rounding refined the structural and approximation landscape for signed complete graphs, informing the analytical benchmarks and structural decompositions that the new dynamic algorithm must respect while operating in sublinear update time.",
  "analysis_timestamp": "2026-01-06T23:09:26.443089"
}