{
  "prior_works": [
    {
      "title": "Differentially Private Empirical Risk Minimization",
      "authors": "Kamalika Chaudhuri, Claire Monteleoni, Anand D. Sarwate",
      "year": 2011,
      "role": "Foundational technique (objective perturbation)",
      "relationship_sentence": "The paper revisits and generalizes the objective perturbation paradigm introduced here, shifting it to an input-perturb-then-project workflow that underpins their Perturb-and-Project framework."
    },
    {
      "title": "On the Geometry of Differential Privacy",
      "authors": "Moritz Hardt, Kunal Talwar",
      "year": 2010,
      "role": "Theoretical foundation (Gaussian width/geometry-driven analysis)",
      "relationship_sentence": "Their geometric viewpoint linking optimal noise and error to Gaussian width directly motivates the new paper’s use of Gaussian complexity and informs why projection after perturbation can provably denoise."
    },
    {
      "title": "The Matrix Mechanism: Optimizing Linear Counting Queries under Differential Privacy",
      "authors": "Guanghui Li, Michael Hay, Vibhor Rastogi, Gerome Miklau, Andrew McGregor",
      "year": 2010,
      "role": "Baseline/benchmark for linear workloads (including marginals)",
      "relationship_sentence": "As a canonical approach for answering large linear query workloads such as k-way marginals, the matrix mechanism provides a key comparison point that the new algorithms surpass, especially for odd k and sparse regimes."
    },
    {
      "title": "Privacy, Accuracy, and Consistency Too: A Holistic Solution to Contingency Table Release",
      "authors": "Boaz Barak, Kamalika Chaudhuri, Cynthia Dwork, Shayan O. Gharan (Kale), Frank McSherry, Kunal Talwar",
      "year": 2007,
      "role": "Early projection-based consistency for marginals",
      "relationship_sentence": "This work’s use of projection/feasibility for consistent contingency tables anticipates the idea of projecting noisy data back to an admissible set, a core step in Perturb-and-Project for marginals."
    },
    {
      "title": "Near-Optimal Algorithms for Differentially-Private Principal Components",
      "authors": "Kamalika Chaudhuri, Anand D. Sarwate, Kaushik Sinha",
      "year": 2012,
      "role": "Technique for privately releasing covariance/Gram structure",
      "relationship_sentence": "By developing DP methods for PCA (i.e., covariance/Gram matrices), this work underlies private computation of similarity structures; the new paper leverages related ideas to release pairwise cosine similarities efficiently."
    },
    {
      "title": "On the Optimal Error of Differentially Private Mechanisms for Linear Queries (Projection Mechanism)",
      "authors": "Aleksandar Nikolov, Kunal Talwar, Li Zhang",
      "year": 2013,
      "role": "Projection mechanism and optimal error bounds",
      "relationship_sentence": "Their projection mechanism formalizes denoising by projecting noisy answers onto a feasible set; the new paper extends this projection idea to input perturbation over datasets and analyzes it via Gaussian complexity."
    },
    {
      "title": "A Simple and Practical Algorithm for Differentially Private Data Release",
      "authors": "Moritz Hardt, Katrina Ligett, Frank McSherry",
      "year": 2012,
      "role": "Baseline algorithm for marginals (MWEM)",
      "relationship_sentence": "MWEM is a standard method for releasing marginals; the new work targets the same workload with algorithms that are faster and provide new theoretical guarantees (notably for odd k and t-sparse data)."
    }
  ],
  "synthesis_narrative": "Perturb-and-Project builds on two converging threads: objective/input perturbation for DP optimization and geometry-driven analyses of noise and denoising. Chaudhuri–Monteleoni–Sarwate introduced objective perturbation for ERM, establishing that carefully structured randomness in optimization objectives can deliver privacy with strong utility. Hardt–Talwar’s geometric program explained how error is governed by Gaussian width/complexity, inspiring both projection-based denoising and the analysis lens adopted here. Nikolov–Talwar–Zhang’s projection mechanism concretized this idea for linear queries by projecting noisy answers onto a feasible polytope, a principle the present paper generalizes to the space of admissible datasets S via input perturbation followed by projection.\n\nFor workloads, k-way marginals and similarity structures are central. The Matrix Mechanism provided a principled baseline for large linear query workloads, including marginals, but leaves room for specialized algorithms. Barak et al. showed early that enforcing consistency via projection enables high-quality release of contingency tables, foreshadowing the present paper’s perturb-and-project approach to marginals. For pairwise similarities, DP PCA by Chaudhuri–Sarwate–Sinha offered techniques for privately handling covariance/Gram matrices, which directly relate to cosine similarities; the new algorithms tailor these ideas to achieve efficient, accurate similarity release. Finally, MWEM stands as a practical baseline for marginals; the current work advances theory and efficiency, notably providing guarantees for odd k and improved bounds in sparse regimes. The novel technical step—tight sum-of-squares certificates that upper bound Gaussian complexity—pushes the geometry-of-DP agenda forward, explaining why fast input perturbation plus projection works and enabling new guarantees for similarities and marginals.",
  "analysis_timestamp": "2026-01-07T00:02:04.903807"
}