{
  "prior_works": [
    {
      "title": "The Value of Knowing a Demand Curve: Bounds on Regret for Pricing",
      "authors": "Robert Kleinberg and F. Thomson Leighton",
      "year": 2003,
      "role": "Foundation",
      "relationship_sentence": "Established the online dynamic pricing framework with purchase/no-purchase feedback and regret, which this paper directly adopts as the core problem setting."
    },
    {
      "title": "Feature-Based Dynamic Pricing",
      "authors": "Michael R. Cohen et al.",
      "year": 2016,
      "role": "Extension",
      "relationship_sentence": "Introduced contextual (feature-based) demand with linear price sensitivity, which the present work extends by allowing the price elasticity itself to depend on features, yielding the contextual-elasticity/heteroscedastic-valuation model."
    },
    {
      "title": "Parametric Bandits: The Generalized Linear Case",
      "authors": "Sarah Filippi et al.",
      "year": 2010,
      "role": "Foundation",
      "relationship_sentence": "Provided the GLM bandit framework that links a linear predictor and binary outcomes; this paper builds on that parametric foundation and departs by handling heteroscedastic valuation noise induced by feature-dependent elasticities."
    },
    {
      "title": "Improved Algorithms for Linear Stochastic Bandits",
      "authors": "Yasin Abbasi-Yadkori et al.",
      "year": 2011,
      "role": "Extension",
      "relationship_sentence": "Supplied the self-normalized concentration and analysis toolkit for adversarially chosen contexts that underpin the O(√(dT log T)) regret proof used by the PwP algorithm."
    },
    {
      "title": "Dynamic Pricing in High-Dimensions",
      "authors": "Adel Javanmard and Hamid Nazerzadeh",
      "year": 2019,
      "role": "Baseline",
      "relationship_sentence": "A primary contextual-pricing baseline that learns feature-based demand under homoscedastic/GLM-type assumptions; the current paper improves on it by allowing heteroscedastic valuations and proving optimal (up to logs) O(√(dT)) regret with adversarial contexts."
    },
    {
      "title": "Follow the Perturbed Leader: Faster Online Learning",
      "authors": "Adam T. Kalai and Santosh Vempala",
      "year": 2005,
      "role": "Inspiration",
      "relationship_sentence": "Introduced perturbation-based decision rules; the PwP (Pricing with Perturbation) algorithm explicitly instantiates this exploration-by-perturbation idea in contextual pricing."
    },
    {
      "title": "Stochastic Linear Optimization under Bandit Feedback",
      "authors": "Varsha Dani et al.",
      "year": 2008,
      "role": "Foundation",
      "relationship_sentence": "Provided core lower-bound techniques and dimension-dependent regret insights for linear bandits that inform the paper’s matching Ω(√(dT)) lower bound."
    }
  ],
  "synthesis_narrative": "The core of Xu and Wang (ICML 2024) builds squarely on the dynamic pricing paradigm of Kleinberg and Leighton, adopting the purchase/no-purchase bandit formulation and regret lens. Within this framework, the closest antecedent in modeling is Cohen–Lobel–Paes Leme’s feature-based dynamic pricing, where price enters linearly; Xu and Wang generalize this by letting price elasticity itself depend on context, and they show this is equivalent to a valuation model with heteroscedastic noise. That conceptual link rests on the generalized linear bandit foundation of Filippi et al., which ties linear predictors to binary responses; the present paper departs by handling heteroscedasticity induced by contextual elasticity rather than a fixed, homoscedastic link. Algorithmically, their Pricing with Perturbation (PwP) operationalizes the classic perturb-then-optimize idea of Kalai and Vempala, adapting perturbation as an efficient exploration mechanism tailored to pricing. The regret analysis leverages the self-normalized concentration tools from Abbasi-Yadkori–Pal–Szepesvári, enabling O(√(dT log T)) guarantees even under adversarially chosen contexts. Relative to the prominent high-dimensional contextual pricing baseline of Javanmard and Nazerzadeh, which learns under homoscedastic/GLM-type assumptions, the new model and algorithm handle heteroscedastic valuations and deliver optimal (up to logarithms) rates. Finally, the matching Ω(√(dT)) lower bound is informed by dimension-sensitive linear bandit lower bounds originating with Dani–Hayes–Kakade, completing a direct lineage from foundational pricing and bandit theory to a contextually elastic, perturbation-driven solution.",
  "analysis_timestamp": "2026-01-06T23:09:26.469839"
}