{
  "prior_works": [
    {
      "title": "AI Safety via Debate",
      "authors": "Geoffrey Irving et al.",
      "year": 2018,
      "role": "Baseline",
      "relationship_sentence": "This paper introduces the debate framework the current work directly improves, and its key limitations—deterministic systems and effectively exponential honest simulation—are precisely the gaps Doubly-Efficient Debate closes."
    },
    {
      "title": "IP = PSPACE",
      "authors": "Adi Shamir",
      "year": 1990,
      "role": "Foundation",
      "relationship_sentence": "Shamir’s result underpins the core premise of debate—that interaction can let a bounded verifier (judge) check extremely complex reasoning—providing the theoretical foundation that the new protocols adapt to AI settings."
    },
    {
      "title": "Algebraic Methods for Interactive Proof Systems",
      "authors": "Carsten Lund et al.",
      "year": 1992,
      "role": "Extension",
      "relationship_sentence": "The sum-check protocol and algebraization techniques from LFKN give the concrete mechanism to compress exponentially large computations into polynomial-time interactive checks, enabling the paper’s shift from exponential to polynomial honest work."
    },
    {
      "title": "Delegating Computation: Interactive Proofs for Muggles",
      "authors": "Shafi Goldwasser et al.",
      "year": 2008,
      "role": "Inspiration",
      "relationship_sentence": "GKR introduced the notion of doubly-efficient interactive proofs—both prover and verifier are efficient—which directly inspires the paper’s \"doubly-efficient debate\" goal and informs its protocol design."
    },
    {
      "title": "Constant-Round Interactive Proofs for Delegating Computation",
      "authors": "Omer Reingold et al.",
      "year": 2016,
      "role": "Extension",
      "relationship_sentence": "RRR’s constant-round, practical delegations guide how to structure efficient, bounded-round interactions so the honest debater wins with only polynomial effort, a property adopted in the new debate schemes."
    },
    {
      "title": "Non-Deterministic Exponential Time has Two-Prover Interactive Protocols",
      "authors": "László Babai et al.",
      "year": 1991,
      "role": "Foundation",
      "relationship_sentence": "MIP shows how multiple powerful agents can certify computations well beyond NP, reinforcing the adversarial multi-agent verification paradigm that the paper tailors into efficient AI debate protocols, including for stochastic behaviors."
    }
  ],
  "synthesis_narrative": "The core innovation of Scalable AI Safety via Doubly-Efficient Debate is to turn the original debate proposal into protocols where an honest agent can prevail using only polynomial work, and to extend the guarantees to stochastic AI systems. The direct lineage starts with AI Safety via Debate (Irving et al., 2018), which formulated debate as a scalable oversight mechanism but relied on deterministic models and effectively exponential honest simulation; these are the explicit shortcomings the new paper resolves. The feasibility of using interaction to check complex reasoning is grounded in IP = PSPACE (Shamir, 1990), and operationalized via LFKN’s algebraic methods and the sum-check protocol (1992), which compress exponential computations into polynomial-time interactive verification—precisely the technical lever that removes the exponential burden on the honest debater. Building on this, GKR (2008) introduced doubly-efficient interactive proofs, making both prover and verifier efficient; the present work imports this efficiency ethos to debate, aiming for honest strategies with polynomial resources. RRR (2016) further refines these delegations to constant-round settings, guiding the design of bounded-round, practically efficient debates. Finally, MIP = NEXP-style results (Babai, Fortnow, Lund, 1991) reinforce that multiple powerful agents can certify very hard computations, a paradigm the paper adapts to adversarial AI agents, including handling stochasticity by aligning interactive proof techniques with randomized system behavior. Together, these works directly enable the paper’s doubly-efficient, stochastic-capable debate protocols.",
  "analysis_timestamp": "2026-01-06T23:09:26.412255"
}