{
  "prior_works": [
    {
      "title": "OTiDE: Online Time-series Decomposition for Imputation and Forecasting",
      "authors": "Fang et al.",
      "year": 2023,
      "role": "Baseline",
      "relationship_sentence": "BayOTIDE directly builds on OTiDE’s online functional decomposition framework, extending it to a fully Bayesian treatment with principled uncertainty quantification and support for irregularly sampled multivariate streams."
    },
    {
      "title": "Forecasting at scale",
      "authors": "Taylor et al.",
      "year": 2017,
      "role": "Foundation",
      "relationship_sentence": "Prophet’s decomposable trend + seasonality formulation with Fourier regressors provides the functional modeling template that BayOTIDE inherits and generalizes to an online Bayesian multivariate imputation setting."
    },
    {
      "title": "Forecasting time series with complex seasonal patterns using exponential smoothing (TBATS)",
      "authors": "De Livera et al.",
      "year": 2011,
      "role": "Inspiration",
      "relationship_sentence": "TBATS introduced harmonic (Fourier) basis representations for complex seasonality within a state-space framework, an idea BayOTIDE adopts for capturing global periodic structure while replacing batch estimation with online Bayesian inference and handling irregular sampling."
    },
    {
      "title": "BRITS: Bidirectional Recurrent Imputation for Time Series",
      "authors": "Cao et al.",
      "year": 2018,
      "role": "Gap Identification",
      "relationship_sentence": "BRITS is a leading imputation approach trained on fixed windows and assumes regular sampling; its local-horizon, offline learning limitations are explicitly targeted by BayOTIDE’s global functional decomposition and online Bayesian updating."
    },
    {
      "title": "CSDI: Conditional Score-based Diffusion Models for Probabilistic Time Series Imputation",
      "authors": "Tashiro et al.",
      "year": 2021,
      "role": "Gap Identification",
      "relationship_sentence": "CSDI delivers strong probabilistic imputation but is trained offline on fixed segments with regular sampling assumptions; BayOTIDE addresses these gaps by enabling continuous online updates and robustness to irregular timestamps."
    },
    {
      "title": "GP-VAE: Deep Probabilistic Time Series Imputation",
      "authors": "Fortuin et al.",
      "year": 2020,
      "role": "Related Problem",
      "relationship_sentence": "GP-VAE handles irregular sampling via Gaussian processes but remains offline and does not explicitly model global trend/seasonality; BayOTIDE retains probabilistic imputation while adding functional decomposition and online inference."
    },
    {
      "title": "Latent ODEs for Irregularly-Sampled Time Series",
      "authors": "Rubanova et al.",
      "year": 2019,
      "role": "Related Problem",
      "relationship_sentence": "Latent ODEs motivated continuous-time handling of irregularly sampled series; BayOTIDE addresses the same irregularity challenge but via interpretable functional components with Bayesian online updates rather than latent neural dynamics."
    }
  ],
  "synthesis_narrative": "BayOTIDE’s core idea—online, probabilistic imputation of multivariate time series via interpretable functional decomposition—emerges by fusing classical decomposition modeling with modern probabilistic and streaming needs. Prophet (Taylor et al., 2017) and TBATS (De Livera et al., 2011) established decomposable trend–seasonality formulations using harmonic (Fourier) bases to capture global periodic structure, providing the functional blueprint BayOTIDE adopts. OTiDE (Fang et al., 2023) then operationalized this idea in an online framework for imputation/forecasting, but lacked a fully Bayesian treatment and comprehensive support for irregular sampling; BayOTIDE directly extends this baseline with Bayesian inference for uncertainty quantification and principled handling of irregularly sampled streams. In contrast, dominant learning-based imputers like BRITS (Cao et al., 2018) and CSDI (Tashiro et al., 2021) train on fixed local windows and typically presume regular timestamps, motivating BayOTIDE’s emphasis on capturing global trends/periodicity and online updates for streaming data. Works tackling irregular sampling with deep generative models, such as GP-VAE (Fortuin et al., 2020) and Latent ODEs (Rubanova et al., 2019), highlight the need for continuous-time reasoning but remain offline and do not explicitly encode interpretable global structure. BayOTIDE synthesizes these threads: it preserves the interpretability and global coverage of classical functional decomposition while delivering online Bayesian inference and robust irregular-sampling imputation for multivariate streams.",
  "analysis_timestamp": "2026-01-06T23:09:26.463897"
}