{
  "prior_works": [
    {
      "title": "Predicting disruptive instabilities in controlled fusion plasmas using deep learning",
      "authors": "K. Kates-Harbeck, A. Svyatkovskiy, W. Tang",
      "year": 2019,
      "role": "Seminal deep learning for disruption prediction",
      "relationship_sentence": "Established that end-to-end deep neural networks trained on multi-diagnostic tokamak data can forecast disruptions, directly motivating the paper’s emphasis on (1) disruption prediction as a near-term, high-impact ML opportunity."
    },
    {
      "title": "APODIS: a real-time disruption predictor for JET",
      "authors": "J. Vega, A. Murari, et al.",
      "year": 2013,
      "role": "Early real-time ML disruption predictor",
      "relationship_sentence": "Demonstrated feasibility of deploying ML predictors in real-time on a major device, grounding the paper’s call for robust, operationally-relevant ML for disruption avoidance and mitigation."
    },
    {
      "title": "Trained neural network surrogate model for QuaLiKiz",
      "authors": "J. Citrin, et al.",
      "year": 2017,
      "role": "ML surrogate for plasma transport/turbulence",
      "relationship_sentence": "Showed that neural surrogates of expensive transport models can enable fast integrated simulations, directly informing the paper’s (2) simulation and dynamics modeling agenda for ML-accelerated physics."
    },
    {
      "title": "Magnetic control of tokamak plasmas through deep reinforcement learning",
      "authors": "J. Degrave, F. Felici, et al.",
      "year": 2022,
      "role": "Deep RL for plasma magnetic control",
      "relationship_sentence": "Proved that deep RL can synthesize plasma shape and position controllers on a real tokamak, underpinning the paper’s (4) improving controls theme and its case for learning-enabled controllers."
    },
    {
      "title": "Real-time simulations of tokamak plasmas using RAPTOR",
      "authors": "F. Felici, O. Sauter",
      "year": 2012,
      "role": "Control-oriented, real-time plasma modeling",
      "relationship_sentence": "Introduced fast, control-oriented transport simulations and state estimation, motivating the paper’s proposals for ML-enhanced observers, MPC, and hybrid models in plasma control."
    },
    {
      "title": "The Materials Project: A materials genome approach to accelerating materials innovation",
      "authors": "A. Jain, S. P. Ong, G. Hautier, et al.",
      "year": 2013,
      "role": "Data-driven materials discovery platform",
      "relationship_sentence": "Provided a blueprint for large-scale data and ML accelerating materials design, directly informing the paper’s (6) enhancing materials discovery opportunity for fusion-relevant materials."
    },
    {
      "title": "OMFIT: a framework for integrated modeling and data analysis for tokamak experiments",
      "authors": "O. Meneghini, L. L. Lao, J. M. Park, et al.",
      "year": 2015,
      "role": "Fusion data/workflow integration framework",
      "relationship_sentence": "Showed how standardized data interfaces and workflows enable scalable modeling and ML, aligning with the paper’s discussion on modernizing the fusion data ecosystem to unlock new ML applications."
    }
  ],
  "synthesis_narrative": "The paper’s core contribution is a structured agenda that pinpoints six fusion challenges where machine learning can deliver outsized impact, and it is directly scaffolded by several landmark works. For disruption prediction, Kates-Harbeck et al. (2019) established the viability of deep learning on multi-diagnostic streams to forecast disruptions, while JET’s APODIS demonstrated real-time operational deployment—together motivating the paper’s recommendation to transition from proof-of-concept predictors to robust, interpretable, and device-generalizable systems. For simulation and dynamics modeling, Citrin et al. (2017) showed that neural surrogates of turbulent transport (e.g., QuaLiKiz) can bring orders-of-magnitude speedups, supporting the paper’s call for ML-accelerated multiphysics workflows and uncertainty-aware surrogates. In control, Degrave et al. (2022) proved deep RL can control plasma shape on a real device, and Felici & Sauter’s RAPTOR provided a control-oriented modeling paradigm; these anchor the paper’s vision for hybrid ML–physics controllers, state estimators, and MPC. The agenda’s materials discovery thrust draws on the Materials Project’s demonstration that curated data infrastructures and ML pipelines can systematically accelerate materials innovation—an approach readily adapted to fusion-relevant, radiation-tolerant materials. Finally, OMFIT exemplifies the data and workflow integration the paper argues is essential: standardized schemas, accessible archives, and tooling to make fusion data ML-ready. Collectively, these works justify the paper’s claim that fusion is primed for impactful ML across prediction, modeling, inference, control, experimental design, and materials.",
  "analysis_timestamp": "2026-01-07T00:02:04.881502"
}