{
  "prior_works": [
    {
      "title": "FunSearch: Program search using a large language model and a verifier",
      "authors": "Romera-Paredes et al. (DeepMind)",
      "year": 2023,
      "role": "Closest prior AHD framework with LLM-driven program synthesis and selection",
      "relationship_sentence": "EoH directly builds on FunSearch’s LLM+evaluator loop, but extends it by co-evolving both natural-language heuristic “thoughts” and executable code with explicit evolutionary operators, improving efficiency and robustness."
    },
    {
      "title": "Hyper-heuristics: A survey of the state of the art",
      "authors": "Edmund K. Burke, Michel Gendreau, Graham Kendall, Gabriela Ochoa, Ender Özcan, Rong Qu",
      "year": 2013,
      "role": "Foundational framework for Automatic Heuristic Design (AHD)",
      "relationship_sentence": "EoH instantiates the hyper-heuristic paradigm by defining a search space of heuristics (as natural-language thoughts and code) and navigating it via evolutionary computation, aligning with the survey’s vision of search over heuristics."
    },
    {
      "title": "Genetic Programming: On the Programming of Computers by Means of Natural Selection",
      "authors": "John R. Koza",
      "year": 1992,
      "role": "Foundational method for evolving executable programs",
      "relationship_sentence": "EoH is a modern GP-like system where the LLM acts as a powerful mutation/variation operator to generate and repair code from high-level descriptions, with fitness given by heuristic performance."
    },
    {
      "title": "ParamILS: An Automatic Algorithm Configuration Framework",
      "authors": "Frank Hutter, Holger H. Hoos, Kevin Leyton-Brown",
      "year": 2009,
      "role": "Evaluation-driven algorithm design and selection across instances",
      "relationship_sentence": "EoH adopts the evaluation-and-selection ethos of algorithm configuration by scoring candidates over instance distributions and exploiting selection pressure to generalize beyond training sets."
    },
    {
      "title": "Chain-of-Thought Prompting Elicits Reasoning in Large Language Models",
      "authors": "Jason Wei et al.",
      "year": 2022,
      "role": "Methodological inspiration for representing and editing intermediate reasoning in natural language",
      "relationship_sentence": "EoH’s notion of heuristics as natural-language “thoughts” is grounded in CoT, enabling interpretable intermediate reasoning that can be evolved and then translated into code."
    },
    {
      "title": "AlphaDev: Discovering new fast sorting algorithms using deep reinforcement learning",
      "authors": "Daniel J. Mankowitz et al.",
      "year": 2023,
      "role": "Program-level algorithm discovery via search and performance feedback",
      "relationship_sentence": "Like AlphaDev, EoH performs performance-guided search over programs, but replaces RL over assembly with LLM-driven code generation and EC over thought/code representations."
    },
    {
      "title": "Neural Combinatorial Optimization with Reinforcement Learning",
      "authors": "Irwan Bello, Hieu Pham, Quoc V. Le, Mohammad Norouzi, Samy Bengio",
      "year": 2016,
      "role": "Learning problem-specific heuristics for CO via ML",
      "relationship_sentence": "EoH targets the same CO benchmarks but departs from parametric policies by automatically discovering human-interpretable heuristics in natural language and code through evolutionary search."
    }
  ],
  "synthesis_narrative": "EoH sits at the confluence of three lines of work: hyper-heuristics and automatic algorithm design, program-level search/evolution, and LLM-based reasoning/coding. Foundational AHD ideas from hyper-heuristics (Burke et al., 2013) and configuration (ParamILS) establish the central principle of evaluating candidate heuristics across problem instances and selecting the best—EoH inherits this evaluation-driven loop to promote generalization. From the program-evolution tradition (Koza’s Genetic Programming), EoH borrows the notion of evolving executable artifacts, but replaces brittle syntactic mutations with an LLM capable of translating and repairing code from higher-level descriptions. This directly connects to recent program search systems like FunSearch, which couple an LLM with a verifier; EoH advances that template by explicitly co-evolving two coupled representations—the natural-language “thoughts” that describe heuristic ideas and the code that implements them—using evolutionary operators to explore and recombine both spaces efficiently. Chain-of-Thought prompting provides the representational insight that intermediate, textual reasoning can serve as a manipulable object of search, making the heuristic space interpretable and amenable to guided variation. Finally, algorithm discovery efforts such as AlphaDev and neural combinatorial optimization demonstrate the power of performance-guided search for CO; EoH targets the same domain but achieves greater flexibility by searching over human-readable heuristic ideas and leveraging LLM codegen, yielding competitive or superior heuristics with lower computational budgets.",
  "analysis_timestamp": "2026-01-06T23:42:48.057412"
}