{
  "prior_works": [
    {
      "title": "Spectra of some self-exciting and mutually exciting point processes",
      "authors": "Alan G. Hawkes",
      "year": 1971,
      "role": "Foundational TPP defining self-exciting dynamics; for exponential kernels the intensity follows a linear jump differential law.",
      "relationship_sentence": "The paper leverages the known jump-ODE representation of Hawkes intensity (dλt = −β(λt−μ)dt + α dNt) as a canonical example to justify and prove an SDE (jump-diffusion) formulation that NJDTPP generalizes with neural coefficients."
    },
    {
      "title": "A self-correcting point process",
      "authors": "Valerie Isham, Michael Westcott",
      "year": 1979,
      "role": "Introduced the self-correcting TPP with log-intensity evolving smoothly between events and negative jumps at events.",
      "relationship_sentence": "NJDTPP’s equivalence proofs build directly on the self-correcting model’s jump-differential dynamics for (log) intensity, treating it as a special case within the proposed neural jump-diffusion SDE framework."
    },
    {
      "title": "Some Statistical Methods Connected with Series of Events",
      "authors": "D. R. Cox",
      "year": 1955,
      "role": "Introduced doubly stochastic (Cox) processes where the intensity itself is stochastic.",
      "relationship_sentence": "The core idea of modeling the intensity as a stochastic process underpins NJDTPP’s decision to place λt as the solution of a neural SDE with drift, diffusion, and jump terms."
    },
    {
      "title": "Recurrent Marked Temporal Point Processes: Embedding Event History to Vector",
      "authors": "Nan Du, Hanjun Dai, Rakshit Trivedi, Utkarsh Upadhyay, Manuel Gomez-Rodriguez, Le Song",
      "year": 2016,
      "role": "Pioneered neural parameterizations of TPP intensities via RNNs for flexible, data-driven modeling.",
      "relationship_sentence": "NJDTPP extends the neural TPP paradigm by parameterizing SDE coefficients (drift/diffusion/jump) with neural networks rather than the intensity function directly, yielding greater dynamical expressiveness."
    },
    {
      "title": "The Neural Hawkes Process: A Neurally Self-Modulating Multivariate Point Process",
      "authors": "Hongyuan Mei, Jason Eisner",
      "year": 2017,
      "role": "Modeled hidden states via continuous-time dynamics with event-driven jumps (a jump-ODE view) to shape intensity.",
      "relationship_sentence": "NJDTPP generalizes the jump-ODE perspective in Neural Hawkes to a jump-SDE directly on the intensity, adding diffusion noise and unifying classic TPPs within one neural jump-diffusion formulation."
    },
    {
      "title": "Neural SDEs",
      "authors": "Patrick Kidger, James Morrill, James Foster, Terry Lyons",
      "year": 2021,
      "role": "Established neural parameterizations of SDE drift and diffusion with training machinery and theoretical underpinnings.",
      "relationship_sentence": "The authors rely on neural SDE methodology to parameterize intensity dynamics and to argue existence/uniqueness under Lipschitz/linear-growth conditions for the proposed NJDSDE."
    },
    {
      "title": "Lévy Processes and Stochastic Calculus",
      "authors": "David Applebaum",
      "year": 2009,
      "role": "Standard reference for jump-diffusion SDEs and conditions ensuring existence and uniqueness of solutions.",
      "relationship_sentence": "NJDTPP’s theoretical guarantees for neural jump-diffusion intensity processes draw on jump SDE theory and well-posedness results presented in this monograph."
    }
  ],
  "synthesis_narrative": "Neural Jump-Diffusion Temporal Point Processes (NJDTPP) unite classical and neural TPP modeling by recasting the intensity as the solution of a neural jump-diffusion SDE. The classical pillars—Hawkes (1971) and Isham–Westcott’s self-correcting process (1979)—already possess explicit jump differential dynamics for intensity (or log-intensity), furnishing concrete, model-specific instances of drift with event-triggered jumps. Cox’s 1955 formulation of doubly stochastic Poisson processes supplied the conceptual bridge to treat intensity itself as a stochastic process, legitimizing stochastic (rather than purely deterministic) dynamics for λt.\n\nOn the neural side, RMTPP (Du et al., 2016) and the Neural Hawkes Process (Mei & Eisner, 2017) demonstrated the value of flexible, learned dynamics, with Neural Hawkes offering a jump-ODE viewpoint via continuous-time hidden states modulated by event-driven jumps. NJDTPP advances this trajectory by moving from hidden-state ODEs to intensity-level jump-SDEs, enriching expressiveness through diffusion noise and neural parameterization of drift, diffusion, and jump coefficients.\n\nTechnically, NJDTPP’s guarantees are grounded in the modern neural SDE toolkit (Kidger et al., 2021), which provides practices for parameterizing and training SDEs and for ensuring well-posedness under standard conditions. The mathematical backbone for jump-diffusion existence and uniqueness comes from the Lévy SDE literature (Applebaum, 2009). Together, these strands directly shape NJDTPP’s core innovation: a unified neural jump-diffusion perspective that encapsulates classical TPPs as special cases while delivering a flexible, theoretically sound intensity model.",
  "analysis_timestamp": "2026-01-07T00:02:04.876675"
}