{
  "prior_works": [
    {
      "title": "Domain Randomization for Transferring Deep Neural Networks from Simulation to the Real World",
      "authors": "Josh Tobin, Wojciech Zaremba, Pieter Abbeel, et al.",
      "year": 2017,
      "role": "Dynamics/visual parameter randomization for sim-to-real",
      "relationship_sentence": "Introduced the idea of randomizing simulation parameters to bridge sim-to-real, establishing environment parameterization as a primary lever—an antecedent to the paper’s call to automate environment shaping."
    },
    {
      "title": "Sim-to-Real Transfer of Robotic Control with Dynamics Randomization",
      "authors": "Xue Bin (Ken) Peng, Marcin Andrychowicz, Wojciech Zaremba, Pieter Abbeel",
      "year": 2018,
      "role": "Dynamics randomization for robust control",
      "relationship_sentence": "Showed that varying dynamics parameters in training yields robust real-world controllers, directly evidencing that shaping simulator dynamics rather than policy optimization alone is decisive for success."
    },
    {
      "title": "Solving Rubik’s Cube with a Robot Hand (Automatic Domain Randomization)",
      "authors": "OpenAI (Ilge Akkaya, Marcin Andrychowicz, et al.)",
      "year": 2019,
      "role": "Automatic domain randomization (ADR) for curriculum over environment parameters",
      "relationship_sentence": "Pioneered automatic expansion of randomization ranges based on agent performance, concretely demonstrating automated environment shaping as a practical path to state-of-the-art sim-to-real results."
    },
    {
      "title": "SimOpt: Learning Domain Parameters for Sim-to-Real Transfer",
      "authors": "Yevgen Chebotar, Animesh Garg, Laurens van der Maaten, Sergey Levine, et al.",
      "year": 2019,
      "role": "Data-driven system identification via real rollouts",
      "relationship_sentence": "Optimized simulation parameters to match real trajectories, formalizing an algorithmic loop that automates dynamics shaping—precisely the kind of procedure the position paper argues should be scaled."
    },
    {
      "title": "Reverse Curriculum Generation for Reinforcement Learning",
      "authors": "Carlos Florensa, David Held, Markus Wulfmeier, Pieter Abbeel",
      "year": 2017,
      "role": "Automatic curriculum via initial state distribution shaping",
      "relationship_sentence": "Automatically adjusted start-state distributions to ease exploration, exemplifying environment configuration as a controllable variable that can be learned rather than hand-designed."
    },
    {
      "title": "PAIRED: Emergent Complexity and Curriculum Learning in Adversarial Environment Design",
      "authors": "Michael Dennis, Natasha Jaques, Eugene Vinitsky, et al.",
      "year": 2020,
      "role": "Adversarial task/environment generation",
      "relationship_sentence": "Framed environment/task design as an adversarial optimization that yields curricula, directly aligning with the paper’s thesis that automating task/environment generation is central to progress."
    },
    {
      "title": "Deep Reinforcement Learning from Human Preferences",
      "authors": "Paul F. Christiano, Jan Leike, Tom B. Brown, Miljan Martic, Shane Legg, Dario Amodei",
      "year": 2017,
      "role": "Reward learning to replace manual reward shaping",
      "relationship_sentence": "Learned rewards from pairwise human preferences, reducing hand-crafted reward engineering and reinforcing the broader argument to automate the reward component of environment shaping."
    }
  ],
  "synthesis_narrative": "The position that automatic environment shaping should be the next frontier in RL is grounded in a decade of evidence that success in sim-to-real hinges far more on environment configuration than on incremental policy-optimization tweaks. Early domain randomization (Tobin et al., 2017) established that varying simulator parameters is a powerful instrument for transfer, and dynamics randomization (Peng et al., 2018) showed that robust real-world control emerges from training over families of dynamics rather than fixed MDPs. Automatic Domain Randomization in OpenAI’s Rubik’s Cube work (Akkaya et al., 2019) turned this insight into a closed-loop procedure, automatically widening parameter ranges to sustain learning progress—an explicit instantiation of automated environment shaping.\nSimOpt (Chebotar et al., 2019) complemented this by tuning simulation parameters from real data, closing the loop between deployment and training and highlighting that system identification can be automated within the RL pipeline. In parallel, curriculum methods reframed task difficulty as a learnable object: Reverse Curriculum Generation (Florensa et al., 2017) shaped start-state distributions, while PAIRED (Dennis et al., 2020) cast environment design as an adversarial game that yields emergent curricula and transferable policies. Finally, reward learning from human preferences (Christiano et al., 2017) reduced manual reward engineering, showing that the reward component of the environment can also be learned.\nTogether, these works directly motivate the paper’s thesis: scalable RL progress comes from automating the key environment levers—dynamics, tasks/curricula, and rewards—thereby shifting effort from manual shaping to algorithmic procedures that can generalize across diverse robotic problems.",
  "analysis_timestamp": "2026-01-07T00:02:04.878184"
}