{
  "prior_works": [
    {
      "title": "A Distributional Perspective on Reinforcement Learning (C51)",
      "authors": [
        "Marc G. Bellemare",
        "Will Dabney",
        "Rémi Munos"
      ],
      "year": 2017,
      "role": "primary technical precursor",
      "relationship_sentence": "Introduced categorical value representations trained with cross-entropy on a fixed support, directly inspiring the idea that casting value prediction as classification can stabilize and improve deep RL."
    },
    {
      "title": "Rainbow: Combining Improvements in Deep Reinforcement Learning",
      "authors": [
        "Matteo Hessel",
        "Joseph Modayil",
        "Hado van Hasselt",
        "Tom Schaul",
        "Georg Ostrovski",
        "Will Dabney",
        "Dan Horgan",
        "Bilal Piot",
        "Mohammad Azar",
        "David Silver"
      ],
      "year": 2018,
      "role": "empirical consolidation of categorical value training",
      "relationship_sentence": "Demonstrated that the C51 categorical cross-entropy objective substantially boosts performance at scale on Atari, reinforcing the practical benefits of classification-style value learning."
    },
    {
      "title": "Mastering Atari, Go, Chess and Shogi by Planning with a Learned Model (MuZero)",
      "authors": [
        "Julian Schrittwieser",
        "Ioannis Antonoglou",
        "Thomas Hubert",
        "Karen Simonyan",
        "Laurent Sifre",
        "Simon Schmitt",
        "Arthur Guez",
        "Edward Lockhart",
        "Demis Hassabis",
        "Thore Graepel",
        "Timothy Lillicrap",
        "David Silver"
      ],
      "year": 2020,
      "role": "scaling evidence for categorical value heads",
      "relationship_sentence": "Used a support-based categorical representation with cross-entropy for value and reward, showing that classification-like value objectives enable stable training of very large networks across diverse domains."
    },
    {
      "title": "Implicit Q-Learning (IQL): Offline Reinforcement Learning with Implicit Q-Learning",
      "authors": [
        "Ilya Kostrikov",
        "Ashvin Nair",
        "Sergey Levine"
      ],
      "year": 2021,
      "role": "loss-design inspiration for value learning",
      "relationship_sentence": "Showed that replacing MSE with expectile regression for value estimation mitigates bootstrapping pathologies, motivating the re-examination of default regression losses for value functions."
    },
    {
      "title": "Conservative Q-Learning for Offline Reinforcement Learning (CQL)",
      "authors": [
        "Aviral Kumar",
        "Aurick Zhou",
        "George Tucker",
        "Sergey Levine"
      ],
      "year": 2020,
      "role": "objective shaping for stable value estimation",
      "relationship_sentence": "Demonstrated that carefully regularized value objectives improve stability and robustness, supporting the paper’s thesis that objective choice (not just architecture) is pivotal for scalable value learning."
    },
    {
      "title": "Implicit Quantile Networks for Distributional Reinforcement Learning (IQN)",
      "authors": [
        "Will Dabney",
        "Mark Rowland",
        "Marc G. Bellemare",
        "Rémi Munos"
      ],
      "year": 2018,
      "role": "broader distributional RL foundation",
      "relationship_sentence": "Advanced distributional RL by optimizing a non-MSE quantile regression objective for values, underscoring that alternatives to MSE can yield superior stability and performance."
    }
  ],
  "synthesis_narrative": "The paper’s core idea—training value functions via classification rather than regression—emerges from the arc of distributional RL and the growing recognition that loss design is central to stability under bootstrapping. C51 first made the leap from scalar value regression to a categorical representation trained with cross-entropy, revealing that “value as classification” can improve stability and performance. Rainbow validated and popularized this insight at scale on Atari, establishing categorical cross-entropy over value supports as a practical, high-performing choice in deep RL. MuZero then extended the paradigm to massive models and diverse domains, using support-based categorical heads for both value and reward, providing compelling evidence that classification-style objectives scale more reliably than MSE regression in practice.\n\nConcurrently, offline RL works such as CQL and IQL highlighted that the choice of value loss profoundly affects robustness: CQL used a conservative, regularized objective to curb overestimation and distributional shift, while IQL replaced MSE with expectile regression to stabilize value learning. Together, these results solidified the view that departing from vanilla MSE can systematically mitigate bootstrapping instabilities. Building on this foundation, the present paper generalizes the categorical/classification perspective beyond explicitly distributional modeling, advocating a simple, scalable categorical cross-entropy objective for value functions across tasks and architectures (Atari, large ResNets, Q-transformers, chess, language agents). The work thus synthesizes distributional RL’s categorical insights with loss-design advances to propose a broadly applicable, scalable alternative to value regression.",
  "analysis_timestamp": "2026-01-07T00:02:04.872921"
}