{
  "prior_works": [
    {
      "title": "Nonparametric Bounds on Treatment Effects",
      "authors": "Charles F. Manski",
      "year": 1990,
      "role": "Foundation",
      "relationship_sentence": "Provides the vanilla no-assumption partial identification bounds that this paper takes as the benchmark; Zhang derives when and how knowledge of the marginal P(U) yields non-vanilla (strictly tighter) bounds relative to Manski’s envelope."
    },
    {
      "title": "Bounds on Treatment Effects from Studies with Imperfect Compliance",
      "authors": "Alexander Balke et al.",
      "year": 1997,
      "role": "Extension",
      "relationship_sentence": "Introduces the response-function/linear-programming framework for sharp bounds in discrete structural models, which Zhang directly extends by adding fixed-marginal constraints on the unmeasured confounder U to obtain closed-form tight bounds."
    },
    {
      "title": "Probabilities of Causation",
      "authors": "Jin Tian et al.",
      "year": 2000,
      "role": "Extension",
      "relationship_sentence": "Develops closed-form sharp bounds for counterfactual quantities in discrete models via response-function parametrization; Zhang builds on this bounding paradigm and generalizes it to incorporate the known marginal distribution P(U)."
    },
    {
      "title": "Identifying Causal Effects with Proxy Variables",
      "authors": "Wei Miao et al.",
      "year": 2018,
      "role": "Gap Identification",
      "relationship_sentence": "Shows identification using auxiliary proxies/negative controls; Zhang’s contribution is explicitly motivated by the infeasibility of such auxiliaries and instead exploits internal information—specifically the marginal P(U)—to achieve tight partial identification."
    },
    {
      "title": "Sensitivity Analysis for Certain Permutation Inferences in Matched Observational Studies",
      "authors": "Paul R. Rosenbaum",
      "year": 1987,
      "role": "Gap Identification",
      "relationship_sentence": "Establishes sensitivity-parameter models for unmeasured confounding; Zhang avoids untestable sensitivity parameters by leveraging observable constraints from P(U), yielding sharp, assumption-lean bounds."
    },
    {
      "title": "Sensitivity to Exogeneity Assumptions in Program Evaluation",
      "authors": "Guido W. Imbens",
      "year": 2003,
      "role": "Related Problem",
      "relationship_sentence": "Analyzes ATE robustness via sensitivity to unconfoundedness; Zhang addresses the same core challenge but replaces abstract sensitivity parameters with concrete marginal-distribution constraints to deliver closed-form tight partial identification."
    }
  ],
  "synthesis_narrative": "Zhang’s core innovation—deriving closed-form, tight partial identification bounds for causal effects when only the marginal distribution of an unmeasured confounder P(U) is known—stands squarely on the discrete sharp-bounding tradition while directly addressing the limitations of auxiliary-variable and sensitivity-parameter approaches. The baseline and conceptual foundation are the classic Manski bounds, which formalize the vanilla no-assumption envelope for causal effects. The computational and structural backbone comes from Balke and Pearl’s response-function and linear-programming framework for sharp bounds in discrete SCMs, further refined by Tian and Pearl’s closed-form treatments of counterfactual quantities. Zhang extends this exact machinery by imposing fixed-marginal constraints on the latent confounder, yielding analytic, tight bounds that hold for any discrete P(U).\n\nAt the same time, the paper is explicitly motivated by gaps in two influential lines of work. First, proxy/negative-control identification (e.g., Miao–Geng–Tchetgen Tchetgen) can be powerful but hinges on external auxiliary variables and untestable conditional independence assumptions; Zhang instead mines internal information from P(U) alone. Second, traditional sensitivity analyses (Rosenbaum; Imbens) manage unmeasured confounding through abstract parameters, which can be hard to calibrate and do not guarantee tightness. By replacing sensitivity parameters with concrete marginal constraints and proving an if-and-only-if criterion for when P(U) yields non-vanilla improvements, Zhang unifies and advances the sharp-bounding lineage, delivering practically checkable, assumption-lean, closed-form bounds that clarify exactly when knowledge of P(U) has identifying power.",
  "analysis_timestamp": "2026-01-06T23:09:26.490832"
}