{
  "prior_works": [
    {
      "title": "Estimation of Non-Normalized Statistical Models by Score Matching",
      "authors": "Aapo Hyvärinen",
      "year": 2005,
      "role": "Foundation",
      "relationship_sentence": "MF-CDM generalizes the core score-matching principle to the mean-field, infinite-particle setting; Hyvärinen’s score matching is the foundational objective that MF-CDM reformulates for chaotic particle systems."
    },
    {
      "title": "A Connection Between Score Matching and Denoising Autoencoders",
      "authors": "Pascal Vincent",
      "year": 2011,
      "role": "Extension",
      "relationship_sentence": "MF-CDM derives a denoising score-matching objective tailored to chaotic particle systems, directly extending Vincent’s denoising score matching to the mean-field/infinite-population regime."
    },
    {
      "title": "Deep Unsupervised Learning using Nonequilibrium Thermodynamics",
      "authors": "Jascha Sohl-Dickstein et al.",
      "year": 2015,
      "role": "Inspiration",
      "relationship_sentence": "MF-CDM adopts the diffusion-style forward–reverse construction introduced here, but replaces the fixed-dimensional joint modeling with a chaos-based mean-field formulation to address high-cardinality data."
    },
    {
      "title": "Denoising Diffusion Probabilistic Models",
      "authors": "Jonathan Ho et al.",
      "year": 2020,
      "role": "Gap Identification",
      "relationship_sentence": "MF-CDM directly targets DDPMs’ implicit scaling issues on high-cardinality sets (modeling a joint score over all elements) by introducing a mean-field, per-particle score via propagation of chaos."
    },
    {
      "title": "Score-Based Generative Modeling through Stochastic Differential Equations",
      "authors": "Yang Song et al.",
      "year": 2021,
      "role": "Extension",
      "relationship_sentence": "MF-CDM adapts the SDE-based score framework to interacting particle (McKean–Vlasov) SDEs, replacing standard finite-dimensional SDEs with their mean-field limits to obtain scalable per-particle scores."
    },
    {
      "title": "A class of Markov processes associated with nonlinear parabolic equations",
      "authors": "H. P. McKean Jr.",
      "year": 1966,
      "role": "Foundation",
      "relationship_sentence": "MF-CDM models data as a McKean–Vlasov (mean-field) stochastic system; McKean’s formulation provides the mathematical backbone for treating interacting particles via their mean-field limit."
    },
    {
      "title": "Topics in Propagation of Chaos",
      "authors": "Alain-Sol Sznitman",
      "year": 1991,
      "role": "Foundation",
      "relationship_sentence": "MF-CDM’s core scalability claim hinges on propagation of chaos; Sznitman’s theory formalizes how large interacting particle systems decouple in the limit, enabling MF-CDM’s infinite-population score construction."
    }
  ],
  "synthesis_narrative": "Mean-field Chaos Diffusion Models (MF-CDMs) fuse two intellectual strands: score-based diffusion modeling and the mean-field analysis of interacting particle systems. On the diffusion side, Hyvärinen’s score matching established the basic objective for learning gradients of log densities, and Vincent’s denoising score matching provided the practical denoising formulation later adopted by diffusion models. Sohl-Dickstein et al. introduced the diffusion-based forward–reverse generative paradigm, while Ho et al. operationalized it in DDPMs—methods that implicitly scale poorly for high-cardinality sets because they learn joint scores over all elements. Song et al. then recast diffusion as stochastic differential equations, yielding a continuous-time score framework that MF-CDM directly modifies. On the particle-systems side, McKean’s nonlinear (McKean–Vlasov) processes and Sznitman’s propagation-of-chaos theory supply the precise mechanism by which a large interacting system behaves like independent particles governed by a mean-field law. MF-CDM’s key innovation is to transplant the score-based SDE machinery into this mean-field setting: it defines a per-particle (mean-field) score in the infinite-population limit and derives a denoising score-matching objective for chaotic particle systems. This resolves the curse of dimensionality with respect to cardinality by leveraging propagation of chaos, and it yields practical training via a subdivision scheme while remaining faithful to the diffusion/SDE lineage.",
  "analysis_timestamp": "2026-01-06T23:09:26.499116"
}