{
  "prior_works": [
    {
      "title": "RankIQA: Learning from Rankings for No-reference Image Quality Assessment",
      "authors": "Xialei Liu et al.",
      "year": 2017,
      "role": "Foundation",
      "relationship_sentence": "Established BIQA training from relative quality judgments rather than absolute MOS, a principle CSIQA generalizes to dataset-wide (global) quality relationships via contrastive objectives."
    },
    {
      "title": "CONTRIQUE: Contrastive Image Quality Evaluation",
      "authors": "Sreyas V. Madhusudana et al.",
      "year": 2021,
      "role": "Extension",
      "relationship_sentence": "Showed that contrastive learning can produce quality-aware representations for BIQA; CSIQA extends this by designing quality-context contrastive strategies that explicitly encode global inter-image quality correlations beyond standard instance-level contrasting."
    },
    {
      "title": "PaQ-2-PiQ: Distilling Opinion Scores from Pairwise Comparisons",
      "authors": "Gabriela Hosu et al.",
      "year": 2020,
      "role": "Inspiration",
      "relationship_sentence": "Demonstrated that humans’ pairwise preference data are reliable for learning perceptual quality, directly motivating CSIQA’s use of relative quality contrast in a global, contrastive-learning framework."
    },
    {
      "title": "NIMA: Neural Image Assessment",
      "authors": "Hossein Talebi et al.",
      "year": 2018,
      "role": "Gap Identification",
      "relationship_sentence": "Popularized training BIQA as absolute score regression from single images; CSIQA explicitly addresses this limitation by augmenting local absolute prediction with global relative-quality contrast."
    },
    {
      "title": "MUSIQ: Multi-Scale Image Quality Transformer",
      "authors": "Ke et al.",
      "year": 2021,
      "role": "Baseline",
      "relationship_sentence": "A strong transformer-based BIQA baseline focused on absolute MOS prediction; CSIQA improves over such models by integrating global quality context through contrastive learning."
    },
    {
      "title": "MANIQA: Multi-Dimensional Attention Network for No-Reference Image Quality Assessment",
      "authors": "Yang et al.",
      "year": 2022,
      "role": "Extension",
      "relationship_sentence": "Introduced quality-aware attention for BIQA; CSIQA modifies this line by introducing a quality-aware mask attention that enforces local sensitivity via random masking, enhancing focus on distortion-critical regions."
    }
  ],
  "synthesis_narrative": "CSIQA’s core idea—marrying global relative-quality context with local distortion sensitivity—arises from two converging threads in BIQA. First, RankIQA and PaQ-2-PiQ established that relative comparisons are a natural and robust supervision signal for human quality perception. CSIQA builds on this foundation but moves beyond pairwise or listwise training to a global, dataset-level representation of quality relations by designing contrastive strategies that encode how images compare across the entire training set. Second, CONTRIQUE showed that contrastive learning can produce quality-aware features without relying solely on absolute MOS labels. CSIQA extends this contrastive paradigm by explicitly structuring positives/negatives around quality context rather than generic instance identity or distortion type, thereby capturing latent inter-image quality correlations the prior work leaves implicit.\nAt the same time, widely adopted absolute-regression systems such as NIMA and MUSIQ deliver strong performance but inherently ignore relational (global) cues; CSIQA directly addresses this gap by fusing a global contrastive objective with local prediction. Finally, attention-based BIQA advances typified by MANIQA highlight the value of attending to quality-relevant regions, yet lack explicit mechanisms to enforce local sensitivity under incomplete evidence. CSIQA modifies this attention line with a quality-aware mask attention module that uses random masking to force robustness and sharpen focus on distortion-critical patches. Together, these strands form the direct intellectual lineage of CSIQA’s integrated global–local BIQA paradigm.",
  "analysis_timestamp": "2026-01-06T23:09:26.503330"
}