{
  "prior_works": [
    {
      "title": "Étude critique de la notion de collectif",
      "authors": "Jean Ville",
      "year": 1939,
      "role": "foundational theory",
      "relationship_sentence": "The paper’s validity mechanism—nonnegative wealth processes yielding anytime-valid inference—relies on Ville’s inequality, which turns test supermartingales from betting strategies into confidence sequences."
    },
    {
      "title": "Game-Theoretic Foundations for Probability and Finance",
      "authors": "Glenn Shafer, Vladimir Vovk",
      "year": 2019,
      "role": "conceptual framework",
      "relationship_sentence": "The proposed gambling framework and use of e-process/wealth language directly build on Shafer–Vovk’s game-theoretic probability view, where capital processes from bets underpin sequential testing and estimation."
    },
    {
      "title": "Time-uniform, nonparametric, nonasymptotic confidence sequences",
      "authors": "Steven R. Howard, Aaditya Ramdas, Jon McAuliffe, Jasjeet S. Sekhon",
      "year": 2021,
      "role": "method extended",
      "relationship_sentence": "This work established a general supermartingale/mixture recipe for confidence sequences for bounded processes; the current paper extends that recipe from scalar to multivariate/bounded-vector means through a reduction within a gambling framework."
    },
    {
      "title": "Estimation with e-values",
      "authors": "Ian Waudby-Smith, Aaditya Ramdas",
      "year": 2023,
      "role": "betting-based estimation blueprint",
      "relationship_sentence": "Their coin-betting approach to anytime-valid estimation for bounded means directly motivates the paper’s extension of the coin-toss framework to categorical/probability-vector observations and general bounded random vectors."
    },
    {
      "title": "Universal Portfolios",
      "authors": "Thomas M. Cover",
      "year": 1991,
      "role": "portfolio mixture strategy",
      "relationship_sentence": "The paper’s ‘mixture portfolio’ for constructing multivariate CSs is explicitly akin to Cover’s universal portfolio, adapting universal wealth aggregation over portfolios to design test supermartingales and tight multivariate confidence sets."
    },
    {
      "title": "Coin Betting and Parameter-Free Online Learning",
      "authors": "Francesco Orabona, Dávid Pál",
      "year": 2016,
      "role": "algorithmic inspiration",
      "relationship_sentence": "Coin-betting strategies that convert sequential gains into robust wealth processes inform the design of portfolio-based e-processes used here, enabling parameter-free adaptivity and tightness in the resulting CSs."
    },
    {
      "title": "Probability inequalities for the sum in sampling without replacement",
      "authors": "Robert J. Serfling",
      "year": 1974,
      "role": "application-specific foundation",
      "relationship_sentence": "Classical without-replacement concentration with finite-population corrections provides the baseline structure that the paper adapts its gambling-based CSs to in the finite categorical sampling setting."
    }
  ],
  "synthesis_narrative": "The paper’s core innovation—constructing tight, anytime-valid confidence sequences for means of bounded random vectors via a general gambling framework—rests on the supermartingale logic inaugurated by Ville, which guarantees time-uniform validity from wealth processes. Shafer and Vovk’s game-theoretic formulation provides the conceptual substrate: inference is conducted through bets whose capital processes (e-processes) certify evidence. Building on this, Howard, Ramdas, and coauthors supplied a general recipe for confidence sequences using nonnegative supermartingales and mixture constructions for bounded processes; the present work extends that scalar recipe to categorical and multidimensional observations through a simple reduction, yielding multivariate CSs.\nA key design element is the adoption of a mixture portfolio, explicitly inspired by Cover’s universal portfolio, to aggregate across portfolio choices and produce powerful multivariate test supermartingales. This exploitation of wealth aggregation mirrors universal portfolio ideas and is operationalized using coin-betting principles from Orabona and Pál, which translate parameter-free online gains into robust capital processes—crucial for adaptive, tight CSs without delicate tuning.\nFor the application to sampling without replacement in finite categorical populations, the framework aligns with classical finite-population concentration (Serfling), enabling tailored anytime-valid CSs that respect the reduced variance structure inherent to without-replacement sampling. Collectively, these works supply (i) the validity engine (Ville; Shafer–Vovk), (ii) the modern CS construction toolkit (Howard et al.; Waudby-Smith & Ramdas), and (iii) the multivariate strength via portfolio mixtures (Cover) and coin-betting adaptivity (Orabona & Pál), culminating in the paper’s general, tight gambling-based CSs for bounded random vectors.",
  "analysis_timestamp": "2026-01-06T23:42:48.072047"
}