{
  "prior_works": [
    {
      "title": "On the number of experiments sufficient and in the worst case necessary to identify all causal relations among N variables",
      "authors": "Frederick Eberhardt, Clark Glymour, Richard Scheines",
      "year": 2005,
      "role": "Worst‑case identifiability and experimental design for causal graphs",
      "relationship_sentence": "Introduced the idea that a family of interventions that hits at least one endpoint of every edge suffices for worst‑case identification of the DAG—i.e., the graph separating system this paper builds upon and restricts to."
    },
    {
      "title": "Interventional Markov Equivalence Classes: Characterization and Greedy Search",
      "authors": "Anne Hauser, Peter Bühlmann",
      "year": 2012,
      "role": "Identifiability under interventions and I‑MEC framework",
      "relationship_sentence": "Characterized how interventions change Markov equivalence (I‑MECs) and how intervening on edge endpoints orients edges, providing the formal basis for using edge‑cutting interventions and certifying correctness of learned graphs."
    },
    {
      "title": "Learning Causal Graphs with Small Number of Experiments",
      "authors": "Karthikeyan Shanmugam, Murat Kocaoglu, Alexandros G. Dimakis, Sriram Shakkottai",
      "year": 2015,
      "role": "Combinatorial constructions and bounds for separating systems",
      "relationship_sentence": "Established tight bounds and constructions for separating systems under intervention‑size constraints, supplying canonical intervention sets that this work adaptively explores rather than fixing offline."
    },
    {
      "title": "Budgeted Experiment Design for Causal Structure Learning",
      "authors": "Saber Ghassami, Masoud Salehkaleybar, S. Hamed Hassani, Negar Kiyavash",
      "year": 2018,
      "role": "Cost‑aware offline selection of interventions that cut all edges",
      "relationship_sentence": "Formulated choosing interventions to cut every edge as a budgeted combinatorial design problem, a precursor that the present paper extends by allocating samples online over such sets with finite‑sample guarantees."
    },
    {
      "title": "Optimal Best Arm Identification with Fixed Confidence",
      "authors": "Aurélien Garivier, Emilie Kaufmann",
      "year": 2016,
      "role": "Track‑and‑Stop methodology for pure‑exploration bandits",
      "relationship_sentence": "Provides the track‑and‑stop template—tracking optimal sampling proportions and a generalized likelihood‑ratio stopping rule—that the authors adapt to the intervention‑selection and stopping problem in causal discovery."
    },
    {
      "title": "Sequential Design of Experiments",
      "authors": "Herman Chernoff",
      "year": 1959,
      "role": "Foundations of GLR‑based sequential testing and fixed‑confidence stopping",
      "relationship_sentence": "Supplies the GLR machinery underpinning fixed‑confidence stopping rules, which this paper leverages to decide when enough interventional data has been collected to certify a causal graph."
    }
  ],
  "synthesis_narrative": "The paper’s core contribution—an adaptive, fixed‑confidence online experimental design for finite‑sample causal discovery—sits at the intersection of identifiability from interventions and pure‑exploration bandit methodology. The identifiability side is anchored by Eberhardt, Glymour, and Scheines’ worst‑case analysis showing that interventions that cut every edge suffice to determine a DAG, the very notion formalized and operationalized through interventional Markov equivalence classes (I‑MECs) by Hauser and Bühlmann. Subsequent combinatorial works made this constructive: Shanmugam et al. provided tight bounds and constructions for separating systems under constraints on intervention sizes, while Ghassami et al. framed the selection of such interventions as a budgeted, offline design problem. These lines collectively establish the feasibility and structure of the intervention family the current work restricts to.\nOn the sequential decision‑making side, the algorithmic blueprint is imported from best‑arm identification in bandits. Garivier and Kaufmann’s Track‑and‑Stop methodology—tracking optimal allocation proportions defined by a Kullback–Leibler divergence program and stopping via a GLR criterion—directly informs the paper’s “allocation matching” rule and its fixed‑confidence termination condition. Chernoff’s classical theory supplies the statistical backbone of the GLR stopping analysis. By marrying separating‑system‑based identifiability with track‑and‑stop style pure exploration, the paper advances from offline, infinite‑sample assumptions to an adaptive procedure that judiciously allocates a finite intervention budget and provably stops once the causal graph is learned with a target confidence.",
  "analysis_timestamp": "2026-01-07T00:02:04.887416"
}