{
  "prior_works": [
    {
      "title": "Hopfield Networks is All You Need",
      "authors": "Thomas M. Ramsauer et al.",
      "year": 2021,
      "role": "Baseline",
      "relationship_sentence": "Established the equivalence between modern Hopfield updates and transformer attention via a softmax-based energy, which this paper generalizes by replacing softmax with Fenchel-Young–induced sparse/structured transformations."
    },
    {
      "title": "Learning with Fenchel-Young Losses",
      "authors": "Mathieu Blondel et al.",
      "year": 2020,
      "role": "Foundation",
      "relationship_sentence": "Introduced the framework of regularized prediction functions and Fenchel-Young losses, directly enabling the paper’s Hopfield–Fenchel-Young energies and the link between convex regularizers, margins, and sparse predictions."
    },
    {
      "title": "From Softmax to Sparsemax: A Sparse Model of Attention and Multi-Label Classification",
      "authors": "André F. T. Martins et al.",
      "year": 2016,
      "role": "Extension",
      "relationship_sentence": "Proposed sparsemax as a sparse alternative to softmax derived from a convex regularizer, which the paper instantiates as a specific Fenchel-Young choice to obtain end-to-end differentiable sparse Hopfield updates."
    },
    {
      "title": "Sparse Sequence-to-Sequence Models",
      "authors": "Ben Peters et al.",
      "year": 2019,
      "role": "Extension",
      "relationship_sentence": "Introduced alpha-entmax, a family of sparse probability transforms with tunable sparsity and margin properties, which this paper adopts within the Fenchel-Young lens to control sparsity and exact memory retrieval in Hopfield dynamics."
    },
    {
      "title": "SparseMAP: Differentiable Sparse Structured Inference",
      "authors": "André F. T. Martins et al.",
      "year": 2019,
      "role": "Extension",
      "relationship_sentence": "Provides the sparse and differentiable structured inference operator that the paper uses to extend Hopfield networks to retrieve structured pattern associations instead of single patterns."
    },
    {
      "title": "Structured Attention Networks",
      "authors": "Yoon Kim et al.",
      "year": 2017,
      "role": "Related Problem",
      "relationship_sentence": "Demonstrated replacing vanilla attention with structured inference inside neural networks, informing this paper’s move from scalar pattern retrieval to structured associative retrieval within a Hopfield framework."
    }
  ],
  "synthesis_narrative": "The core contribution of Sparse and Structured Hopfield Networks is a principled generalization of modern Hopfield updates using Fenchel–Young (FY) theory to yield sparse and structured memory retrieval. This builds directly on Ramsauer et al., who showed that modern Hopfield updates coincide with softmax attention; their softmax-based energy serves as the baseline that this work generalizes. The theoretical engine enabling this generalization is Blondel et al.’s FY losses and regularized prediction functions, which provide the convex-analytic link between energies, prediction mappings, and margins. Within this FY framework, Martins & Astudillo’s sparsemax becomes a concrete choice that yields exact zeros and thus sparse Hopfield updates, while Peters et al.’s alpha-entmax supplies a tunable family connecting sparsity and margin, a relationship the present paper sharpens to analyze exact retrieval conditions.\n\nBeyond sparsity, the paper’s structured extension hinges on SparseMAP (Martins & Niculae), a differentiable, sparse structured inference operator; by plugging SparseMAP into the FY-derived Hopfield energy, the authors enable retrieval of composite pattern associations rather than a single item. This move is conceptually aligned with the broader idea of structured attention (Kim et al.), which showed the utility of embedding structured inference within attention mechanisms. Together, these works directly shape the paper’s unified Hopfield–FY framework, its sparse update rules with margin–sparsity–retrieval guarantees, and its novel structured Hopfield networks via SparseMAP.",
  "analysis_timestamp": "2026-01-06T23:09:26.448925"
}