{
  "prior_works": [
    {
      "title": "On the representation of continuous functions of several variables by superpositions of continuous functions of one variable and addition",
      "authors": "A. N. Kolmogorov",
      "year": 1957,
      "role": "Foundation",
      "relationship_sentence": "Kolmogorov’s superposition theorem established that multivariate continuous functions can be built from compositions of a finite, dimension-dependent set of inner functions, directly motivating this paper’s pursuit of a finite, dimension-dependent “vocabulary” of maps for universal approximation."
    },
    {
      "title": "Approximation by superpositions of a sigmoidal function",
      "authors": "George Cybenko",
      "year": 1989,
      "role": "Foundation",
      "relationship_sentence": "Cybenko provided the canonical universal approximation framework for continuous functions on compact sets, which this work retains in spirit while removing the need for continuously varying weights by replacing them with compositions from a fixed finite set."
    },
    {
      "title": "Fractals and self similarity",
      "authors": "John E. Hutchinson",
      "year": 1981,
      "role": "Inspiration",
      "relationship_sentence": "Hutchinson’s iterated function systems showed how a finite family of contractions, repeatedly composed, can generate arbitrarily complex sets; this compositional viewpoint directly inspires using a finite alphabet of mappings to synthesize complex target functions."
    },
    {
      "title": "The Expressive Power of Neural Networks: A View from the Width",
      "authors": "Zhou Lu et al.",
      "year": 2017,
      "role": "Gap Identification",
      "relationship_sentence": "Lu et al. proved universal approximation with width-bounded ReLU networks but still relied on freely tuned real-valued weights; this paper targets that explicit gap by constructing universality from a finite, input-independent vocabulary of maps."
    },
    {
      "title": "Error bounds for approximations with deep ReLU networks",
      "authors": "Dmitry Yarotsky",
      "year": 2017,
      "role": "Gap Identification",
      "relationship_sentence": "Yarotsky’s constructive error bounds rely on continuously parameterized weights; the present work advances this line by giving a constructive universality result with a fixed finite set of reusable mappings instead of an effectively infinite parameter space."
    },
    {
      "title": "Coupling-based invertible neural networks are universal diffeomorphism approximators",
      "authors": "Ryota Teshima et al.",
      "year": 2020,
      "role": "Related Problem",
      "relationship_sentence": "Teshima et al. showed that stacking a fixed-form building block achieves universality for diffeomorphisms; this paper generalizes the compositional-universality idea to arbitrary continuous (not necessarily invertible) maps using a finite, pre-specified vocabulary."
    },
    {
      "title": "Unitary Triangularization of a Nonsymmetric Matrix",
      "authors": "A. S. Householder",
      "year": 1958,
      "role": "Extension",
      "relationship_sentence": "Householder’s decomposition of general linear operators into products of simple reflections underpins the constructive design and O(d^2) counting of linear primitives in the finite vocabulary used to assemble arbitrary mappings."
    }
  ],
  "synthesis_narrative": "The paper’s core contribution—showing that a finite, dimension-dependent vocabulary of maps of size O(d^2) suffices for universal approximation via composition—sits at the intersection of classical approximation theory and modern compositional architectures. Kolmogorov’s superposition theorem is the conceptual keystone: it proved that multivariate continuous functions arise from compositions with a finite set of inner functions depending only on dimension, directly inspiring the search for a dimension-dependent, function-agnostic vocabulary. Cybenko’s universal approximation theorem provided the standard compact-domain formulation and error criterion, which this work preserves while overcoming the need for continuously varying weights. Hutchinson’s iterated function systems offered a powerful precedent that finite sets of maps, repeatedly composed, can generate complex structures—an idea mirrored here for function approximation rather than set attractors.\n\nContemporary expressivity results highlight the precise gap this paper closes. Lu et al. established width-bounded universality and Yarotsky gave constructive error bounds, but both frameworks crucially require an effectively infinite continuum of adjustable weights. By contrast, this paper proves universality from a fixed, finite alphabet of mappings. Finally, linear-algebraic factorization tools like Householder reflections inform the constructive argument and the O(d^2) scaling by showing how general linear components can be assembled from a small set of primitive transformations. Relatedly, universality results for coupling-based normalizing flows (Teshima et al.) demonstrate that stacking a fixed-form block can be universally expressive; this work broadens that compositional paradigm to arbitrary continuous maps with a finite, pre-specified vocabulary.",
  "analysis_timestamp": "2026-01-06T23:09:26.467957"
}