{
  "prior_works": [
    {
      "title": "Learning to Branch in Mixed Integer Programming",
      "authors": "Maxime Gasse et al.",
      "year": 2019,
      "role": "Foundation",
      "relationship_sentence": "Introduced the variable–constraint bipartite graph representation and learned embeddings for MILPs, which ACM-MILP leverages to define a latent space over constraints and their interrelations for adaptive selection and grouping."
    },
    {
      "title": "Learning to Branch in Mixed Integer Programming",
      "authors": "Elias B. Khalil et al.",
      "year": 2016,
      "role": "Related Problem",
      "relationship_sentence": "Established the precedent of exploiting problem structure and features in MILPs for learning, motivating ACM-MILP’s explicit modeling of constraint dependencies rather than random, structure-agnostic edits."
    },
    {
      "title": "Generating SAT instances with community structure",
      "authors": "Jordi Giráldez-Cru et al.",
      "year": 2016,
      "role": "Inspiration",
      "relationship_sentence": "Demonstrated that preserving and controlling community structure is key to hardness and realism in generated instances, directly inspiring ACM-MILP’s use of community detection to group strongly related constraints for collective modifications."
    },
    {
      "title": "Modularity and community detection in bipartite networks",
      "authors": "Michael J. Barber",
      "year": 2007,
      "role": "Foundation",
      "relationship_sentence": "Provided the theoretical basis for detecting communities in bipartite graphs, which ACM-MILP applies to the constraint–variable bipartite structure to identify coherent constraint groups."
    },
    {
      "title": "Fast unfolding of communities in large networks",
      "authors": "Vincent D. Blondel et al.",
      "year": 2008,
      "role": "Extension",
      "relationship_sentence": "Supplied a practical modularity-based community detection algorithm (Louvain) that ACM-MILP adapts to efficiently discover strongly related constraint groups for collective modification."
    },
    {
      "title": "Machine Learning for Combinatorial Optimization: A Methodological Tour d’Horizon",
      "authors": "Yoshua Bengio et al.",
      "year": 2021,
      "role": "Gap Identification",
      "relationship_sentence": "Explicitly highlighted data scarcity and distribution shift issues in ML for CO/MILP, motivating ACM-MILP’s goal of hardness-preserving, structure-aware instance generation rather than simplistic random perturbations."
    }
  ],
  "synthesis_narrative": "ACM-MILP’s core innovation—adapting constraint modifications using a learned latent space while preserving constraint interrelations via community detection—rests on two direct pillars: learned structural representations of MILPs and the centrality of community structure for instance hardness. On the MILP side, Gasse et al. (2019) provided the variable–constraint bipartite graph view and learned embeddings that make it natural to embed constraints and reason about their relationships, a foundation ACM-MILP directly uses for probability-based, latent-space-driven constraint selection. Earlier, Khalil et al. (2016) established the value of exploiting problem structure and features in MILPs for learning-guided decisions, underscoring the inadequacy of structure-agnostic random edits that ACM-MILP replaces.\n\nFrom the instance-generation perspective, Giráldez-Cru and Levy (2016) showed that preserving community structure is crucial to maintaining realism and hardness in generated SAT instances, directly inspiring ACM-MILP’s shift from single-constraint tweaks to community-aware, collective modifications. This is operationalized through community detection on the MILP’s bipartite graph: Barber (2007) provides the bipartite modularity framework and Blondel et al. (2008) the scalable Louvain algorithm, both of which ACM-MILP extends to identify strongly related constraints for grouped edits. Finally, Bengio et al. (2021) articulate the broader gap—data scarcity and distribution shift for ML4CO—providing the motivation for ACM-MILP’s hardness-preserving generation approach that advances beyond random perturbation baselines by explicitly modeling instance structure and interdependencies.",
  "analysis_timestamp": "2026-01-06T23:09:26.465000"
}