{
  "prior_works": [
    {
      "title": "DiffDock: Diffusion Steps, Twists, and Turns for Molecular Docking",
      "authors": "Gabriele Corso et al.",
      "year": 2023,
      "role": "Baseline",
      "relationship_sentence": "Re-Dock directly generalizes DiffDock’s diffusion-based pose generation by moving from rigid-protein docking to a diffusion-bridge that jointly samples ligand pose and pocket sidechain conformations, addressing DiffDock’s reliance on holo/rigid structures."
    },
    {
      "title": "EquiBind: Geometric Deep Learning for Drug Binding Structure Prediction",
      "authors": "Hannes Stärk et al.",
      "year": 2022,
      "role": "Gap Identification",
      "relationship_sentence": "EquiBind’s rigid-receptor formulation and resulting unrealistic poses in cross-docking highlight the core gap—neglect of pocket flexibility—that Re-Dock targets with a flexible, energy-constrained generative process."
    },
    {
      "title": "TANKBind: Trigonometry-Aware Neural Networks for Protein–Ligand Binding Structure Prediction",
      "authors": "Shengchao Luo et al.",
      "year": 2022,
      "role": "Gap Identification",
      "relationship_sentence": "TANKBind emphasized cross-docking realism and energy-aware modeling but kept the pocket largely rigid; Re-Dock directly addresses this limitation by co-modeling sidechain motions via a diffusion bridge and an energy-to-geometry mapping."
    },
    {
      "title": "Torsional Diffusion for Molecular Conformer Generation",
      "authors": "Bowen Jing et al.",
      "year": 2022,
      "role": "Extension",
      "relationship_sentence": "Re-Dock extends torsional diffusion ideas to a joint ligand–pocket setting, applying diffusion on angular manifolds (e.g., sidechain chi angles) so that protein torsions co-evolve with ligand pose during docking."
    },
    {
      "title": "Riemannian Score-Based Generative Modeling",
      "authors": "Mathieu De Bortoli et al.",
      "year": 2022,
      "role": "Foundation",
      "relationship_sentence": "Re-Dock’s diffusion on geometric manifolds (SE(3)/SO(3)/torus for poses and torsions) is grounded in Riemannian score-based modeling, which provides the stochastic processes and score parameterizations on manifolds."
    },
    {
      "title": "Diffusion Schrödinger Bridge with Applications to Score-Based Generative Modeling",
      "authors": "Mathieu De Bortoli et al.",
      "year": 2021,
      "role": "Foundation",
      "relationship_sentence": "Re-Dock instantiates a conditional diffusion bridge between apo pockets and holo complexes, directly leveraging Schrödinger-bridge formulations to guide trajectories from initial (apo) to target (bound) distributions."
    }
  ],
  "synthesis_narrative": "Re-Dock’s core innovation—flexible docking via a diffusion bridge on geometric manifolds with an energy-to-geometry coupling—emerges from converging lines of prior work. DiffDock established the feasibility of diffusion models for docking but assumed rigid receptors and mostly holo pockets; Re-Dock upgrades this paradigm to a conditional bridge that transports from apo to bound states while co-sampling ligand pose and pocket sidechains. Earlier geometric baselines like EquiBind, and energy-aware cross-docking systems like TANKBind, exposed the key practical gap—neglect of receptor flexibility—which Re-Dock tackles head-on by modeling sidechain torsions during pose generation. Methodologically, the ability to operate natively on rotations and torsions is grounded in Riemannian score-based generative modeling, which formalizes diffusion and score estimation on manifolds such as SO(3) and tori. Building on this foundation, torsional diffusion for molecular conformers provided concrete mechanisms for angular noise processes and denoising on periodic spaces; Re-Dock extends these mechanisms to protein sidechains and integrates them with ligand SE(3) updates. Finally, Schrödinger-bridge formulations supply the conditional generation framework that allows Re-Dock to model realistic apo-to-holo transitions. Together, these works directly shape Re-Dock’s design: a manifold-aware diffusion bridge that unifies ligand pose, sidechain flexibility, and an energy-to-geometry mapping inspired by Newton–Euler dynamics to produce realistic, energy-consistent docking outcomes.",
  "analysis_timestamp": "2026-01-06T23:09:26.408007"
}