{
  "prior_works": [
    {
      "title": "Algorithmic Learning in a Random World",
      "authors": "Vovk et al.",
      "year": 2005,
      "role": "Foundation",
      "relationship_sentence": "Provides the foundational conformal prediction framework (nonconformity scores, coverage guarantees) that MultiDimSPCI adopts and adapts to produce distribution-free prediction regions."
    },
    {
      "title": "Distribution-Free Predictive Inference for Regression",
      "authors": "Lei et al.",
      "year": 2018,
      "role": "Foundation",
      "relationship_sentence": "Introduces split conformal calibration, the core distribution-free recipe that MultiDimSPCI leverages in a sequential setting to guarantee finite-sample coverage."
    },
    {
      "title": "Conformal prediction under covariate shift",
      "authors": "Tibshirani et al.",
      "year": 2019,
      "role": "Inspiration",
      "relationship_sentence": "Shows how to preserve conformal validity under distribution shift via weighting, directly motivating MultiDimSPCI’s handling of non-exchangeable (time-dependent) data in sequential calibration."
    },
    {
      "title": "Conformalized Quantile Regression",
      "authors": "Romano et al.",
      "year": 2019,
      "role": "Baseline",
      "relationship_sentence": "A leading univariate forecasting baseline that MultiDimSPCI explicitly surpasses by producing valid joint prediction regions (rather than marginal intervals) for multivariate responses."
    },
    {
      "title": "EnbPI: Ensemble Bootstrap Prediction Intervals for Deep Learning",
      "authors": "Xu et al.",
      "year": 2021,
      "role": "Baseline",
      "relationship_sentence": "A strong time-series baseline from the same line of work that focuses on univariate intervals; MultiDimSPCI addresses its limitation by delivering distribution-free multivariate regions and theory for non-exchangeable sequences."
    },
    {
      "title": "Sequential Predictive Conformal Inference",
      "authors": "Xu et al.",
      "year": 2023,
      "role": "Extension",
      "relationship_sentence": "MultiDimSPCI directly extends the SPCI framework to vector-valued responses by redesigning the score into a Mahalanobis-type form and calibrating ellipsoidal regions with finite-sample conditional coverage gap bounds."
    },
    {
      "title": "The Generalization of Student’s Ratio",
      "authors": "Hotelling",
      "year": 1931,
      "role": "Inspiration",
      "relationship_sentence": "Introduces prediction ellipses for multivariate normal models; MultiDimSPCI adapts the ellipsoidal shape idea in a distribution-free conformal framework via Mahalanobis-based nonconformity scores."
    }
  ],
  "synthesis_narrative": "The intellectual lineage of MultiDimSPCI traces from the foundations of conformal prediction to modern adaptations for non-exchangeable time series and multivariate outputs. Vovk et al. established the conformal paradigm—nonconformity scoring and finite-sample coverage—that underpins the method’s distribution-free guarantees, while Lei et al. provided the split conformal recipe that MultiDimSPCI uses in a sequential calibration scheme. Addressing the central challenge of non-exchangeability in time series, Tibshirani et al. demonstrated how weighting can retain validity under distribution shift, a key insight that informs MultiDimSPCI’s sequential treatment of dependent data. On the application side, Romano et al.’s conformalized quantile regression remains a primary univariate baseline for forecasting; its limitation to scalar intervals motivates MultiDimSPCI’s joint prediction regions. EnbPI is a strong time-series baseline from the same research thread, but it, too, is inherently univariate—MultiDimSPCI advances beyond it by constructing multivariate, volume-efficient regions with provable high-probability conditional coverage bounds. Technically, the method’s ellipsoidal regions are inspired by classical Hotelling prediction ellipses, realized here through a Mahalanobis-type nonconformity score and conformal calibration to remain distribution-free. Finally, MultiDimSPCI is a direct extension of the authors’ sequential predictive conformal inference (SPCI), generalizing its sequential calibration to vector-valued responses and yielding finite-sample guarantees tailored to multivariate time series.",
  "analysis_timestamp": "2026-01-06T23:09:26.421339"
}