{
  "prior_works": [
    {
      "title": "Sliced and Radon Wasserstein Barycenters of Measures",
      "authors": "Bonneel et al.",
      "year": 2015,
      "role": "Foundation",
      "relationship_sentence": "Established the sliced/Radon-Wasserstein paradigm—reducing high-dimensional OT to 1D projections via (generalized) Radon transforms—which S3W ports to spherical data through stereographic projection."
    },
    {
      "title": "Generalized Sliced Wasserstein Distances",
      "authors": "Kolouri et al.",
      "year": 2019,
      "role": "Extension",
      "relationship_sentence": "Introduced the use of generalized Radon transforms and non-linear projections to define sliced OT variants; S3W adopts this generalized slicing framework and adapts it to spherical measures through a stereographic map."
    },
    {
      "title": "The Radon Cumulative Distribution Transform and its Inverse",
      "authors": "Park et al.",
      "year": 2018,
      "role": "Foundation",
      "relationship_sentence": "Provided the distribution-transform viewpoint grounded in Radon geometry for probability measures, a key mathematical toolset S3W leverages when formulating spherical slicing via stereographic projection and correcting projection-induced distortions."
    },
    {
      "title": "A Newton Algorithm for Semi-Discrete Optimal Transport",
      "authors": "Kitagawa et al.",
      "year": 2019,
      "role": "Gap Identification",
      "relationship_sentence": "Represents state-of-the-art but computationally heavy OT on manifolds (including spherical settings); S3W is explicitly motivated as a fast, highly parallelizable alternative to such semi-discrete spherical OT solvers."
    },
    {
      "title": "Max-Sliced Wasserstein Distance",
      "authors": "Deshpande et al.",
      "year": 2019,
      "role": "Inspiration",
      "relationship_sentence": "Optimizing over projection directions to induce invariances/robustness in sliced OT inspired S3W’s rotationally invariant variant, which optimizes over rotations to remove orientation dependence on the sphere."
    },
    {
      "title": "Manifold Sliced Wasserstein Distance",
      "authors": "Nguyen et al.",
      "year": 2022,
      "role": "Baseline",
      "relationship_sentence": "Formulated sliced OT directly on Riemannian manifolds; S3W targets the sphere specifically and improves computational efficiency by flattening via stereographic projection and analytically correcting distortion."
    }
  ],
  "synthesis_narrative": "S3W’s core innovation—fast, parallelizable sliced Wasserstein distances for spherical distributions via stereographic projection with explicit distortion correction—sits squarely on the intellectual lineage of sliced optimal transport and Radon-based formulations. Bonneel et al. (2015) provided the foundational blueprint: approximate high-dimensional OT by integrating 1D Wasserstein distances over projected views, tightly linked to the Radon transform. Kolouri et al. (2019) generalized this paradigm to non-linear and generalized Radon transforms, a crucial step S3W builds upon to define spherical slicing after mapping the sphere to Euclidean space. Park et al. (2018) further grounded the use of Radon-style transforms for probability measures, informing S3W’s transform-driven perspective and facilitating principled distortion handling.\n\nOn the application side, existing spherical OT solvers—typified by semi-discrete Newton methods (Kitagawa et al., 2019)—deliver accurate geodesic-cost OT but remain computationally heavy; S3W explicitly addresses this gap with a highly parallel slicing pipeline. Moreover, ideas from max-sliced Wasserstein (Deshpande et al., 2019)—optimizing over directions to induce invariances—directly inspire S3W’s rotationally invariant variant, which minimizes dependence on a chosen orientation. Finally, manifold sliced Wasserstein (Nguyen et al., 2022) offers a direct baseline for doing sliced OT on manifolds; S3W specializes to spheres and achieves speed by stereographically flattening the geometry and analytically compensating for the conformal distortion. Together, these works directly enabled S3W’s formulation and motivated its efficiency and invariance properties.",
  "analysis_timestamp": "2026-01-06T23:09:26.446409"
}