{
  "prior_works": [
    {
      "title": "Generative Agents: Interactive Simulacra of Human Behavior",
      "authors": "Joon Sung Park et al.",
      "year": 2023,
      "role": "Foundation",
      "relationship_sentence": "CompeteAI adopts the idea of an LLM-populated town with memory, planning, and long-horizon interaction from Generative Agents and repurposes it to a market setting where agents explicitly compete (restaurants vs. customers)."
    },
    {
      "title": "Large Language Models as Simulated Economic Agents",
      "authors": "John J. Horton",
      "year": 2023,
      "role": "Foundation",
      "relationship_sentence": "CompeteAI builds directly on the premise that LLMs can function as economic agents, extending Horton’s single-agent/small-scale economic decision settings to multi-agent competitive market dynamics and strategy evolution."
    },
    {
      "title": "Out of One, Many: Using Language Models to Simulate Human Samples",
      "authors": "Lisa P. Argyle et al.",
      "year": 2023,
      "role": "Inspiration",
      "relationship_sentence": "By showing LLMs can approximate human preferences and demographic variation, this work motivates CompeteAI’s design of customer agents whose heterogeneous choices drive market competition among restaurant agents."
    },
    {
      "title": "CAMEL: Communicative Agents for ‘Mind’ Exploration with Language Models",
      "authors": "Li et al.",
      "year": 2023,
      "role": "Gap Identification",
      "relationship_sentence": "CAMEL established multi-agent LLM cooperation via role-play, and CompeteAI explicitly addresses its gap by formulating and analyzing competitive objectives and dynamics rather than collaboration."
    },
    {
      "title": "AutoGen: Enabling Next-Gen LLM Applications via Multi-Agent Conversation",
      "authors": "Wu et al.",
      "year": 2023,
      "role": "Extension",
      "relationship_sentence": "CompeteAI extends the multi-agent conversation paradigm popularized by AutoGen to instantiate adversarial/competitive interactions and market feedback loops between restaurant and customer agents."
    },
    {
      "title": "MACHIAVELLI: Benchmarking LLMs’ Deception and Power-Seeking with Interactive Fiction",
      "authors": "Pan et al.",
      "year": 2023,
      "role": "Related Problem",
      "relationship_sentence": "MACHIAVELLI reveals strategic, goal-directed (sometimes adversarial) behaviors in LLMs, informing CompeteAI’s investigation of how competitive pressures elicit strategic adaptation in market-like environments."
    },
    {
      "title": "Stability in Competition",
      "authors": "Harold Hotelling",
      "year": 1929,
      "role": "Foundation",
      "relationship_sentence": "Hotelling’s spatial competition model provides the economic-theory backbone CompeteAI uses to design and interpret restaurant competition (e.g., location/positioning and pricing), aligning micro–macro outcomes with classic market theory."
    }
  ],
  "synthesis_narrative": "CompeteAI’s core innovation—formalizing and empirically analyzing competition among LLM-based agents in a realistic, evolving market—arises from three converging lines of prior work. First, Generative Agents demonstrated that LLMs can sustain long-horizon, memory-rich social simulations in a town, establishing the substrate CompeteAI transforms into a market with explicit rivalrous objectives. Second, social-science–oriented LLM simulation works (Argyle et al.) and economic-agent modeling (Horton) provided the key premise that LLMs can act as economically meaningful agents with heterogeneous preferences and decision rules; CompeteAI operationalizes this by casting customers as demand and restaurants as competing suppliers, letting strategies adapt under competitive pressure. Third, practical multi-agent conversation frameworks (AutoGen) and role-playing setups (CAMEL) supplied the interaction protocol pattern, but largely emphasized cooperation; CompeteAI directly addresses this gap by designing adversarial incentives, market feedback, and longitudinal competition to elicit strategic transformations. Finally, classic economic theory—especially Hotelling’s spatial competition—anchors both the environment’s design (location/positioning and price competition) and the validation of emergent macro-regularities observed in simulation. Complementary evidence from adversarial-behavior studies (MACHIAVELLI) motivates measuring strategic adaptation and unintended behaviors under competition. Together, these works directly enable CompeteAI’s framework and competitive town implementation, while their limitations—a lack of competitive objectives, limited economic structure, and absent micro–macro grounding—are precisely what CompeteAI targets and extends.",
  "analysis_timestamp": "2026-01-06T23:09:26.422369"
}