{
  "prior_works": [
    {
      "title": "Prediction Policy Problems",
      "authors": "Jon Kleinberg; Jens Ludwig; Sendhil Mullainathan; Ziad Obermeyer",
      "year": 2015,
      "role": "Foundational framing of prediction for policy allocation",
      "relationship_sentence": "This paper framed social policy as a prediction problem, providing the baseline assumption—widely adopted in allocation systems—that individual-level predictions are necessary for efficient targeting, which the ICML 2024 paper interrogates and qualifies."
    },
    {
      "title": "Statistical Treatment Rules",
      "authors": "Charles F. Manski",
      "year": 2004,
      "role": "Theoretical foundation for treatment choice and value of information",
      "relationship_sentence": "Manski’s framework for welfare under treatment assignment with covariates underpins the new paper’s formal analysis of when more granular (individual-level) information improves allocation relative to coarse unit-level statistics."
    },
    {
      "title": "Who Should Be Treated? Empirical Welfare Maximization Methods for Treatment Choice",
      "authors": "Toru Kitagawa; Aleksey Tetenov",
      "year": 2018,
      "role": "Policy learning under budget constraints",
      "relationship_sentence": "Empirical welfare maximization formalizes budgeted treatment assignment, a setting the ICML paper leverages to show that the gains from prediction arise primarily when budgets are high and between-unit inequality is low."
    },
    {
      "title": "Estimation and Inference of Heterogeneous Treatment Effects using Random Forests",
      "authors": "Stefan Wager; Susan Athey",
      "year": 2018,
      "role": "Methods enabling individual-level targeting via CATE estimation",
      "relationship_sentence": "By making individual-level treatment heterogeneity estimable, this work represents the predictive targeting approach that the ICML paper evaluates against simpler unit-level allocation rules."
    },
    {
      "title": "Predicting and Optimizing Treatment Assignment",
      "authors": "Hamed Bastani; Mohsen Bayati",
      "year": 2020,
      "role": "Demonstration of ML-driven targeting gains",
      "relationship_sentence": "This paper provides evidence that predictive models can improve allocation, serving as a direct foil for the ICML paper’s result that such gains are contingent on low between-unit inequality and sufficiently large budgets."
    },
    {
      "title": "Targeting of Transfers in Developing Countries: Review of Lessons and Experience",
      "authors": "David Coady; Margaret Grosh; John Hoddinott",
      "year": 2004,
      "role": "Evidence and theory on group/geographic targeting efficacy",
      "relationship_sentence": "Classic insights that geographic or categorical targeting works well when between-group inequality is high motivate the ICML paper’s formalization of when unit-level statistics can rival or beat individual prediction."
    },
    {
      "title": "Targeting the Poor: Evidence from a Field Experiment in Indonesia",
      "authors": "Vivi Alatas; Abhijit Banerjee; Rema Hanna; Benjamin A. Olken; Julia Tobias",
      "year": 2012,
      "role": "Empirical comparison of simple vs sophisticated targeting",
      "relationship_sentence": "Findings that community or simple proxies can match or outperform complex scoring in certain contexts echo the ICML paper’s claim that prediction is not universally necessary, especially when cross-unit disparities are large."
    }
  ],
  "synthesis_narrative": "The paper’s core contribution—showing that individual-level prediction is advantageous for allocation chiefly when between-unit inequality is low and intervention budgets are high—builds on and refines two influential strands of work. First, the prediction-for-policy framing (Kleinberg et al., 2015) and the ML-for-targeting literature (Bastani & Bayati, 2020; Wager & Athey, 2018) posit that individualized risk or treatment-effect estimates can systematically improve resource allocation. Second, economics of treatment choice (Manski, 2004) and policy learning under budget constraints (Kitagawa & Tetenov, 2018) provide the welfare-theoretic tools to quantify the benefit of additional information and to characterize optimal allocation rules.\n\nThe development economics literature on transfer targeting (Coady, Grosh, & Hoddinott, 2004; Alatas et al., 2012) contributes the key structural insight that the decomposition of inequality—between versus within groups—governs the payoff to fine-grained targeting relative to group- or geography-based rules. The ICML paper synthesizes these ideas into a principled model comparing prediction-based allocations to allocations using unit-level statistics (e.g., hospitals, schools, neighborhoods). By varying the “price of prediction,” treatment effect heterogeneity, and learnability of unit aggregates, it delineates parameter regimes where prediction yields incremental welfare gains and where it does not. In doing so, it tempers the default presumption from the prediction-policy paradigm, offering a unifying condition—low between-unit inequality coupled with ample budget—under which sophisticated individual prediction is truly warranted.",
  "analysis_timestamp": "2026-01-07T00:02:04.873411"
}