{
  "prior_works": [
    {
      "title": "Best Arm Identification in Multi-Armed Bandits",
      "authors": "Jean-Yves Audibert and Sébastien Bubeck",
      "year": 2010,
      "role": "Extension",
      "relationship_sentence": "R-UCBE and R-SR are direct rising-aware adaptations of UCBE and Successive Rejects from this paper, preserving their sampling/rejection schedules while modifying confidence terms and gap definitions to account for pull-dependent (rising) means."
    },
    {
      "title": "Pure Exploration in Multi-Armed Bandit Problems",
      "authors": "Sébastien Bubeck, Rémi Munos, and Gilles Stoltz",
      "year": 2009,
      "role": "Foundation",
      "relationship_sentence": "This work formalized the pure-exploration/BAI setting and error-probability objectives that the present paper instantiates in the SRB model, providing the foundational framework for fixed-budget identification analyses."
    },
    {
      "title": "Almost Optimal Exploration in Multi-Armed Bandits",
      "authors": "Zohar Karnin, Tomer Koren, and Oren Somekh",
      "year": 2013,
      "role": "Related Problem",
      "relationship_sentence": "The paper’s gap-dependent hardness measures and allocation insights for BAI inform the present work’s instance-dependent analysis and budget allocation intuition, even though the new algorithms target the SRB (pull-dependent means) setting."
    },
    {
      "title": "On the Complexity of Best-Arm Identification in Multi-Armed Bandit Models",
      "authors": "Emilie Kaufmann, Olivier Cappé, and Aurélien Garivier",
      "year": 2016,
      "role": "Related Problem",
      "relationship_sentence": "Change-of-measure arguments and instance-complexity viewpoints from this work guide how the current paper frames and analyzes error probabilities under SRBs, adapting BAI complexity ideas to rising means."
    },
    {
      "title": "Stochastic Rising Bandits",
      "authors": "Marco Mussi, Alessandro Montenegro, Francesco Trovò, Marcello Restelli, and Alberto Maria Metelli",
      "year": 2023,
      "role": "Gap Identification",
      "relationship_sentence": "This prior work introduced and analyzed SRBs under regret minimization, explicitly leaving pure-exploration/BAI in SRBs open; the present paper fills that gap by designing and analyzing R-UCBE and R-SR for fixed-budget identification."
    }
  ],
  "synthesis_narrative": "The core innovation of this paper—fixed-budget best-arm identification (BAI) under Stochastic Rising Bandits (SRBs)—sits at the intersection of two strands: the SRB modeling of pull-dependent means and the classical BAI algorithms and analyses. On the BAI side, the seminal work of Audibert and Bubeck (2010) introduced the fixed-budget algorithms UCBE and Successive Rejects (SR). The present paper directly extends these designs to the SRB setting: R-UCBE and R-SR retain the UCBE/SR allocation and stagewise rejection mechanics but modify confidence radii and gap surrogates to reflect that expected rewards increase with pulls. The broader pure-exploration framework and error-probability guarantees trace back to Bubeck, Munos, and Stoltz (2009), whose formulation underpins the fixed-budget objective pursued here. Further, insights from Karnin, Koren, and Somekh (2013) and Kaufmann, Cappé, and Garivier (2016) on instance-dependent hardness and change-of-measure analyses inform how the paper calibrates budgets and interprets complexity in a non-i.i.d., pull-dependent environment. On the modeling side, the SRB framework was established in prior work by the same authors (Mussi et al., 2023), but only for regret minimization. That paper explicitly left pure exploration in SRBs open, motivating the present contribution. In short, the current paper’s algorithms are rising-aware extensions of UCBE/SR, and its guarantees adapt classical BAI principles to the SRB model introduced in earlier SRB work, thereby closing the identified gap.",
  "analysis_timestamp": "2026-01-06T23:09:26.501060"
}