{
  "prior_works": [
    {
      "title": "Human memory: A proposed system and its control processes",
      "authors": "Atkinson and Shiffrin",
      "year": 1968,
      "role": "Foundation",
      "relationship_sentence": "Memoria’s multi-store design—with separate fast/short-term and slow/long-term stores and control processes like rehearsal/consolidation—is a direct computational instantiation of the Atkinson–Shiffrin model."
    },
    {
      "title": "Why there are complementary learning systems in the hippocampus and neocortex: insights from the successes and failures of connectionist models",
      "authors": "McClelland et al.",
      "year": 1995,
      "role": "Inspiration",
      "relationship_sentence": "Memoria’s consolidation mechanism and division between rapid, episodic-like memory and gradual, stable storage are explicitly motivated by the Complementary Learning Systems theory to resolve stability–plasticity (fateful forgetting)."
    },
    {
      "title": "A distributed representation of temporal context",
      "authors": "Howard and Kahana",
      "year": 2002,
      "role": "Foundation",
      "relationship_sentence": "Memoria’s context-based retrieval that reproduces temporal contiguity and serial position effects draws directly on the Temporal Context Model’s notion of drifting context and context reinstatement."
    },
    {
      "title": "Neural Turing Machines",
      "authors": "Graves et al.",
      "year": 2014,
      "role": "Foundation",
      "relationship_sentence": "Memoria builds on NTMs’ core idea of differentiable external memory with learned read/write addressing, but replaces their purely short-term retention policy with human-inspired consolidation and decay."
    },
    {
      "title": "Hybrid computing using a neural network with dynamic external memory",
      "authors": "Graves et al.",
      "year": 2016,
      "role": "Baseline",
      "relationship_sentence": "Differentiable Neural Computers are a primary baseline for algorithmic tasks (e.g., sorting), and Memoria directly improves on DNC by preventing long-horizon information loss through selective consolidation and rehearsal."
    },
    {
      "title": "Transformer-XL: Attentive Language Models Beyond a Fixed-Length Context",
      "authors": "Dai et al.",
      "year": 2019,
      "role": "Gap Identification",
      "relationship_sentence": "Memoria targets Transformer-XL’s recency-biased segment-level recurrence by introducing a long-term store that retains older but important information rather than letting it fade with rolling caches."
    },
    {
      "title": "Memorizing Transformers",
      "authors": "Wu et al.",
      "year": 2022,
      "role": "Extension",
      "relationship_sentence": "Memoria extends the notion of persistent key–value memories by adding human-inspired consolidation, decay, and context-driven retrieval that produce primacy/recency and temporal contiguity effects absent in Memorizing Transformers."
    }
  ],
  "synthesis_narrative": "Memoria’s core innovation—combining an external memory with human-like consolidation and retrieval dynamics to prevent long-term loss—sits at the intersection of classic cognitive theory and modern memory-augmented neural networks. The multi-store structure and explicit control processes closely follow Atkinson–Shiffrin, while the consolidation pipeline and separation of rapid versus stable memory are directly inspired by the Complementary Learning Systems view of hippocampal–neocortical interplay. To reproduce human serial position and temporal contiguity effects, Memoria imports the Temporal Context Model’s drifting context and reinstatement mechanisms, making these psychological regularities emergent properties of its retrieval policy.\n\nOn the machine learning side, Neural Turing Machines provided the crucial template of differentiable read–write external memory, and Differentiable Neural Computers served as the main algorithmic-task baseline whose short-horizon retention Memoria surpasses via selective consolidation and rehearsal. In language modeling, Transformer-XL’s segment recurrence highlighted a central gap: memory extended in length but still dominated by recency, allowing older information to be fatefully forgotten. Finally, Memorizing Transformers showed that persistent memories can aid long-range recall, but lacked the human-inspired consolidation/decay and context-driven retrieval needed to yield primacy, recency, and temporal contiguity. By integrating these strands, Memoria transforms external memory from a short-term cache into a human-aligned long-term system that resists fateful forgetting.",
  "analysis_timestamp": "2026-01-06T23:09:26.502372"
}