{
  "prior_works": [
    {
      "title": "Fixed points of nonexpansive mappings in Hilbert space",
      "authors": "B. Halpern",
      "year": 1967,
      "role": "Foundation",
      "relationship_sentence": "Introduced the anchoring mechanism (Halpern iteration), the core fixed-point framework that recent anchor-based accelerated methods for minimax/fixed-point build upon and that this paper shows is not the unique route to optimal acceleration."
    },
    {
      "title": "Prox-method with rate O(1/t) for variational inequalities with Lipschitz continuous monotone operators and smooth convex-concave saddle point problems",
      "authors": "A. Nemirovski",
      "year": 2004,
      "role": "Foundation",
      "relationship_sentence": "Established the modern operator-theoretic and saddle-point/VI framework (Mirror-Prox) that defines the problem class considered here and serves as the baseline operator model underlying both anchor-based acceleration and the H-dual algorithms proposed."
    },
    {
      "title": "Near-optimal algorithms for minimax optimization",
      "authors": "T. Lin et al.",
      "year": 2020,
      "role": "Related Problem",
      "relationship_sentence": "Provided the near-optimal complexity landscape and oracle model for smooth convex–concave minimax problems that subsequent anchor-based optimal methods target and that this work preserves while revealing non-uniqueness via H-duality."
    },
    {
      "title": "Lower bounds for smooth convex–concave minimax optimization",
      "authors": "J. Diakonikolas et al.",
      "year": 2021,
      "role": "Foundation",
      "relationship_sentence": "Gave matching first-order complexity lower bounds that certify optimality of the recent anchor-based accelerated methods; these bounds are the benchmark this paper meets while demonstrating a distinct, H-dual acceleration mechanism."
    },
    {
      "title": "H-duality of first-order methods for monotone operators",
      "authors": "E. K. Ryu et al.",
      "year": 2022,
      "role": "Inspiration",
      "relationship_sentence": "Introduced the H-duality framework that this paper leverages to construct algorithms dual to anchor-based accelerated methods and to argue that optimal acceleration mechanisms are not unique."
    },
    {
      "title": "Optimal anchor-based acceleration for fixed-point problems",
      "authors": "J. Kim et al.",
      "year": 2023,
      "role": "Baseline",
      "relationship_sentence": "Proposed anchor-based accelerated fixed-point algorithms with optimal worst-case rates; the present paper produces H-dual methods achieving the same guarantees without anchoring, directly challenging the uniqueness of that mechanism."
    },
    {
      "title": "Optimal anchor-based acceleration for convex–concave minimax optimization",
      "authors": "T. Yoon et al.",
      "year": 2023,
      "role": "Baseline",
      "relationship_sentence": "Developed anchor-based accelerated algorithms for minimax problems that attain the lower-bound-optimal rates; the current work constructs H-dual counterparts with identical rates, proving optimal acceleration is not unique."
    }
  ],
  "synthesis_narrative": "The paper’s core insight—that optimal acceleration for minimax and fixed‑point problems is not unique—rests on two converging lines of work. First, the anchoring idea originates with Halpern’s 1967 iteration for nonexpansive mappings, which inspired modern anchor‑based accelerated algorithms for fixed‑point and saddle‑point/VI problems. Within the operator‑theoretic minimax/VI paradigm established by Nemirovski’s Mirror‑Prox, the community crystallized the oracle models and near‑optimal targets (e.g., Lin–Jin–Jordan). Crucially, matching first‑order complexity lower bounds (e.g., Diakonikolas et al.) certified that recently proposed anchor‑based accelerated methods are optimal, seemingly elevating anchoring to a unique mechanism for optimal acceleration. The second line is structural: the H‑duality framework (Ryu et al.) reveals dual relationships among first‑order operator methods. This paper marries these threads by using H‑duality to construct algorithms that are dual to the anchor‑based optimal methods for fixed‑point and minimax problems. The resulting H‑dual algorithms provably attain the same lower‑bound‑optimal worst‑case rates as the anchor‑based baselines (Kim et al.; Yoon et al.) without employing the anchoring mechanism, thereby demonstrating that optimal acceleration mechanisms are not unique. This reframes the design space: rather than a single canonical acceleration (anchoring), there exists a family of provably optimal yet behaviorally distinct methods connected via H‑duality.",
  "analysis_timestamp": "2026-01-06T23:09:26.465915"
}